RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the EEI14 field to a new value. */
#define DMA_WR_EEI_EEI14(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI14_MASK, DMA_EEI_EEI14(value)))
#define DMA_BWR_EEI_EEI14(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI15[15] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI15 field. */
#define DMA_RD_EEI_EEI15(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI15_MASK) >> DMA_EEI_EEI15_SHIFT)
#define DMA_BRD_EEI_EEI15(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI15_SHIFT))

/*! @brief Set the EEI15 field to a new value. */
#define DMA_WR_EEI_EEI15(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI15_MASK, DMA_EEI_EEI15(value)))
#define DMA_BWR_EEI_EEI15(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI16[16] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI16 field. */
#define DMA_RD_EEI_EEI16(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI16_MASK) >> DMA_EEI_EEI16_SHIFT)
#define DMA_BRD_EEI_EEI16(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI16_SHIFT))

/*! @brief Set the EEI16 field to a new value. */
#define DMA_WR_EEI_EEI16(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI16_MASK, DMA_EEI_EEI16(value)))
#define DMA_BWR_EEI_EEI16(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI17[17] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI17 field. */
#define DMA_RD_EEI_EEI17(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI17_MASK) >> DMA_EEI_EEI17_SHIFT)
#define DMA_BRD_EEI_EEI17(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI17_SHIFT))

/*! @brief Set the EEI17 field to a new value. */
#define DMA_WR_EEI_EEI17(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI17_MASK, DMA_EEI_EEI17(value)))
#define DMA_BWR_EEI_EEI17(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI18[18] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI18 field. */
#define DMA_RD_EEI_EEI18(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI18_MASK) >> DMA_EEI_EEI18_SHIFT)
#define DMA_BRD_EEI_EEI18(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI18_SHIFT))

/*! @brief Set the EEI18 field to a new value. */
#define DMA_WR_EEI_EEI18(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI18_MASK, DMA_EEI_EEI18(value)))
#define DMA_BWR_EEI_EEI18(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI19[19] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI19 field. */
#define DMA_RD_EEI_EEI19(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI19_MASK) >> DMA_EEI_EEI19_SHIFT)
#define DMA_BRD_EEI_EEI19(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI19_SHIFT))

/*! @brief Set the EEI19 field to a new value. */
#define DMA_WR_EEI_EEI19(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI19_MASK, DMA_EEI_EEI19(value)))
#define DMA_BWR_EEI_EEI19(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI20[20] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI20 field. */
#define DMA_RD_EEI_EEI20(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI20_MASK) >> DMA_EEI_EEI20_SHIFT)
#define DMA_BRD_EEI_EEI20(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI20_SHIFT))

/*! @brief Set the EEI20 field to a new value. */
#define DMA_WR_EEI_EEI20(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI20_MASK, DMA_EEI_EEI20(value)))
#define DMA_BWR_EEI_EEI20(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI21[21] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI21 field. */
#define DMA_RD_EEI_EEI21(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI21_MASK) >> DMA_EEI_EEI21_SHIFT)
#define DMA_BRD_EEI_EEI21(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI21_SHIFT))

/*! @brief Set the EEI21 field to a new value. */
#define DMA_WR_EEI_EEI21(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI21_MASK, DMA_EEI_EEI21(value)))
#define DMA_BWR_EEI_EEI21(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI22[22] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI22 field. */
#define DMA_RD_EEI_EEI22(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI22_MASK) >> DMA_EEI_EEI22_SHIFT)
#define DMA_BRD_EEI_EEI22(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI22_SHIFT))

/*! @brief Set the EEI22 field to a new value. */
#define DMA_WR_EEI_EEI22(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI22_MASK, DMA_EEI_EEI22(value)))
#define DMA_BWR_EEI_EEI22(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI23[23] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI23 field. */
#define DMA_RD_EEI_EEI23(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI23_MASK) >> DMA_EEI_EEI23_SHIFT)
#define DMA_BRD_EEI_EEI23(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI23_SHIFT))

/*! @brief Set the EEI23 field to a new value. */
#define DMA_WR_EEI_EEI23(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI23_MASK, DMA_EEI_EEI23(value)))
#define DMA_BWR_EEI_EEI23(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI24[24] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI24 field. */
#define DMA_RD_EEI_EEI24(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI24_MASK) >> DMA_EEI_EEI24_SHIFT)
#define DMA_BRD_EEI_EEI24(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI24_SHIFT))

/*! @brief Set the EEI24 field to a new value. */
#define DMA_WR_EEI_EEI24(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI24_MASK, DMA_EEI_EEI24(value)))
#define DMA_BWR_EEI_EEI24(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI25[25] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI25 field. */
#define DMA_RD_EEI_EEI25(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI25_MASK) >> DMA_EEI_EEI25_SHIFT)
#define DMA_BRD_EEI_EEI25(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI25_SHIFT))

