RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the INT18 field to a new value. */
#define DMA_WR_INT_INT18(base, value) (DMA_RMW_INT(base, (DMA_INT_INT18_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT18(value)))
#define DMA_BWR_INT_INT18(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT19[19] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT19 field. */
#define DMA_RD_INT_INT19(base) ((DMA_INT_REG(base) & DMA_INT_INT19_MASK) >> DMA_INT_INT19_SHIFT)
#define DMA_BRD_INT_INT19(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT19_SHIFT))

/*! @brief Set the INT19 field to a new value. */
#define DMA_WR_INT_INT19(base, value) (DMA_RMW_INT(base, (DMA_INT_INT19_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT19(value)))
#define DMA_BWR_INT_INT19(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT20[20] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT20 field. */
#define DMA_RD_INT_INT20(base) ((DMA_INT_REG(base) & DMA_INT_INT20_MASK) >> DMA_INT_INT20_SHIFT)
#define DMA_BRD_INT_INT20(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT20_SHIFT))

/*! @brief Set the INT20 field to a new value. */
#define DMA_WR_INT_INT20(base, value) (DMA_RMW_INT(base, (DMA_INT_INT20_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT20(value)))
#define DMA_BWR_INT_INT20(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT21[21] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT21 field. */
#define DMA_RD_INT_INT21(base) ((DMA_INT_REG(base) & DMA_INT_INT21_MASK) >> DMA_INT_INT21_SHIFT)
#define DMA_BRD_INT_INT21(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT21_SHIFT))

/*! @brief Set the INT21 field to a new value. */
#define DMA_WR_INT_INT21(base, value) (DMA_RMW_INT(base, (DMA_INT_INT21_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT21(value)))
#define DMA_BWR_INT_INT21(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT22[22] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT22 field. */
#define DMA_RD_INT_INT22(base) ((DMA_INT_REG(base) & DMA_INT_INT22_MASK) >> DMA_INT_INT22_SHIFT)
#define DMA_BRD_INT_INT22(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT22_SHIFT))

/*! @brief Set the INT22 field to a new value. */
#define DMA_WR_INT_INT22(base, value) (DMA_RMW_INT(base, (DMA_INT_INT22_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT22(value)))
#define DMA_BWR_INT_INT22(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT23[23] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT23 field. */
#define DMA_RD_INT_INT23(base) ((DMA_INT_REG(base) & DMA_INT_INT23_MASK) >> DMA_INT_INT23_SHIFT)
#define DMA_BRD_INT_INT23(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT23_SHIFT))

/*! @brief Set the INT23 field to a new value. */
#define DMA_WR_INT_INT23(base, value) (DMA_RMW_INT(base, (DMA_INT_INT23_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT23(value)))
#define DMA_BWR_INT_INT23(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT24[24] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT24 field. */
#define DMA_RD_INT_INT24(base) ((DMA_INT_REG(base) & DMA_INT_INT24_MASK) >> DMA_INT_INT24_SHIFT)
#define DMA_BRD_INT_INT24(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT24_SHIFT))

/*! @brief Set the INT24 field to a new value. */
#define DMA_WR_INT_INT24(base, value) (DMA_RMW_INT(base, (DMA_INT_INT24_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT24(value)))
#define DMA_BWR_INT_INT24(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT25[25] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT25 field. */
#define DMA_RD_INT_INT25(base) ((DMA_INT_REG(base) & DMA_INT_INT25_MASK) >> DMA_INT_INT25_SHIFT)
#define DMA_BRD_INT_INT25(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT25_SHIFT))

/*! @brief Set the INT25 field to a new value. */
#define DMA_WR_INT_INT25(base, value) (DMA_RMW_INT(base, (DMA_INT_INT25_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT25(value)))
#define DMA_BWR_INT_INT25(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT26[26] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT26 field. */
#define DMA_RD_INT_INT26(base) ((DMA_INT_REG(base) & DMA_INT_INT26_MASK) >> DMA_INT_INT26_SHIFT)
#define DMA_BRD_INT_INT26(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT26_SHIFT))

/*! @brief Set the INT26 field to a new value. */
#define DMA_WR_INT_INT26(base, value) (DMA_RMW_INT(base, (DMA_INT_INT26_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT26(value)))
#define DMA_BWR_INT_INT26(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT27[27] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT27 field. */
#define DMA_RD_INT_INT27(base) ((DMA_INT_REG(base) & DMA_INT_INT27_MASK) >> DMA_INT_INT27_SHIFT)
#define DMA_BRD_INT_INT27(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT27_SHIFT))

/*! @brief Set the INT27 field to a new value. */
#define DMA_WR_INT_INT27(base, value) (DMA_RMW_INT(base, (DMA_INT_INT27_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT27(value)))
#define DMA_BWR_INT_INT27(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT28[28] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT28 field. */
#define DMA_RD_INT_INT28(base) ((DMA_INT_REG(base) & DMA_INT_INT28_MASK) >> DMA_INT_INT28_SHIFT)
#define DMA_BRD_INT_INT28(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT28_SHIFT))

/*! @brief Set the INT28 field to a new value. */
#define DMA_WR_INT_INT28(base, value) (DMA_RMW_INT(base, (DMA_INT_INT28_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT28(value)))
#define DMA_BWR_INT_INT28(base, value) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_INT, field INT29[29] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT29 field. */
#define DMA_RD_INT_INT29(base) ((DMA_INT_REG(base) & DMA_INT_INT29_MASK) >> DMA_INT_INT29_SHIFT)
#define DMA_BRD_INT_INT29(base) (BITBAND_ACCESS32(&DMA_INT_REG(base), DMA_INT_INT29_SHIFT))

