RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * ENET_RDAR - Receive Descriptor Active Register
 ******************************************************************************/

/*!
 * @brief ENET_RDAR - Receive Descriptor Active Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * RDAR is a command register, written by the user, to indicate that the receive
 * descriptor ring has been updated, that is, that the driver produced empty
 * receive buffers with the empty bit set.
 */
/*!
 * @name Constants and macros for entire ENET_RDAR register
 */
/*@{*/
#define ENET_RD_RDAR(base)       (ENET_RDAR_REG(base))
#define ENET_WR_RDAR(base, value) (ENET_RDAR_REG(base) = (value))
#define ENET_RMW_RDAR(base, mask, value) (ENET_WR_RDAR(base, (ENET_RD_RDAR(base) & ~(mask)) | (value)))
#define ENET_SET_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) |  (value)))
#define ENET_CLR_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) & ~(value)))
#define ENET_TOG_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RDAR bitfields
 */

/*!
 * @name Register ENET_RDAR, field RDAR[24] (RW)
 *
 * Always set to 1 when this register is written, regardless of the value
 * written. This field is cleared by the MAC device when no additional empty
 * descriptors remain in the receive ring. It is also cleared when ECR[ETHEREN] transitions
 * from set to cleared or when ECR[RESET] is set.
 */
/*@{*/
/*! @brief Read current value of the ENET_RDAR_RDAR field. */
#define ENET_RD_RDAR_RDAR(base) ((ENET_RDAR_REG(base) & ENET_RDAR_RDAR_MASK) >> ENET_RDAR_RDAR_SHIFT)
#define ENET_BRD_RDAR_RDAR(base) (BITBAND_ACCESS32(&ENET_RDAR_REG(base), ENET_RDAR_RDAR_SHIFT))

/*! @brief Set the RDAR field to a new value. */
#define ENET_WR_RDAR_RDAR(base, value) (ENET_RMW_RDAR(base, ENET_RDAR_RDAR_MASK, ENET_RDAR_RDAR(value)))
#define ENET_BWR_RDAR_RDAR(base, value) (BITBAND_ACCESS32(&ENET_RDAR_REG(base), ENET_RDAR_RDAR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_TDAR - Transmit Descriptor Active Register
 ******************************************************************************/

/*!
 * @brief ENET_TDAR - Transmit Descriptor Active Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The TDAR is a command register that the user writes to indicate that the
 * transmit descriptor ring has been updated, that is, that transmit buffers have
 * been produced by the driver with the ready bit set in the buffer descriptor. The
 * TDAR register is cleared at reset, when ECR[ETHEREN] transitions from set to
 * cleared, or when ECR[RESET] is set.
 */
/*!
 * @name Constants and macros for entire ENET_TDAR register
 */
/*@{*/
#define ENET_RD_TDAR(base)       (ENET_TDAR_REG(base))
#define ENET_WR_TDAR(base, value) (ENET_TDAR_REG(base) = (value))
#define ENET_RMW_TDAR(base, mask, value) (ENET_WR_TDAR(base, (ENET_RD_TDAR(base) & ~(mask)) | (value)))
#define ENET_SET_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) |  (value)))
#define ENET_CLR_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) & ~(value)))
#define ENET_TOG_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TDAR bitfields
 */

/*!
 * @name Register ENET_TDAR, field TDAR[24] (RW)
 *
 * Always set to 1 when this register is written, regardless of the value
 * written. This bit is cleared by the MAC device when no additional ready descriptors
 * remain in the transmit ring. Also cleared when ECR[ETHEREN] transitions from
 * set to cleared or when ECR[RESET] is set.
 */
/*@{*/
/*! @brief Read current value of the ENET_TDAR_TDAR field. */
#define ENET_RD_TDAR_TDAR(base) ((ENET_TDAR_REG(base) & ENET_TDAR_TDAR_MASK) >> ENET_TDAR_TDAR_SHIFT)
#define ENET_BRD_TDAR_TDAR(base) (BITBAND_ACCESS32(&ENET_TDAR_REG(base), ENET_TDAR_TDAR_SHIFT))

/*! @brief Set the TDAR field to a new value. */
#define ENET_WR_TDAR_TDAR(base, value) (ENET_RMW_TDAR(base, ENET_TDAR_TDAR_MASK, ENET_TDAR_TDAR(value)))
#define ENET_BWR_TDAR_TDAR(base, value) (BITBAND_ACCESS32(&ENET_TDAR_REG(base), ENET_TDAR_TDAR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_ECR - Ethernet Control Register
 ******************************************************************************/

/*!
 * @brief ENET_ECR - Ethernet Control Register (RW)
 *
 * Reset value: 0xF0000000U
 *
 * ECR is a read/write user register, though hardware may also alter fields in
 * this register. It controls many of the high level features of the Ethernet MAC,
 * including legacy FEC support through the EN1588 field.
 */
/*!
 * @name Constants and macros for entire ENET_ECR register
 */
/*@{*/
#define ENET_RD_ECR(base)        (ENET_ECR_REG(base))
#define ENET_WR_ECR(base, value) (ENET_ECR_REG(base) = (value))
#define ENET_RMW_ECR(base, mask, value) (ENET_WR_ECR(base, (ENET_RD_ECR(base) & ~(mask)) | (value)))
#define ENET_SET_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) |  (value)))
#define ENET_CLR_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) & ~(value)))
#define ENET_TOG_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_ECR bitfields
 */

/*!
 * @name Register ENET_ECR, field RESET[0] (RW)
 *
 * When this field is set, it clears the ETHEREN field.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_RESET field. */
#define ENET_RD_ECR_RESET(base) ((ENET_ECR_REG(base) & ENET_ECR_RESET_MASK) >> ENET_ECR_RESET_SHIFT)
#define ENET_BRD_ECR_RESET(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_RESET_SHIFT))

/*! @brief Set the RESET field to a new value. */
#define ENET_WR_ECR_RESET(base, value) (ENET_RMW_ECR(base, ENET_ECR_RESET_MASK, ENET_ECR_RESET(value)))
#define ENET_BWR_ECR_RESET(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_RESET_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field ETHEREN[1] (RW)
 *
 * Enables/disables the Ethernet MAC. When the MAC is disabled, the buffer
 * descriptors for an aborted transmit frame are not updated. The uDMA, buffer
 * descriptor, and FIFO control logic are reset, including the buffer descriptor and
 * FIFO pointers. Hardware clears this field under the following conditions: RESET
 * is set by software An error condition causes the EBERR field to set. ETHEREN
 * must be set at the very last step during ENET
 * configuration/setup/initialization, only after all other ENET-related registers have been configured. If ETHEREN
 * is cleared to 0 by software then next time ETHEREN is set, the EIR interrupts
 * must cleared to 0 due to previous pending interrupts.
 *
 * Values:
 * - 0b0 - Reception immediately stops and transmission stops after a bad CRC is
 *     appended to any currently transmitted frame.
 * - 0b1 - MAC is enabled, and reception and transmission are possible.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_ETHEREN field. */
#define ENET_RD_ECR_ETHEREN(base) ((ENET_ECR_REG(base) & ENET_ECR_ETHEREN_MASK) >> ENET_ECR_ETHEREN_SHIFT)
#define ENET_BRD_ECR_ETHEREN(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_ETHEREN_SHIFT))

/*! @brief Set the ETHEREN field to a new value. */
#define ENET_WR_ECR_ETHEREN(base, value) (ENET_RMW_ECR(base, ENET_ECR_ETHEREN_MASK, ENET_ECR_ETHEREN(value)))
#define ENET_BWR_ECR_ETHEREN(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_ETHEREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field MAGICEN[2] (RW)
 *
 * Enables/disables magic packet detection. MAGICEN is relevant only if the
 * SLEEP field is set. If MAGICEN is set, changing the SLEEP field enables/disables
 * sleep mode and magic packet detection.
 *
 * Values:
 * - 0b0 - Magic detection logic disabled.
 * - 0b1 - The MAC core detects magic packets and asserts EIR[WAKEUP] when a
 *     frame is detected.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_MAGICEN field. */
#define ENET_RD_ECR_MAGICEN(base) ((ENET_ECR_REG(base) & ENET_ECR_MAGICEN_MASK) >> ENET_ECR_MAGICEN_SHIFT)
#define ENET_BRD_ECR_MAGICEN(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_MAGICEN_SHIFT))

/*! @brief Set the MAGICEN field to a new value. */
#define ENET_WR_ECR_MAGICEN(base, value) (ENET_RMW_ECR(base, ENET_ECR_MAGICEN_MASK, ENET_ECR_MAGICEN(value)))
#define ENET_BWR_ECR_MAGICEN(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_MAGICEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field SLEEP[3] (RW)
 *
 * Values:
 * - 0b0 - Normal operating mode.
 * - 0b1 - Sleep mode.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_SLEEP field. */
#define ENET_RD_ECR_SLEEP(base) ((ENET_ECR_REG(base) & ENET_ECR_SLEEP_MASK) >> ENET_ECR_SLEEP_SHIFT)
#define ENET_BRD_ECR_SLEEP(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_SLEEP_SHIFT))

/*! @brief Set the SLEEP field to a new value. */
#define ENET_WR_ECR_SLEEP(base, value) (ENET_RMW_ECR(base, ENET_ECR_SLEEP_MASK, ENET_ECR_SLEEP(value)))
#define ENET_BWR_ECR_SLEEP(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_SLEEP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field EN1588[4] (RW)
 *
 * Enables enhanced functionality of the MAC.
 *
 * Values:
 * - 0b0 - Legacy FEC buffer descriptors and functions enabled.
 * - 0b1 - Enhanced frame time-stamping functions enabled.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_EN1588 field. */
#define ENET_RD_ECR_EN1588(base) ((ENET_ECR_REG(base) & ENET_ECR_EN1588_MASK) >> ENET_ECR_EN1588_SHIFT)
#define ENET_BRD_ECR_EN1588(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_EN1588_SHIFT))

/*! @brief Set the EN1588 field to a new value. */
#define ENET_WR_ECR_EN1588(base, value) (ENET_RMW_ECR(base, ENET_ECR_EN1588_MASK, ENET_ECR_EN1588(value)))
#define ENET_BWR_ECR_EN1588(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_EN1588_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field DBGEN[6] (RW)
 *
 * Enables the MAC to enter hardware freeze mode when the device enters debug
 * mode.
 *
 * Values:
 * - 0b0 - MAC continues operation in debug mode.
 * - 0b1 - MAC enters hardware freeze mode when the processor is in debug mode.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_DBGEN field. */
#define ENET_RD_ECR_DBGEN(base) ((ENET_ECR_REG(base) & ENET_ECR_DBGEN_MASK) >> ENET_ECR_DBGEN_SHIFT)
#define ENET_BRD_ECR_DBGEN(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_DBGEN_SHIFT))

/*! @brief Set the DBGEN field to a new value. */
#define ENET_WR_ECR_DBGEN(base, value) (ENET_RMW_ECR(base, ENET_ECR_DBGEN_MASK, ENET_ECR_DBGEN(value)))
#define ENET_BWR_ECR_DBGEN(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_DBGEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field STOPEN[7] (RW)
 *
 * Controls device behavior in doze mode. In doze mode, if this field is set
 * then all the clocks of the ENET assembly are disabled, except the RMII /MII
 * clock. Doze mode is similar to a conditional stop mode entry for the ENET assembly
 * depending on ECR[STOPEN]. If module clocks are gated in this mode, the module
 * can still wake the system after receiving a magic packet in stop mode. MAGICEN
 * must be set prior to entering sleep/stop mode.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_STOPEN field. */
#define ENET_RD_ECR_STOPEN(base) ((ENET_ECR_REG(base) & ENET_ECR_STOPEN_MASK) >> ENET_ECR_STOPEN_SHIFT)
#define ENET_BRD_ECR_STOPEN(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_STOPEN_SHIFT))

/*! @brief Set the STOPEN field to a new value. */
#define ENET_WR_ECR_STOPEN(base, value) (ENET_RMW_ECR(base, ENET_ECR_STOPEN_MASK, ENET_ECR_STOPEN(value)))
#define ENET_BWR_ECR_STOPEN(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_STOPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ECR, field DBSWP[8] (RW)
 *
 * Swaps the byte locations of the buffer descriptors. This field must be
 * written to 1 after reset.
 *
 * Values:
 * - 0b0 - The buffer descriptor bytes are not swapped to support big-endian
 *     devices.
 * - 0b1 - The buffer descriptor bytes are swapped to support little-endian
 *     devices.
 */
/*@{*/
/*! @brief Read current value of the ENET_ECR_DBSWP field. */
#define ENET_RD_ECR_DBSWP(base) ((ENET_ECR_REG(base) & ENET_ECR_DBSWP_MASK) >> ENET_ECR_DBSWP_SHIFT)
#define ENET_BRD_ECR_DBSWP(base) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_DBSWP_SHIFT))

/*! @brief Set the DBSWP field to a new value. */
#define ENET_WR_ECR_DBSWP(base, value) (ENET_RMW_ECR(base, ENET_ECR_DBSWP_MASK, ENET_ECR_DBSWP(value)))
#define ENET_BWR_ECR_DBSWP(base, value) (BITBAND_ACCESS32(&ENET_ECR_REG(base), ENET_ECR_DBSWP_SHIFT) = (value))
/*@}*/

