RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * ENET_TACC - Transmit Accelerator Function Configuration
 ******************************************************************************/

/*!
 * @brief ENET_TACC - Transmit Accelerator Function Configuration (RW)
 *
 * Reset value: 0x00000000U
 *
 * TACC controls accelerator actions when sending frames. The register can be
 * changed before or after each frame, but it must remain unmodified during frame
 * writes into the transmit FIFO. The TFWR[STRFWD] field must be set to use the
 * checksum feature.
 */
/*!
 * @name Constants and macros for entire ENET_TACC register
 */
/*@{*/
#define ENET_RD_TACC(base)       (ENET_TACC_REG(base))
#define ENET_WR_TACC(base, value) (ENET_TACC_REG(base) = (value))
#define ENET_RMW_TACC(base, mask, value) (ENET_WR_TACC(base, (ENET_RD_TACC(base) & ~(mask)) | (value)))
#define ENET_SET_TACC(base, value) (ENET_WR_TACC(base, ENET_RD_TACC(base) |  (value)))
#define ENET_CLR_TACC(base, value) (ENET_WR_TACC(base, ENET_RD_TACC(base) & ~(value)))
#define ENET_TOG_TACC(base, value) (ENET_WR_TACC(base, ENET_RD_TACC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TACC bitfields
 */

/*!
 * @name Register ENET_TACC, field SHIFT16[0] (RW)
 *
 * Values:
 * - 0b0 - Disabled.
 * - 0b1 - Indicates to the transmit data FIFO that the written frames contain
 *     two additional octets before the frame data. This means the actual frame
 *     begins at bit 16 of the first word written into the FIFO. This function
 *     allows putting the frame payload on a 32-bit boundary in memory, as the
 *     14-byte Ethernet header is extended to a 16-byte header.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_SHIFT16 field. */
#define ENET_RD_TACC_SHIFT16(base) ((ENET_TACC_REG(base) & ENET_TACC_SHIFT16_MASK) >> ENET_TACC_SHIFT16_SHIFT)
#define ENET_BRD_TACC_SHIFT16(base) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_SHIFT16_SHIFT))

/*! @brief Set the SHIFT16 field to a new value. */
#define ENET_WR_TACC_SHIFT16(base, value) (ENET_RMW_TACC(base, ENET_TACC_SHIFT16_MASK, ENET_TACC_SHIFT16(value)))
#define ENET_BWR_TACC_SHIFT16(base, value) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_SHIFT16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TACC, field IPCHK[3] (RW)
 *
 * Enables insertion of IP header checksum.
 *
 * Values:
 * - 0b0 - Checksum is not inserted.
 * - 0b1 - If an IP frame is transmitted, the checksum is inserted
 *     automatically. The IP header checksum field must be cleared. If a non-IP frame is
 *     transmitted the frame is not modified.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_IPCHK field. */
#define ENET_RD_TACC_IPCHK(base) ((ENET_TACC_REG(base) & ENET_TACC_IPCHK_MASK) >> ENET_TACC_IPCHK_SHIFT)
#define ENET_BRD_TACC_IPCHK(base) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_IPCHK_SHIFT))

/*! @brief Set the IPCHK field to a new value. */
#define ENET_WR_TACC_IPCHK(base, value) (ENET_RMW_TACC(base, ENET_TACC_IPCHK_MASK, ENET_TACC_IPCHK(value)))
#define ENET_BWR_TACC_IPCHK(base, value) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_IPCHK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_TACC, field PROCHK[4] (RW)
 *
 * Enables insertion of protocol checksum.
 *
 * Values:
 * - 0b0 - Checksum not inserted.
 * - 0b1 - If an IP frame with a known protocol is transmitted, the checksum is
 *     inserted automatically into the frame. The checksum field must be cleared.
 *     The other frames are not modified.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_PROCHK field. */
#define ENET_RD_TACC_PROCHK(base) ((ENET_TACC_REG(base) & ENET_TACC_PROCHK_MASK) >> ENET_TACC_PROCHK_SHIFT)
#define ENET_BRD_TACC_PROCHK(base) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_PROCHK_SHIFT))

/*! @brief Set the PROCHK field to a new value. */
#define ENET_WR_TACC_PROCHK(base, value) (ENET_RMW_TACC(base, ENET_TACC_PROCHK_MASK, ENET_TACC_PROCHK(value)))
#define ENET_BWR_TACC_PROCHK(base, value) (BITBAND_ACCESS32(&ENET_TACC_REG(base), ENET_TACC_PROCHK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_RACC - Receive Accelerator Function Configuration
 ******************************************************************************/

/*!
 * @brief ENET_RACC - Receive Accelerator Function Configuration (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RACC register
 */
/*@{*/
#define ENET_RD_RACC(base)       (ENET_RACC_REG(base))
#define ENET_WR_RACC(base, value) (ENET_RACC_REG(base) = (value))
#define ENET_RMW_RACC(base, mask, value) (ENET_WR_RACC(base, (ENET_RD_RACC(base) & ~(mask)) | (value)))
#define ENET_SET_RACC(base, value) (ENET_WR_RACC(base, ENET_RD_RACC(base) |  (value)))
#define ENET_CLR_RACC(base, value) (ENET_WR_RACC(base, ENET_RD_RACC(base) & ~(value)))
#define ENET_TOG_RACC(base, value) (ENET_WR_RACC(base, ENET_RD_RACC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RACC bitfields
 */

/*!
 * @name Register ENET_RACC, field PADREM[0] (RW)
 *
 * Values:
 * - 0b0 - Padding not removed.
 * - 0b1 - Any bytes following the IP payload section of the frame are removed
 *     from the frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_PADREM field. */
#define ENET_RD_RACC_PADREM(base) ((ENET_RACC_REG(base) & ENET_RACC_PADREM_MASK) >> ENET_RACC_PADREM_SHIFT)
#define ENET_BRD_RACC_PADREM(base) (BITBAND_ACCESS32(&ENET_RACC_REG(base), ENET_RACC_PADREM_SHIFT))

/*! @brief Set the PADREM field to a new value. */
#define ENET_WR_RACC_PADREM(base, value) (ENET_RMW_RACC(base, ENET_RACC_PADREM_MASK, ENET_RACC_PADREM(value)))
#define ENET_BWR_RACC_PADREM(base, value) (BITBAND_ACCESS32(&ENET_RACC_REG(base), ENET_RACC_PADREM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RACC, field IPDIS[1] (RW)
 *
 * Values:
 * - 0b0 - Frames with wrong IPv4 header checksum are not discarded.
 * - 0b1 - If an IPv4 frame is received with a mismatching header checksum, the
 *     frame is discarded. IPv6 has no header checksum and is not affected by
 *     this setting. Discarding is only available when the RX FIFO operates in store
 *     and forward mode (RSFL cleared).
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_IPDIS field. */
#define ENET_RD_RACC_IPDIS(base) ((ENET_RACC_REG(base) & ENET_RACC_IPDIS_MASK) >> ENET_RACC_IPDIS_SHIFT)
#define ENET_BRD_RACC_IPDIS(base) (BITBAND_ACCESS32(&ENET_RACC_REG(base), ENET_RACC_IPDIS_SHIFT))

