RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * FMC_PFB23CR - Flash Bank 2-3 Control Register
 ******************************************************************************/

/*!
 * @brief FMC_PFB23CR - Flash Bank 2-3 Control Register (RW)
 *
 * Reset value: 0x3004001FU
 *
 * The PFB23CR register has a format similar to the PFB01CR register, except
 * that PFB23CR's "global" cache control fields are empty. In FlexMemory mode, where
 * flash memory banks 0, 1, and 2 are used for program flash and flash memory
 * bank 3 is used for FlexNVM, the FMC_PFB23CR register controls the operation of
 * flash memory bank 3 (FlexNVM). In Program Flash Only mode, where flash memory
 * banks 0, 1, 2, and 3 are used for program flash, the PFB23CR register controls
 * the operation of flash memory banks 2 and 3.
 */
/*!
 * @name Constants and macros for entire FMC_PFB23CR register
 */
/*@{*/
#define FMC_RD_PFB23CR(base)     (FMC_PFB23CR_REG(base))
#define FMC_WR_PFB23CR(base, value) (FMC_PFB23CR_REG(base) = (value))
#define FMC_RMW_PFB23CR(base, mask, value) (FMC_WR_PFB23CR(base, (FMC_RD_PFB23CR(base) & ~(mask)) | (value)))
#define FMC_SET_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) |  (value)))
#define FMC_CLR_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) & ~(value)))
#define FMC_TOG_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFB23CR bitfields
 */

/*!
 * @name Register FMC_PFB23CR, field RFU[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_RFU field. */
#define FMC_RD_PFB23CR_RFU(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_RFU_MASK) >> FMC_PFB23CR_RFU_SHIFT)
#define FMC_BRD_PFB23CR_RFU(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_RFU_SHIFT))

/*! @brief Set the RFU field to a new value. */
#define FMC_WR_PFB23CR_RFU(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_RFU_MASK, FMC_PFB23CR_RFU(value)))
#define FMC_BWR_PFB23CR_RFU(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_RFU_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1IPE[1] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to instruction fetches.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to instruction fetches.
 * - 0b1 - Enable prefetches in response to instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1IPE field. */
#define FMC_RD_PFB23CR_B1IPE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1IPE_MASK) >> FMC_PFB23CR_B1IPE_SHIFT)
#define FMC_BRD_PFB23CR_B1IPE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1IPE_SHIFT))

/*! @brief Set the B1IPE field to a new value. */
#define FMC_WR_PFB23CR_B1IPE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B1IPE_MASK, FMC_PFB23CR_B1IPE(value)))
#define FMC_BWR_PFB23CR_B1IPE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1IPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1DPE[2] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to data references.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to data references.
 * - 0b1 - Enable prefetches in response to data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1DPE field. */
#define FMC_RD_PFB23CR_B1DPE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1DPE_MASK) >> FMC_PFB23CR_B1DPE_SHIFT)
#define FMC_BRD_PFB23CR_B1DPE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1DPE_SHIFT))

/*! @brief Set the B1DPE field to a new value. */
#define FMC_WR_PFB23CR_B1DPE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B1DPE_MASK, FMC_PFB23CR_B1DPE(value)))
#define FMC_BWR_PFB23CR_B1DPE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1DPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1ICE[3] (RW)
 *
 * This bit controls whether instruction fetches are loaded into the cache.
 *
 * Values:
 * - 0b0 - Do not cache instruction fetches.
 * - 0b1 - Cache instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1ICE field. */
#define FMC_RD_PFB23CR_B1ICE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1ICE_MASK) >> FMC_PFB23CR_B1ICE_SHIFT)
#define FMC_BRD_PFB23CR_B1ICE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1ICE_SHIFT))

/*! @brief Set the B1ICE field to a new value. */
#define FMC_WR_PFB23CR_B1ICE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B1ICE_MASK, FMC_PFB23CR_B1ICE(value)))
#define FMC_BWR_PFB23CR_B1ICE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1ICE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1DCE[4] (RW)
 *
 * This bit controls whether data references are loaded into the cache.
 *
 * Values:
 * - 0b0 - Do not cache data references.
 * - 0b1 - Cache data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1DCE field. */
#define FMC_RD_PFB23CR_B1DCE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1DCE_MASK) >> FMC_PFB23CR_B1DCE_SHIFT)
#define FMC_BRD_PFB23CR_B1DCE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1DCE_SHIFT))

/*! @brief Set the B1DCE field to a new value. */
#define FMC_WR_PFB23CR_B1DCE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B1DCE_MASK, FMC_PFB23CR_B1DCE(value)))
#define FMC_BWR_PFB23CR_B1DCE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B1DCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1MW[18:17] (RO)
 *
 * This read-only field defines the width of bank 1 memory.
 *
 * Values:
 * - 0b00 - 32 bits
 * - 0b01 - 64 bits
 * - 0b10 - 128 bits
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1MW field. */
#define FMC_RD_PFB23CR_B1MW(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1MW_MASK) >> FMC_PFB23CR_B1MW_SHIFT)
#define FMC_BRD_PFB23CR_B1MW(base) (FMC_RD_PFB23CR_B1MW(base))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B1RWSC[31:28] (RO)
 *
 * This read-only field defines the number of wait states required to access
 * bank 1 flash memory. The relationship between the read access time of the flash
 * array (expressed in system clock cycles) and RWSC is defined as: Access time of
 * flash array [system clocks] = RWSC + 1 The FMC automatically calculates this
 * value based on the ratio of the system clock speed to the flash clock speed.
 * For example, when this ratio is 4:1, the field's value is 3h.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B1RWSC field. */
#define FMC_RD_PFB23CR_B1RWSC(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B1RWSC_MASK) >> FMC_PFB23CR_B1RWSC_SHIFT)
#define FMC_BRD_PFB23CR_B1RWSC(base) (FMC_RD_PFB23CR_B1RWSC(base))
/*@}*/

