RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * FTFE_XACCL0 - Execute-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_XACCL0 - Execute-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The XACC registers define which program flash segments are restricted to data
 * read or execute only or both data and instruction fetches. The eight XACC
 * registers allow up to 64 restricted segments of equal memory size. Execute-only
 * access register Program flash execute-only access bits XACCH0 XA[63:56] XACCH1
 * XA[55:48] XACCH2 XA[47:40] XACCH3 XA[39:32] XACCL0 XA[31:24] XACCL1 XA[23:16]
 * XACCL2 XA[15:8] XACCL3 XA[7:0] During the reset sequence, the XACC registers
 * are loaded with the logical AND of Program Flash IFR addresses A and B as
 * indicated in the following table. Execute-only access register Program Flash IFR
 * address A Program Flash IFR address B XACCH0 0x03A3 0x03AB XACCH1 0x03A2 0x03AA
 * XACCH2 0x03A1 0x03A9 XACCH3 0x03A0 0x03A8 XACCL0 0x03A7 0x03AF XACCL1 0x03A6
 * 0x03AE XACCL2 0x03A5 0x03AD XACCL3 0x03A4 0x03AC Use the Program Once command
 * to program the execute-only access control fields that are loaded during the
 * reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_XACCL0 register
 */
/*@{*/
#define FTFE_RD_XACCL0(base)     (FTFE_XACCL0_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCH3 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCH3 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCH3 register
 */
/*@{*/
#define FTFE_RD_SACCH3(base)     (FTFE_SACCH3_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCH2 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCH2 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCH2 register
 */
/*@{*/
#define FTFE_RD_SACCH2(base)     (FTFE_SACCH2_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCH1 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCH1 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCH1 register
 */
/*@{*/
#define FTFE_RD_SACCH1(base)     (FTFE_SACCH1_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_SACCH0 - Supervisor-only Access Registers
 ******************************************************************************/

/*!
 * @brief FTFE_SACCH0 - Supervisor-only Access Registers (RO)
 *
 * Reset value: 0x00U
 *
 * The SACC registers define which program flash segments are restricted to
 * supervisor only or user and supervisor access. The eight SACC registers allow up
 * to 64 restricted segments of equal memory size. Supervisor-only access register
 * Program flash supervisor-only access bits SACCH0 SA[63:56] SACCH1 SA[55:48]
 * SACCH2 SA[47:40] SACCH3 SA[39:32] SACCL0 SA[31:24] SACCL1 SA[23:16] SACCL2
 * SA[15:8] SACCL3 SA[7:0] During the reset sequence, the SACC registers are loaded
 * with the logical AND of Program Flash IFR addresses A and B as indicated in the
 * following table. Supervisor-only access register Program Flash IFR address A
 * Program Flash IFR address B SACCH0 0x03B3 0x03BB SACCH1 0x03B2 0x03BA SACCH2
 * 0x03B1 0x03B9 SACCH3 0x03B0 0x03B8 SACCL0 0x03B7 0x03BF SACCL1 0x03B6 0x03BE
 * SACCL2 0x03B5 0x03BD SACCL3 0x03B4 0x03BC Use the Program Once command to
 * program the supervisor-only access control fields that are loaded during the reset
 * sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_SACCH0 register
 */
/*@{*/
#define FTFE_RD_SACCH0(base)     (FTFE_SACCH0_REG(base))
/*@}*/

