RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * LMEM_PCCLCR - Cache line control register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCLCR - Cache line control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines specific line-sized cache operations to be performed
 * using a specific cache line address or a physical address. If a physical address
 * is specified, both ways of the cache are searched, and the command is only
 * performed on the way which hits.
 */
/*!
 * @name Constants and macros for entire LMEM_PCCLCR register
 */
/*@{*/
#define LMEM_RD_PCCLCR(base)     (LMEM_PCCLCR_REG(base))
#define LMEM_WR_PCCLCR(base, value) (LMEM_PCCLCR_REG(base) = (value))
#define LMEM_RMW_PCCLCR(base, mask, value) (LMEM_WR_PCCLCR(base, (LMEM_RD_PCCLCR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) |  (value)))
#define LMEM_CLR_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) & ~(value)))
#define LMEM_TOG_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PCCLCR bitfields
 */

/*!
 * @name Register LMEM_PCCLCR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CSAR[LGO]
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no line command active.
 * - 0b1 - Write: initiate line command indicated by bits 27-24. Read: line
 *     command active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LGO field. */
#define LMEM_RD_PCCLCR_LGO(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LGO_MASK) >> LMEM_PCCLCR_LGO_SHIFT)
#define LMEM_BRD_PCCLCR_LGO(base) (LMEM_RD_PCCLCR_LGO(base))

/*! @brief Set the LGO field to a new value. */
#define LMEM_WR_PCCLCR_LGO(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LGO_MASK, LMEM_PCCLCR_LGO(value)))
#define LMEM_BWR_PCCLCR_LGO(base, value) (LMEM_WR_PCCLCR_LGO(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field CACHEADDR[11:2] (RW)
 *
 * CLCR[11:4] bits are used to access the tag arrays CLCR[11:2] bits are used to
 * access the data arrays
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_CACHEADDR field. */
#define LMEM_RD_PCCLCR_CACHEADDR(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_CACHEADDR_MASK) >> LMEM_PCCLCR_CACHEADDR_SHIFT)
#define LMEM_BRD_PCCLCR_CACHEADDR(base) (LMEM_RD_PCCLCR_CACHEADDR(base))

/*! @brief Set the CACHEADDR field to a new value. */
#define LMEM_WR_PCCLCR_CACHEADDR(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_CACHEADDR_MASK, LMEM_PCCLCR_CACHEADDR(value)))
#define LMEM_BWR_PCCLCR_CACHEADDR(base, value) (LMEM_WR_PCCLCR_CACHEADDR(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field WSEL[14] (RW)
 *
 * Selects the way for line commands.
 *
 * Values:
 * - 0b0 - Way 0
 * - 0b1 - Way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_WSEL field. */
#define LMEM_RD_PCCLCR_WSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_WSEL_MASK) >> LMEM_PCCLCR_WSEL_SHIFT)
#define LMEM_BRD_PCCLCR_WSEL(base) (LMEM_RD_PCCLCR_WSEL(base))

/*! @brief Set the WSEL field to a new value. */
#define LMEM_WR_PCCLCR_WSEL(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_WSEL_MASK, LMEM_PCCLCR_WSEL(value)))
#define LMEM_BWR_PCCLCR_WSEL(base, value) (LMEM_WR_PCCLCR_WSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field TDSEL[16] (RW)
 *
 * Selects tag or data for search and read or write commands.
 *
 * Values:
 * - 0b0 - Data
 * - 0b1 - Tag
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_TDSEL field. */
#define LMEM_RD_PCCLCR_TDSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_TDSEL_MASK) >> LMEM_PCCLCR_TDSEL_SHIFT)
#define LMEM_BRD_PCCLCR_TDSEL(base) (LMEM_RD_PCCLCR_TDSEL(base))

/*! @brief Set the TDSEL field to a new value. */
#define LMEM_WR_PCCLCR_TDSEL(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_TDSEL_MASK, LMEM_PCCLCR_TDSEL(value)))
#define LMEM_BWR_PCCLCR_TDSEL(base, value) (LMEM_WR_PCCLCR_TDSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCIVB[20] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the valid bit If command used physical address and a hit, then this bit
 * shows the initial state of the valid bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCIVB field. */
#define LMEM_RD_PCCLCR_LCIVB(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCIVB_MASK) >> LMEM_PCCLCR_LCIVB_SHIFT)
#define LMEM_BRD_PCCLCR_LCIVB(base) (LMEM_RD_PCCLCR_LCIVB(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCIMB[21] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the modified bit If command used physical address and a hit, then this bit
 * shows the initial state of the modified bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCIMB field. */
#define LMEM_RD_PCCLCR_LCIMB(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCIMB_MASK) >> LMEM_PCCLCR_LCIMB_SHIFT)
#define LMEM_BRD_PCCLCR_LCIMB(base) (LMEM_RD_PCCLCR_LCIMB(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCWAY[22] (RO)
 *
 * Indicates the way used by the line command.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCWAY field. */
#define LMEM_RD_PCCLCR_LCWAY(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCWAY_MASK) >> LMEM_PCCLCR_LCWAY_SHIFT)
#define LMEM_BRD_PCCLCR_LCWAY(base) (LMEM_RD_PCCLCR_LCWAY(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCMD[25:24] (RW)
 *
 * Values:
 * - 0b00 - Search and read or write
 * - 0b01 - Invalidate
 * - 0b10 - Push
 * - 0b11 - Clear
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCMD field. */
#define LMEM_RD_PCCLCR_LCMD(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCMD_MASK) >> LMEM_PCCLCR_LCMD_SHIFT)
#define LMEM_BRD_PCCLCR_LCMD(base) (LMEM_RD_PCCLCR_LCMD(base))

/*! @brief Set the LCMD field to a new value. */
#define LMEM_WR_PCCLCR_LCMD(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LCMD_MASK, LMEM_PCCLCR_LCMD(value)))
#define LMEM_BWR_PCCLCR_LCMD(base, value) (LMEM_WR_PCCLCR_LCMD(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LADSEL[26] (RW)
 *
 * When using the cache address, the way must also be specified in CLCR[WSEL].
 * When using the physical address, both ways are searched and the command is
 * performed only if a hit.
 *
 * Values:
 * - 0b0 - Cache address
 * - 0b1 - Physical address
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LADSEL field. */
#define LMEM_RD_PCCLCR_LADSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LADSEL_MASK) >> LMEM_PCCLCR_LADSEL_SHIFT)
#define LMEM_BRD_PCCLCR_LADSEL(base) (LMEM_RD_PCCLCR_LADSEL(base))

