RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the DMX32 field to a new value. */
#define MCG_WR_C4_DMX32(base, value) (MCG_RMW_C4(base, MCG_C4_DMX32_MASK, MCG_C4_DMX32(value)))
#define MCG_BWR_C4_DMX32(base, value) (BITBAND_ACCESS8(&MCG_C4_REG(base), MCG_C4_DMX32_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_C5 - MCG Control 5 Register
 ******************************************************************************/

/*!
 * @brief MCG_C5 - MCG Control 5 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C5 register
 */
/*@{*/
#define MCG_RD_C5(base)          (MCG_C5_REG(base))
#define MCG_WR_C5(base, value)   (MCG_C5_REG(base) = (value))
#define MCG_RMW_C5(base, mask, value) (MCG_WR_C5(base, (MCG_RD_C5(base) & ~(mask)) | (value)))
#define MCG_SET_C5(base, value)  (MCG_WR_C5(base, MCG_RD_C5(base) |  (value)))
#define MCG_CLR_C5(base, value)  (MCG_WR_C5(base, MCG_RD_C5(base) & ~(value)))
#define MCG_TOG_C5(base, value)  (MCG_WR_C5(base, MCG_RD_C5(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C5 bitfields
 */

/*!
 * @name Register MCG_C5, field PRDIV[2:0] (RW)
 *
 * Selects the amount to divide down the external reference clock for the PLL0.
 * The resulting frequency must be in the range of 8 MHz to 16 MHz. After the
 * PLL0 is enabled (by setting either PLLCLKEN0 or PLLS), the PRDIV0 value must not
 * be changed when LOCK0 is zero. PLL External Reference Divide Factor PRDIV
 * Divide Factor 000 1 001 2 010 3 011 4 100 5 101 6 110 7 111 8
 */
/*@{*/
/*! @brief Read current value of the MCG_C5_PRDIV field. */
#define MCG_RD_C5_PRDIV(base) ((MCG_C5_REG(base) & MCG_C5_PRDIV_MASK) >> MCG_C5_PRDIV_SHIFT)
#define MCG_BRD_C5_PRDIV(base) (MCG_RD_C5_PRDIV(base))

/*! @brief Set the PRDIV field to a new value. */
#define MCG_WR_C5_PRDIV(base, value) (MCG_RMW_C5(base, MCG_C5_PRDIV_MASK, MCG_C5_PRDIV(value)))
#define MCG_BWR_C5_PRDIV(base, value) (MCG_WR_C5_PRDIV(base, value))
/*@}*/

/*!
 * @name Register MCG_C5, field PLLSTEN[5] (RW)
 *
 * Enables the PLL Clock during Normal Stop (In Low Power Stop mode, the PLL
 * clock gets disabled even if PLLSTEN=1). All other power modes, PLLSTEN bit has no
 * affect and does not enable the PLL Clock to run if it is written to 1.
 *
 * Values:
 * - 0b0 - MCGPLLCLK and MCGPLLCLK2X are disabled in any of the Stop modes.
 * - 0b1 - MCGPLLCLK and MCGPLLCLK2X are enabled if system is in Normal Stop
 *     mode.
 */
/*@{*/
/*! @brief Read current value of the MCG_C5_PLLSTEN field. */
#define MCG_RD_C5_PLLSTEN(base) ((MCG_C5_REG(base) & MCG_C5_PLLSTEN_MASK) >> MCG_C5_PLLSTEN_SHIFT)
#define MCG_BRD_C5_PLLSTEN(base) (BITBAND_ACCESS8(&MCG_C5_REG(base), MCG_C5_PLLSTEN_SHIFT))

/*! @brief Set the PLLSTEN field to a new value. */
#define MCG_WR_C5_PLLSTEN(base, value) (MCG_RMW_C5(base, MCG_C5_PLLSTEN_MASK, MCG_C5_PLLSTEN(value)))
#define MCG_BWR_C5_PLLSTEN(base, value) (BITBAND_ACCESS8(&MCG_C5_REG(base), MCG_C5_PLLSTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C5, field PLLCLKEN[6] (RW)
 *
 * Enables PLL independent of PLLS and enables the PLL clock for use as
 * MCGPLLCLK. (PRDIV needs to be programmed to the correct divider to generate a PLL
 * reference clock in a valid reference range prior to setting the PLLCLKEN bit).
 * Setting PLLCLKEN will enable the external oscillator if not already enabled.
 * Whenever the PLL is being enabled by means of the PLLCLKEN bit, and the external
 * oscillator is being used as the reference clock, the OSCINIT 0 bit should be
 * checked to make sure it is set.
 *
 * Values:
 * - 0b0 - MCGPLLCLK is inactive.
 * - 0b1 - MCGPLLCLK is active.
 */
/*@{*/
/*! @brief Read current value of the MCG_C5_PLLCLKEN field. */
#define MCG_RD_C5_PLLCLKEN(base) ((MCG_C5_REG(base) & MCG_C5_PLLCLKEN_MASK) >> MCG_C5_PLLCLKEN_SHIFT)
#define MCG_BRD_C5_PLLCLKEN(base) (BITBAND_ACCESS8(&MCG_C5_REG(base), MCG_C5_PLLCLKEN_SHIFT))

/*! @brief Set the PLLCLKEN field to a new value. */
#define MCG_WR_C5_PLLCLKEN(base, value) (MCG_RMW_C5(base, MCG_C5_PLLCLKEN_MASK, MCG_C5_PLLCLKEN(value)))
#define MCG_BWR_C5_PLLCLKEN(base, value) (BITBAND_ACCESS8(&MCG_C5_REG(base), MCG_C5_PLLCLKEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_C6 - MCG Control 6 Register
 ******************************************************************************/

/*!
 * @brief MCG_C6 - MCG Control 6 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C6 register
 */
/*@{*/
#define MCG_RD_C6(base)          (MCG_C6_REG(base))
#define MCG_WR_C6(base, value)   (MCG_C6_REG(base) = (value))
#define MCG_RMW_C6(base, mask, value) (MCG_WR_C6(base, (MCG_RD_C6(base) & ~(mask)) | (value)))
#define MCG_SET_C6(base, value)  (MCG_WR_C6(base, MCG_RD_C6(base) |  (value)))
#define MCG_CLR_C6(base, value)  (MCG_WR_C6(base, MCG_RD_C6(base) & ~(value)))
#define MCG_TOG_C6(base, value)  (MCG_WR_C6(base, MCG_RD_C6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C6 bitfields
 */

/*!
 * @name Register MCG_C6, field VDIV[4:0] (RW)
 *
 * Selects the amount to divide the VCO output of the PLL. The VDIV bits
 * establish the multiplication factor (M) applied to the reference clock frequency.
 * After the PLL is enabled (by setting either PLLCLKEN or PLLS), the VDIV value
 * must not be changed when LOCK is zero. PLL VCO Divide Factor VDIV Multiply Factor
 * VDIV Multiply Factor VDIV Multiply Factor VDIV Multiply Factor 00000 16 01000
 * 24 10000 32 11000 40 00001 17 01001 25 10001 33 11001 41 00010 18 01010 26
 * 10010 34 11010 42 00011 19 01011 27 10011 35 11011 43 00100 20 01100 28 10100 36
 * 11100 44 00101 21 01101 29 10101 37 11101 45 00110 22 01110 30 10110 38 11110
 * 46 00111 23 01111 31 10111 39 11111 47
 */
/*@{*/
/*! @brief Read current value of the MCG_C6_VDIV field. */
#define MCG_RD_C6_VDIV(base) ((MCG_C6_REG(base) & MCG_C6_VDIV_MASK) >> MCG_C6_VDIV_SHIFT)
#define MCG_BRD_C6_VDIV(base) (MCG_RD_C6_VDIV(base))

/*! @brief Set the VDIV field to a new value. */
#define MCG_WR_C6_VDIV(base, value) (MCG_RMW_C6(base, MCG_C6_VDIV_MASK, MCG_C6_VDIV(value)))
#define MCG_BWR_C6_VDIV(base, value) (MCG_WR_C6_VDIV(base, value))
/*@}*/

/*!
 * @name Register MCG_C6, field CME0[5] (RW)
 *
 * Enables the loss of clock monitoring circuit for the OSC0 external reference
 * mux select. The LOCRE0 bit will determine if a interrupt or a reset request is
 * generated following a loss of OSC0 indication. The CME0 bit must only be set
 * to a logic 1 when the MCG is in an operational mode that uses the external
 * clock (FEE, FBE, PEE, PBE, or BLPE) . Whenever the CME0 bit is set to a logic 1,
 * the value of the RANGE0 bits in the C2 register should not be changed. CME0
 * bit should be set to a logic 0 before the MCG enters any Stop mode. Otherwise, a
 * reset request may occur while in Stop mode. CME0 should also be set to a
 * logic 0 before entering VLPR or VLPW power modes if the MCG is in BLPE mode.
 *
 * Values:
 * - 0b0 - External clock monitor is disabled for OSC0.
 * - 0b1 - External clock monitor is enabled for OSC0.
 */
/*@{*/
/*! @brief Read current value of the MCG_C6_CME0 field. */
#define MCG_RD_C6_CME0(base) ((MCG_C6_REG(base) & MCG_C6_CME0_MASK) >> MCG_C6_CME0_SHIFT)
#define MCG_BRD_C6_CME0(base) (BITBAND_ACCESS8(&MCG_C6_REG(base), MCG_C6_CME0_SHIFT))

