RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * MCG_C9 - MCG Control 9 Register
 ******************************************************************************/

/*!
 * @brief MCG_C9 - MCG Control 9 Register (RW)
 *
 * Reset value: 0x10U
 */
/*!
 * @name Constants and macros for entire MCG_C9 register
 */
/*@{*/
#define MCG_RD_C9(base)          (MCG_C9_REG(base))
#define MCG_WR_C9(base, value)   (MCG_C9_REG(base) = (value))
#define MCG_RMW_C9(base, mask, value) (MCG_WR_C9(base, (MCG_RD_C9(base) & ~(mask)) | (value)))
#define MCG_SET_C9(base, value)  (MCG_WR_C9(base, MCG_RD_C9(base) |  (value)))
#define MCG_CLR_C9(base, value)  (MCG_WR_C9(base, MCG_RD_C9(base) & ~(value)))
#define MCG_TOG_C9(base, value)  (MCG_WR_C9(base, MCG_RD_C9(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C9 bitfields
 */

/*!
 * @name Register MCG_C9, field EXT_PLL_LOCS[0] (W1C)
 *
 * The EXT_PLL_LOCS indicates when a loss of MCG EXT_PLL clock has occurred.
 * This bit is cleared by writing a logic 1 to it when set.
 *
 * Values:
 * - 0b0 - Loss of MCG EXT_PLL has not occurred.
 * - 0b1 - Loss of MCG EXT_PLL has occurred.
 */
/*@{*/
/*! @brief Read current value of the MCG_C9_EXT_PLL_LOCS field. */
#define MCG_RD_C9_EXT_PLL_LOCS(base) ((MCG_C9_REG(base) & MCG_C9_EXT_PLL_LOCS_MASK) >> MCG_C9_EXT_PLL_LOCS_SHIFT)
#define MCG_BRD_C9_EXT_PLL_LOCS(base) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_EXT_PLL_LOCS_SHIFT))

/*! @brief Set the EXT_PLL_LOCS field to a new value. */
#define MCG_WR_C9_EXT_PLL_LOCS(base, value) (MCG_RMW_C9(base, MCG_C9_EXT_PLL_LOCS_MASK, MCG_C9_EXT_PLL_LOCS(value)))
#define MCG_BWR_C9_EXT_PLL_LOCS(base, value) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_EXT_PLL_LOCS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C9, field PLL_LOCRE[4] (RW)
 *
 * Determines wheather an interrupt or a reset request is made following a loss
 * of the MCG External PLL clock when the MCG is running in PEE (CLKST=11) mode
 * with the External PLL selected (PLLCS=1).
 *
 * Values:
 * - 0b0 - Interrupt request is generated on a invalid or loss of the MCG
 *     external PLL clock.
 * - 0b1 - Generates a system reset request on a invalid or loss of the MCG
 *     external PLL clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_C9_PLL_LOCRE field. */
#define MCG_RD_C9_PLL_LOCRE(base) ((MCG_C9_REG(base) & MCG_C9_PLL_LOCRE_MASK) >> MCG_C9_PLL_LOCRE_SHIFT)
#define MCG_BRD_C9_PLL_LOCRE(base) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_PLL_LOCRE_SHIFT))

/*! @brief Set the PLL_LOCRE field to a new value. */
#define MCG_WR_C9_PLL_LOCRE(base, value) (MCG_RMW_C9(base, (MCG_C9_PLL_LOCRE_MASK | MCG_C9_EXT_PLL_LOCS_MASK), MCG_C9_PLL_LOCRE(value)))
#define MCG_BWR_C9_PLL_LOCRE(base, value) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_PLL_LOCRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C9, field PLL_CME[5] (RW)
 *
 * Enables the loss of clock monitoring circuit for the MCG External PLL
 * (EXT_PLL) reference clock. The PLL_LOCRE bit will determine whether an interrupt or a
 * reset request is generated following a loss of EXT_PLL clock indication. The
 * PLL_CME bit should be set to a logic 1 when the MCG is in an operational mode
 * that uses the EXT_PLL as the CLKS source.
 *
 * Values:
 * - 0b0 - External clock monitor is disabled for EXT_PLL clock.
 * - 0b1 - External clock monitor is enabled for EXT_PLL clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_C9_PLL_CME field. */
#define MCG_RD_C9_PLL_CME(base) ((MCG_C9_REG(base) & MCG_C9_PLL_CME_MASK) >> MCG_C9_PLL_CME_SHIFT)
#define MCG_BRD_C9_PLL_CME(base) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_PLL_CME_SHIFT))

/*! @brief Set the PLL_CME field to a new value. */
#define MCG_WR_C9_PLL_CME(base, value) (MCG_RMW_C9(base, (MCG_C9_PLL_CME_MASK | MCG_C9_EXT_PLL_LOCS_MASK), MCG_C9_PLL_CME(value)))
#define MCG_BWR_C9_PLL_CME(base, value) (BITBAND_ACCESS8(&MCG_C9_REG(base), MCG_C9_PLL_CME_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_C11 - MCG Control 11 Register
 ******************************************************************************/

/*!
 * @brief MCG_C11 - MCG Control 11 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C11 register
 */
/*@{*/
#define MCG_RD_C11(base)         (MCG_C11_REG(base))
#define MCG_WR_C11(base, value)  (MCG_C11_REG(base) = (value))
#define MCG_RMW_C11(base, mask, value) (MCG_WR_C11(base, (MCG_RD_C11(base) & ~(mask)) | (value)))
#define MCG_SET_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) |  (value)))
#define MCG_CLR_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) & ~(value)))
#define MCG_TOG_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C11 bitfields
 */

/*!
 * @name Register MCG_C11, field PLLCS[4] (RW)
 *
 * Controls whether the PLL0 output or MCG External PLL input is selected as the
 * MCG source when CLKS are programmed in PLL Engaged External (PEE) mode
 * (CLKS[1:0]=00 and IREFS=0 and PLLS=1).
 *
 * Values:
 * - 0b0 - PLL0 output clock is selected.
 * - 0b1 - External PLL clock is selected.
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PLLCS field. */
#define MCG_RD_C11_PLLCS(base) ((MCG_C11_REG(base) & MCG_C11_PLLCS_MASK) >> MCG_C11_PLLCS_SHIFT)
#define MCG_BRD_C11_PLLCS(base) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCS_SHIFT))

/*! @brief Set the PLLCS field to a new value. */
#define MCG_WR_C11_PLLCS(base, value) (MCG_RMW_C11(base, MCG_C11_PLLCS_MASK, MCG_C11_PLLCS(value)))
#define MCG_BWR_C11_PLLCS(base, value) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCS_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_S2 - MCG Status 2 Register
 ******************************************************************************/

/*!
 * @brief MCG_S2 - MCG Status 2 Register (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_S2 register
 */
/*@{*/
#define MCG_RD_S2(base)          (MCG_S2_REG(base))
/*@}*/

