RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the ETDIS field to a new value. */
#define MCM_WR_ETBCC_ETDIS(base, value) (MCM_RMW_ETBCC(base, MCM_ETBCC_ETDIS_MASK, MCM_ETBCC_ETDIS(value)))
#define MCM_BWR_ETBCC_ETDIS(base, value) (MCM_WR_ETBCC_ETDIS(base, value))
/*@}*/

/*!
 * @name Register MCM_ETBCC, field ITDIS[5] (RW)
 *
 * Disables the trace path from ITM to TPIU.
 *
 * Values:
 * - 0b0 - ITM-to-TPIU trace path enabled
 * - 0b1 - ITM-to-TPIU trace path disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCC_ITDIS field. */
#define MCM_RD_ETBCC_ITDIS(base) ((MCM_ETBCC_REG(base) & MCM_ETBCC_ITDIS_MASK) >> MCM_ETBCC_ITDIS_SHIFT)
#define MCM_BRD_ETBCC_ITDIS(base) (MCM_RD_ETBCC_ITDIS(base))

/*! @brief Set the ITDIS field to a new value. */
#define MCM_WR_ETBCC_ITDIS(base, value) (MCM_RMW_ETBCC(base, MCM_ETBCC_ITDIS_MASK, MCM_ETBCC_ITDIS(value)))
#define MCM_BWR_ETBCC_ITDIS(base, value) (MCM_WR_ETBCC_ITDIS(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ETBRL - ETB Reload register
 ******************************************************************************/

/*!
 * @brief MCM_ETBRL - ETB Reload register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_ETBRL register
 */
/*@{*/
#define MCM_RD_ETBRL(base)       (MCM_ETBRL_REG(base))
#define MCM_WR_ETBRL(base, value) (MCM_ETBRL_REG(base) = (value))
#define MCM_RMW_ETBRL(base, mask, value) (MCM_WR_ETBRL(base, (MCM_RD_ETBRL(base) & ~(mask)) | (value)))
#define MCM_SET_ETBRL(base, value) (MCM_WR_ETBRL(base, MCM_RD_ETBRL(base) |  (value)))
#define MCM_CLR_ETBRL(base, value) (MCM_WR_ETBRL(base, MCM_RD_ETBRL(base) & ~(value)))
#define MCM_TOG_ETBRL(base, value) (MCM_WR_ETBRL(base, MCM_RD_ETBRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ETBRL bitfields
 */

/*!
 * @name Register MCM_ETBRL, field RELOAD[10:0] (RW)
 *
 * Indicates the 0-mod-4 value the counter reloads to. Writing a non-0-mod-4
 * value to this field results in a bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBRL_RELOAD field. */
#define MCM_RD_ETBRL_RELOAD(base) ((MCM_ETBRL_REG(base) & MCM_ETBRL_RELOAD_MASK) >> MCM_ETBRL_RELOAD_SHIFT)
#define MCM_BRD_ETBRL_RELOAD(base) (MCM_RD_ETBRL_RELOAD(base))

/*! @brief Set the RELOAD field to a new value. */
#define MCM_WR_ETBRL_RELOAD(base, value) (MCM_RMW_ETBRL(base, MCM_ETBRL_RELOAD_MASK, MCM_ETBRL_RELOAD(value)))
#define MCM_BWR_ETBRL_RELOAD(base, value) (MCM_WR_ETBRL_RELOAD(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ETBCNT - ETB Counter Value register
 ******************************************************************************/

/*!
 * @brief MCM_ETBCNT - ETB Counter Value register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_ETBCNT register
 */
/*@{*/
#define MCM_RD_ETBCNT(base)      (MCM_ETBCNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_ETBCNT bitfields
 */

/*!
 * @name Register MCM_ETBCNT, field COUNTER[10:0] (RO)
 *
 * Indicates the current 0-mod-4 value of the counter.
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCNT_COUNTER field. */
#define MCM_RD_ETBCNT_COUNTER(base) ((MCM_ETBCNT_REG(base) & MCM_ETBCNT_COUNTER_MASK) >> MCM_ETBCNT_COUNTER_SHIFT)
#define MCM_BRD_ETBCNT_COUNTER(base) (MCM_RD_ETBCNT_COUNTER(base))
/*@}*/

/*******************************************************************************
 * MCM_FADR - Fault address register
 ******************************************************************************/

/*!
 * @brief MCM_FADR - Fault address register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When a properly-enabled cache write buffer error interrupt event is detected,
 * the faulting address is captured in the MCM_FADR register. The MCM logic
 * supports capturing a single cache write buffer bus error event; if a subsequent
 * error is detected before the captured error information has been read from the
 * corresponding registers and the MCM_ISCR[CWBER] indicator cleared, the
 * MCM_FATR[BEOVR] flag is set. However, no additional information is captured. The bits
 * in this register are set by hardware and signaled by the assertion of
 * MCM_ISCR[CWBER]. Attempted writes have no effect.
 */
/*!
 * @name Constants and macros for entire MCM_FADR register
 */
/*@{*/
#define MCM_RD_FADR(base)        (MCM_FADR_REG(base))
/*@}*/

/*******************************************************************************
 * MCM_FATR - Fault attributes register
 ******************************************************************************/

/*!
 * @brief MCM_FATR - Fault attributes register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When a properly-enabled cache write buffer error interrupt event is detected,
 * the faulting attributes are captured in the MCM_FATR register. The bits in
 * this register are set by hardware and signaled by the assertion of
 * MCM_ISCR[CWBER]. Attempted writes have no effect.
 */
/*!
 * @name Constants and macros for entire MCM_FATR register
 */
/*@{*/
#define MCM_RD_FATR(base)        (MCM_FATR_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_FATR bitfields
 */

/*!
 * @name Register MCM_FATR, field BEDA[0] (RO)
 *
 * Indicates the type of cache write buffer access when the error was detected.
 * This attribute is always a logical one signaling a data reference.
 *
 * Values:
 * - 0b0 - Instruction
 * - 0b1 - Data
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEDA field. */
#define MCM_RD_FATR_BEDA(base) ((MCM_FATR_REG(base) & MCM_FATR_BEDA_MASK) >> MCM_FATR_BEDA_SHIFT)
#define MCM_BRD_FATR_BEDA(base) (MCM_RD_FATR_BEDA(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEMD[1] (RO)
 *
 * Indicates the privilege level of the cache write buffer access when the error
 * was detected.
 *
 * Values:
 * - 0b0 - User mode
 * - 0b1 - Supervisor/privileged mode
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEMD field. */
#define MCM_RD_FATR_BEMD(base) ((MCM_FATR_REG(base) & MCM_FATR_BEMD_MASK) >> MCM_FATR_BEMD_SHIFT)
#define MCM_BRD_FATR_BEMD(base) (MCM_RD_FATR_BEMD(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BESZ[5:4] (RO)
 *
 * Indicates the size of the cache write buffer access when the error was
 * detected.
 *
 * Values:
 * - 0b00 - 8-bit access
 * - 0b01 - 16-bit access
 * - 0b10 - 32-bit access
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BESZ field. */
#define MCM_RD_FATR_BESZ(base) ((MCM_FATR_REG(base) & MCM_FATR_BESZ_MASK) >> MCM_FATR_BESZ_SHIFT)
#define MCM_BRD_FATR_BESZ(base) (MCM_RD_FATR_BESZ(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEWT[7] (RO)
 *
 * Indicates the type of system bus access when the error was detected. Since
 * this logic is monitoring data transfers from the cache write buffer, this bit is
 * always a logical one, signaling a write operation.
 *
 * Values:
 * - 0b0 - Read access
 * - 0b1 - Write access
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEWT field. */
#define MCM_RD_FATR_BEWT(base) ((MCM_FATR_REG(base) & MCM_FATR_BEWT_MASK) >> MCM_FATR_BEWT_SHIFT)
#define MCM_BRD_FATR_BEWT(base) (MCM_RD_FATR_BEWT(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEMN[11:8] (RO)
 *
 * Crossbar switch bus master number of the captured cache write buffer bus
 * error. For this device, this value is always 0x1.
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEMN field. */
#define MCM_RD_FATR_BEMN(base) ((MCM_FATR_REG(base) & MCM_FATR_BEMN_MASK) >> MCM_FATR_BEMN_SHIFT)
#define MCM_BRD_FATR_BEMN(base) (MCM_RD_FATR_BEMN(base))
/*@}*/

/*!
 * @name Register MCM_FATR, field BEOVR[31] (RO)
 *
 * Indicates if another cache write buffer bus error is detected before system
 * software has retrieved all the error information from the original event, this
 * overrun flag is set. The window of time is defined from the detection of the
 * original cache write buffer error termination until the MCM_ISCR[CWBER] is
 * written with a 1 to clear it and rearm the capture logic. This bit is set by the
 * hardware and cleared whenever software writes a 1 to the CWBER bit.
 *
 * Values:
 * - 0b0 - No bus error overrun
 * - 0b1 - Bus error overrun occurred. The FADR and FDR registers and the other
 *     FATR bits are not updated to reflect this new bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_FATR_BEOVR field. */
#define MCM_RD_FATR_BEOVR(base) ((MCM_FATR_REG(base) & MCM_FATR_BEOVR_MASK) >> MCM_FATR_BEOVR_SHIFT)
#define MCM_BRD_FATR_BEOVR(base) (MCM_RD_FATR_BEOVR(base))
/*@}*/

