RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * SDHC_HOSTVER - Host Controller Version
 ******************************************************************************/

/*!
 * @brief SDHC_HOSTVER - Host Controller Version (RO)
 *
 * Reset value: 0x00001201U
 *
 * This register contains the vendor host controller version information. All
 * bits are read only and will read the same as the power-reset value.
 */
/*!
 * @name Constants and macros for entire SDHC_HOSTVER register
 */
/*@{*/
#define SDHC_RD_HOSTVER(base)    (SDHC_HOSTVER_REG(base))
/*@}*/

/*
 * Constants & macros for individual SDHC_HOSTVER bitfields
 */

/*!
 * @name Register SDHC_HOSTVER, field SVN[7:0] (RO)
 *
 * These status bits indicate the host controller specification version.
 *
 * Values:
 * - 0b00000001 - SD host specification version 2.0, supports test event
 *     register and ADMA.
 */
/*@{*/
/*! @brief Read current value of the SDHC_HOSTVER_SVN field. */
#define SDHC_RD_HOSTVER_SVN(base) ((SDHC_HOSTVER_REG(base) & SDHC_HOSTVER_SVN_MASK) >> SDHC_HOSTVER_SVN_SHIFT)
#define SDHC_BRD_HOSTVER_SVN(base) (SDHC_RD_HOSTVER_SVN(base))
/*@}*/

/*!
 * @name Register SDHC_HOSTVER, field VVN[15:8] (RO)
 *
 * These status bits are reserved for the vendor version number. The host driver
 * shall not use this status.
 *
 * Values:
 * - 0b00000000 - Freescale SDHC version 1.0
 * - 0b00010000 - Freescale SDHC version 2.0
 * - 0b00010001 - Freescale SDHC version 2.1
 * - 0b00010010 - Freescale SDHC version 2.2
 */
/*@{*/
/*! @brief Read current value of the SDHC_HOSTVER_VVN field. */
#define SDHC_RD_HOSTVER_VVN(base) ((SDHC_HOSTVER_REG(base) & SDHC_HOSTVER_VVN_MASK) >> SDHC_HOSTVER_VVN_SHIFT)
#define SDHC_BRD_HOSTVER_VVN(base) (SDHC_RD_HOSTVER_VVN(base))
/*@}*/

/*
 * MK66F18 SDRAM
 *
 * Synchronous DRAM Controller
 *
 * Registers defined in this header file:
 * - SDRAM_CTRL - Control Register
 * - SDRAM_AC - Address and Control Register
 * - SDRAM_CM - Control Mask
 */

#define SDRAM_INSTANCE_COUNT (1U) /*!< Number of instances of the SDRAM module. */
#define SDRAM_IDX (0U) /*!< Instance number for SDRAM. */

/*******************************************************************************
 * SDRAM_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief SDRAM_CTRL - Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * SDRAM_CTRL register controls refresh logic
 */
/*!
 * @name Constants and macros for entire SDRAM_CTRL register
 */
/*@{*/
#define SDRAM_RD_CTRL(base)      (SDRAM_CTRL_REG(base))
#define SDRAM_WR_CTRL(base, value) (SDRAM_CTRL_REG(base) = (value))
#define SDRAM_RMW_CTRL(base, mask, value) (SDRAM_WR_CTRL(base, (SDRAM_RD_CTRL(base) & ~(mask)) | (value)))
#define SDRAM_SET_CTRL(base, value) (SDRAM_WR_CTRL(base, SDRAM_RD_CTRL(base) |  (value)))
#define SDRAM_CLR_CTRL(base, value) (SDRAM_WR_CTRL(base, SDRAM_RD_CTRL(base) & ~(value)))
#define SDRAM_TOG_CTRL(base, value) (SDRAM_WR_CTRL(base, SDRAM_RD_CTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SDRAM_CTRL bitfields
 */

/*!
 * @name Register SDRAM_CTRL, field RC[8:0] (RW)
 *
 * Controls refresh frequency. The number of bus clocks between refresh cycles
 * is (RC + 1) x 16. Refresh can range from 16-8192 bus clocks to accommodate both
 * standard and low-power SDRAMs with bus clock operation from less than 2 MHz
 * to greater than 50 MHz. The following example calculates RC for an auto-refresh
 * period for 4096 rows to receive 64 ms of refresh every 15.625 us for each row
 * (1031 bus clocks at 66 MHz). # of bus clocks = 1031 = (RC field + 1) x 16; RC
 * = (1031 bus clocks/16) -1 = 63.44, which rounds to 63; therefore, RC = 0x3F.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CTRL_RC field. */
#define SDRAM_RD_CTRL_RC(base) ((SDRAM_CTRL_REG(base) & SDRAM_CTRL_RC_MASK) >> SDRAM_CTRL_RC_SHIFT)
#define SDRAM_BRD_CTRL_RC(base) (SDRAM_RD_CTRL_RC(base))

/*! @brief Set the RC field to a new value. */
#define SDRAM_WR_CTRL_RC(base, value) (SDRAM_RMW_CTRL(base, SDRAM_CTRL_RC_MASK, SDRAM_CTRL_RC(value)))
#define SDRAM_BWR_CTRL_RC(base, value) (SDRAM_WR_CTRL_RC(base, value))
/*@}*/

/*!
 * @name Register SDRAM_CTRL, field RTIM[10:9] (RW)
 *
 * Determines the timing operation of auto-refresh in the SDRAM controller.
 * Specifically, it determines the number of bus clocks inserted between a ref
 * command and the next possible actv command. This same timing is used for both memory
 * blocks controlled by the SDRAM controller. This corresponds to tRC in the
 * SDRAM specifications
 *
 * Values:
 * - 0b00 - 3 clocks
 * - 0b01 - 6 clocks
 * - 0b10 - 9 clocks
 * - 0b11 - 9 clocks
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CTRL_RTIM field. */
#define SDRAM_RD_CTRL_RTIM(base) ((SDRAM_CTRL_REG(base) & SDRAM_CTRL_RTIM_MASK) >> SDRAM_CTRL_RTIM_SHIFT)
#define SDRAM_BRD_CTRL_RTIM(base) (SDRAM_RD_CTRL_RTIM(base))

/*! @brief Set the RTIM field to a new value. */
#define SDRAM_WR_CTRL_RTIM(base, value) (SDRAM_RMW_CTRL(base, SDRAM_CTRL_RTIM_MASK, SDRAM_CTRL_RTIM(value)))
#define SDRAM_BWR_CTRL_RTIM(base, value) (SDRAM_WR_CTRL_RTIM(base, value))
/*@}*/

/*!
 * @name Register SDRAM_CTRL, field IS[11] (RW)
 *
 * Initiate self-refresh command.
 *
 * Values:
 * - 0b0 - Take no action or issue a selfx command to exit self refresh.
 * - 0b1 - SDRAM controller sends a self command to both SDRAM blocks to put
 *     them in low-power, self-refresh state where they remain until IS is cleared.
 *     When IS is cleared, the controller sends a selfx command for the SDRAMs to
 *     exit self-refresh. The refresh counter is suspended while the SDRAMs are
 *     in self-refresh; the SDRAM controls the refresh period.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_CTRL_IS field. */
#define SDRAM_RD_CTRL_IS(base) ((SDRAM_CTRL_REG(base) & SDRAM_CTRL_IS_MASK) >> SDRAM_CTRL_IS_SHIFT)
#define SDRAM_BRD_CTRL_IS(base) (BITBAND_ACCESS16(&SDRAM_CTRL_REG(base), SDRAM_CTRL_IS_SHIFT))

