RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the IS field to a new value. */
#define SDRAM_WR_CTRL_IS(base, value) (SDRAM_RMW_CTRL(base, SDRAM_CTRL_IS_MASK, SDRAM_CTRL_IS(value)))
#define SDRAM_BWR_CTRL_IS(base, value) (BITBAND_ACCESS16(&SDRAM_CTRL_REG(base), SDRAM_CTRL_IS_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SDRAM_AC - Address and Control Register
 ******************************************************************************/

/*!
 * @brief SDRAM_AC - Address and Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SDRAM_ACn registers, contain the base address compare value and the
 * control bits for memory blocks 0 and 1 of the SDRAM controller. Address and timing
 * are also controlled by bits in SDRAM_ACn.
 */
/*!
 * @name Constants and macros for entire SDRAM_AC register
 */
/*@{*/
#define SDRAM_RD_AC(base, index) (SDRAM_AC_REG(base, index))
#define SDRAM_WR_AC(base, index, value) (SDRAM_AC_REG(base, index) = (value))
#define SDRAM_RMW_AC(base, index, mask, value) (SDRAM_WR_AC(base, index, (SDRAM_RD_AC(base, index) & ~(mask)) | (value)))
#define SDRAM_SET_AC(base, index, value) (SDRAM_WR_AC(base, index, SDRAM_RD_AC(base, index) |  (value)))
#define SDRAM_CLR_AC(base, index, value) (SDRAM_WR_AC(base, index, SDRAM_RD_AC(base, index) & ~(value)))
#define SDRAM_TOG_AC(base, index, value) (SDRAM_WR_AC(base, index, SDRAM_RD_AC(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SDRAM_AC bitfields
 */

/*!
 * @name Register SDRAM_AC, field IP[3] (RW)
 *
 * The DRAM controller clears IP after the pall command is finished. Accesses
 * via IP should be no wider than the port size programmed in PS.
 *
 * Values:
 * - 0b0 - Take no action.
 * - 0b1 - A pall command is sent to the associated SDRAM block. During
 *     initialization, this command is executed after all DRAM controller registers are
 *     programmed. After IP is set, the next write to an appropriate SDRAM address
 *     generates the pall command to the SDRAM block.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_IP field. */
#define SDRAM_RD_AC_IP(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_IP_MASK) >> SDRAM_AC_IP_SHIFT)
#define SDRAM_BRD_AC_IP(base, index) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_IP_SHIFT))

/*! @brief Set the IP field to a new value. */
#define SDRAM_WR_AC_IP(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_IP_MASK, SDRAM_AC_IP(value)))
#define SDRAM_BWR_AC_IP(base, index, value) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_IP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field PS[5:4] (RW)
 *
 * Indicates the port size of the associated block of SDRAM, which allows for
 * dynamic sizing of associated SDRAM accesses. PS functions the same in
 * asynchronous operation.
 *
 * Values:
 * - 0b00 - 32-bit port
 * - 0b01 - 8-bit port
 * - 0b10 - 16-bit port
 * - 0b11 - 16-bit port
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_PS field. */
#define SDRAM_RD_AC_PS(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_PS_MASK) >> SDRAM_AC_PS_SHIFT)
#define SDRAM_BRD_AC_PS(base, index) (SDRAM_RD_AC_PS(base, index))

/*! @brief Set the PS field to a new value. */
#define SDRAM_WR_AC_PS(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_PS_MASK, SDRAM_AC_PS(value)))
#define SDRAM_BWR_AC_PS(base, index, value) (SDRAM_WR_AC_PS(base, index, value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field IMRS[6] (RW)
 *
 * Setting IMRS generates a mrs command to the associated SDRAMs. In
 * initialization, IMRS should be set only after all DRAM controller registers are
 * initialized and pall and refresh commands have been issued. After IMRS is set, the next
 * access to an SDRAM block programs the SDRAM's mode register. Thus, the
 * address of the access should be programmed to place the correct mode information on
 * the SDRAM address pins. Because the SDRAM does not register this information,
 * it doesn't matter if the IMRS access is a read or a write or what, if any,
 * data is put onto the data bus. The DRAM controller clears IMRS after the mrs
 * command finishes.
 *
 * Values:
 * - 0b0 - Take no action
 * - 0b1 - Initiate mrs command
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_IMRS field. */
#define SDRAM_RD_AC_IMRS(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_IMRS_MASK) >> SDRAM_AC_IMRS_SHIFT)
#define SDRAM_BRD_AC_IMRS(base, index) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_IMRS_SHIFT))

/*! @brief Set the IMRS field to a new value. */
#define SDRAM_WR_AC_IMRS(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_IMRS_MASK, SDRAM_AC_IMRS(value)))
#define SDRAM_BWR_AC_IMRS(base, index, value) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_IMRS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field CBM[10:8] (RW)
 *
 * Because different SDRAM configurations cause the command lines on the memory
 * to correspond to a different address, the location of command bit is
 * programmable. CB determines the address onto which the command bit are multiplexed. It
 * is important to set CB according to the location of the command bit. Command
 * Command Bit Notes 000 17 Not possible for 8-bit port 001 18 010 19 011 20 100
 * 21 101 22 110 23 111 24 Not supported This encoding and the address
 * multiplexing scheme handle common SDRAM organizations.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_CBM field. */
#define SDRAM_RD_AC_CBM(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_CBM_MASK) >> SDRAM_AC_CBM_SHIFT)
#define SDRAM_BRD_AC_CBM(base, index) (SDRAM_RD_AC_CBM(base, index))

/*! @brief Set the CBM field to a new value. */
#define SDRAM_WR_AC_CBM(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_CBM_MASK, SDRAM_AC_CBM(value)))
#define SDRAM_BWR_AC_CBM(base, index, value) (SDRAM_WR_AC_CBM(base, index, value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field CASL[13:12] (RW)
 *
 * Affects the following SDRAM timing specifications. Timing nomenclature varies
 * with manufacturers. Refer to the SDRAM specification for the appropriate
 * timing nomenclature: Parameter Number of Bus Clocks CASL=00 CASL=01 CASL=10
 * CASL=11 trcd-SRAS assertion to SCAS assertion 1 2 3 3 tcasl-SCAS assertion to data
 * out 1 2 3 3 tras-actv command to precharge command 2 4 6 6 trp-Precharge
 * command to actv command 1 2 3 3 trwl,trdl-Last data input to precharge command 1 1 1
 * 1 tep-Last data out to precharge command 1 1 1 1
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_CASL field. */
#define SDRAM_RD_AC_CASL(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_CASL_MASK) >> SDRAM_AC_CASL_SHIFT)
#define SDRAM_BRD_AC_CASL(base, index) (SDRAM_RD_AC_CASL(base, index))

/*! @brief Set the CASL field to a new value. */
#define SDRAM_WR_AC_CASL(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_CASL_MASK, SDRAM_AC_CASL(value)))
#define SDRAM_BWR_AC_CASL(base, index, value) (SDRAM_WR_AC_CASL(base, index, value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field RE[15] (RW)
 *
 * Determines when the DRAM controller generates a refresh cycle to the DRAM
 * block.
 *
 * Values:
 * - 0b0 - Do not refresh associated DRAM block
 * - 0b1 - Refresh associated DRAM block
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_RE field. */
#define SDRAM_RD_AC_RE(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_RE_MASK) >> SDRAM_AC_RE_SHIFT)
#define SDRAM_BRD_AC_RE(base, index) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_RE_SHIFT))

/*! @brief Set the RE field to a new value. */
#define SDRAM_WR_AC_RE(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_RE_MASK, SDRAM_AC_RE(value)))
#define SDRAM_BWR_AC_RE(base, index, value) (BITBAND_ACCESS32(&SDRAM_AC_REG(base, index), SDRAM_AC_RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDRAM_AC, field BA[31:18] (RW)
 *
 * With SDRAM_CM[BAM], determines the address range in which the associated DRAM
 * block is located. Each BA bit is compared with the corresponding address of
 * the current bus cycle. If all unmasked bits match, the address hits in the
 * associated DRAM block. BA functions the same as in asynchronous operation.
 */
/*@{*/
/*! @brief Read current value of the SDRAM_AC_BA field. */
#define SDRAM_RD_AC_BA(base, index) ((SDRAM_AC_REG(base, index) & SDRAM_AC_BA_MASK) >> SDRAM_AC_BA_SHIFT)
#define SDRAM_BRD_AC_BA(base, index) (SDRAM_RD_AC_BA(base, index))

/*! @brief Set the BA field to a new value. */
#define SDRAM_WR_AC_BA(base, index, value) (SDRAM_RMW_AC(base, index, SDRAM_AC_BA_MASK, SDRAM_AC_BA(value)))
#define SDRAM_BWR_AC_BA(base, index, value) (SDRAM_WR_AC_BA(base, index, value))
/*@}*/

