RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the UVSWE field to a new value. */
#define SIM_WR_SOPT1CFG_UVSWE(base, value) (SIM_RMW_SOPT1CFG(base, SIM_SOPT1CFG_UVSWE_MASK, SIM_SOPT1CFG_UVSWE(value)))
#define SIM_BWR_SOPT1CFG_UVSWE(base, value) (BITBAND_ACCESS32(&SIM_SOPT1CFG_REG(base), SIM_SOPT1CFG_UVSWE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT1CFG, field USSWE[26] (RW)
 *
 * Writing one to the USSWE bit allows the SOPT1 USBSSTBY bit to be written.
 * This register bit clears after a write to USBSSTBY.
 *
 * Values:
 * - 0b0 - SOPT1 USBSSTBY cannot be written.
 * - 0b1 - SOPT1 USBSSTBY can be written.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1CFG_USSWE field. */
#define SIM_RD_SOPT1CFG_USSWE(base) ((SIM_SOPT1CFG_REG(base) & SIM_SOPT1CFG_USSWE_MASK) >> SIM_SOPT1CFG_USSWE_SHIFT)
#define SIM_BRD_SOPT1CFG_USSWE(base) (BITBAND_ACCESS32(&SIM_SOPT1CFG_REG(base), SIM_SOPT1CFG_USSWE_SHIFT))

/*! @brief Set the USSWE field to a new value. */
#define SIM_WR_SOPT1CFG_USSWE(base, value) (SIM_RMW_SOPT1CFG(base, SIM_SOPT1CFG_USSWE_MASK, SIM_SOPT1CFG_USSWE(value)))
#define SIM_BWR_SOPT1CFG_USSWE(base, value) (BITBAND_ACCESS32(&SIM_SOPT1CFG_REG(base), SIM_SOPT1CFG_USSWE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_USBPHYCTL - USB PHY Control Register
 ******************************************************************************/

/*!
 * @brief SIM_USBPHYCTL - USB PHY Control Register (RW)
 *
 * Reset value: 0x00600000U
 *
 * This register is used to control some of the operating characteristics of the
 * USB Voltage Regulator. The USBPHYCTL register is only reset on POR/LVD.
 */
/*!
 * @name Constants and macros for entire SIM_USBPHYCTL register
 */
/*@{*/
#define SIM_RD_USBPHYCTL(base)   (SIM_USBPHYCTL_REG(base))
#define SIM_WR_USBPHYCTL(base, value) (SIM_USBPHYCTL_REG(base) = (value))
#define SIM_RMW_USBPHYCTL(base, mask, value) (SIM_WR_USBPHYCTL(base, (SIM_RD_USBPHYCTL(base) & ~(mask)) | (value)))
#define SIM_SET_USBPHYCTL(base, value) (SIM_WR_USBPHYCTL(base, SIM_RD_USBPHYCTL(base) |  (value)))
#define SIM_CLR_USBPHYCTL(base, value) (SIM_WR_USBPHYCTL(base, SIM_RD_USBPHYCTL(base) & ~(value)))
#define SIM_TOG_USBPHYCTL(base, value) (SIM_WR_USBPHYCTL(base, SIM_RD_USBPHYCTL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_USBPHYCTL bitfields
 */

/*!
 * @name Register SIM_USBPHYCTL, field USBVREGSEL[8] (RW)
 *
 * Selects the default input voltage source to the USB Regulator in case both
 * VREG_IN0 and VREG_IN1 are powered. If only one of the regulator inputs is
 * powered, it will automatically be selected by the regulator's power mux circuitry.
 *
 * Values:
 * - 0b0 - VREG_IN0 will be selected if both regulator inputs are powered
 * - 0b1 - VREG_IN1 will be selected if both regulator inputs are powered
 */
/*@{*/
/*! @brief Read current value of the SIM_USBPHYCTL_USBVREGSEL field. */
#define SIM_RD_USBPHYCTL_USBVREGSEL(base) ((SIM_USBPHYCTL_REG(base) & SIM_USBPHYCTL_USBVREGSEL_MASK) >> SIM_USBPHYCTL_USBVREGSEL_SHIFT)
#define SIM_BRD_USBPHYCTL_USBVREGSEL(base) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBVREGSEL_SHIFT))

/*! @brief Set the USBVREGSEL field to a new value. */
#define SIM_WR_USBPHYCTL_USBVREGSEL(base, value) (SIM_RMW_USBPHYCTL(base, SIM_USBPHYCTL_USBVREGSEL_MASK, SIM_USBPHYCTL_USBVREGSEL(value)))
#define SIM_BWR_USBPHYCTL_USBVREGSEL(base, value) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBVREGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_USBPHYCTL, field USBVREGPD[9] (RW)
 *
 * Enables the pulldown on the output of the USB Regulator.
 *
 * Values:
 * - 0b0 - Regulator output pulldown resistor is not enabled
 * - 0b1 - Regulator output pulldown resistor is enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_USBPHYCTL_USBVREGPD field. */
#define SIM_RD_USBPHYCTL_USBVREGPD(base) ((SIM_USBPHYCTL_REG(base) & SIM_USBPHYCTL_USBVREGPD_MASK) >> SIM_USBPHYCTL_USBVREGPD_SHIFT)
#define SIM_BRD_USBPHYCTL_USBVREGPD(base) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBVREGPD_SHIFT))

/*! @brief Set the USBVREGPD field to a new value. */
#define SIM_WR_USBPHYCTL_USBVREGPD(base, value) (SIM_RMW_USBPHYCTL(base, SIM_USBPHYCTL_USBVREGPD_MASK, SIM_USBPHYCTL_USBVREGPD(value)))
#define SIM_BWR_USBPHYCTL_USBVREGPD(base, value) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBVREGPD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_USBPHYCTL, field USB3VOUTTRG[22:20] (RW)
 *
 * These bits are used to set the USB 3V regulator output voltage and are set by
 * IFR values.
 *
 * Values:
 * - 0b000 - 2.733V
 * - 0b001 - 3.020V
 * - 0b010 - 3.074V
 * - 0b011 - 3.130V
 * - 0b100 - 3.188V
 * - 0b101 - 3.248V
 * - 0b110 - 3.310V (default)
 * - 0b111 - 3.662V (For Freescale use only, not for customer use)
 */
/*@{*/
/*! @brief Read current value of the SIM_USBPHYCTL_USB3VOUTTRG field. */
#define SIM_RD_USBPHYCTL_USB3VOUTTRG(base) ((SIM_USBPHYCTL_REG(base) & SIM_USBPHYCTL_USB3VOUTTRG_MASK) >> SIM_USBPHYCTL_USB3VOUTTRG_SHIFT)
#define SIM_BRD_USBPHYCTL_USB3VOUTTRG(base) (SIM_RD_USBPHYCTL_USB3VOUTTRG(base))

/*! @brief Set the USB3VOUTTRG field to a new value. */
#define SIM_WR_USBPHYCTL_USB3VOUTTRG(base, value) (SIM_RMW_USBPHYCTL(base, SIM_USBPHYCTL_USB3VOUTTRG_MASK, SIM_USBPHYCTL_USB3VOUTTRG(value)))
#define SIM_BWR_USBPHYCTL_USB3VOUTTRG(base, value) (SIM_WR_USBPHYCTL_USB3VOUTTRG(base, value))
/*@}*/

/*!
 * @name Register SIM_USBPHYCTL, field USBDISILIM[23] (RW)
 *
 * This bit is used to disable the inrush current limit for the USB Voltage
 * Regulator and the default state is determined at reset by IFR values.
 *
 * Values:
 * - 0b0 - The current limiter for the USB Voltage Regulator is enabled
 * - 0b1 - The current limiter for the USB Voltage Regulator is disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_USBPHYCTL_USBDISILIM field. */
#define SIM_RD_USBPHYCTL_USBDISILIM(base) ((SIM_USBPHYCTL_REG(base) & SIM_USBPHYCTL_USBDISILIM_MASK) >> SIM_USBPHYCTL_USBDISILIM_SHIFT)
#define SIM_BRD_USBPHYCTL_USBDISILIM(base) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBDISILIM_SHIFT))

/*! @brief Set the USBDISILIM field to a new value. */
#define SIM_WR_USBPHYCTL_USBDISILIM(base, value) (SIM_RMW_USBPHYCTL(base, SIM_USBPHYCTL_USBDISILIM_MASK, SIM_USBPHYCTL_USBDISILIM(value)))
#define SIM_BWR_USBPHYCTL_USBDISILIM(base, value) (BITBAND_ACCESS32(&SIM_USBPHYCTL_REG(base), SIM_USBPHYCTL_USBDISILIM_SHIFT) = (value))
/*@}*/

