RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the TPM1 field to a new value. */
#define SIM_WR_SCGC2_TPM1(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_TPM1_MASK, SIM_SCGC2_TPM1(value)))
#define SIM_BWR_SCGC2_TPM1(base, value) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_TPM1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field TPM2[10] (RW)
 *
 * This bit controls the clock gate to the TPM2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_TPM2 field. */
#define SIM_RD_SCGC2_TPM2(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_TPM2_MASK) >> SIM_SCGC2_TPM2_SHIFT)
#define SIM_BRD_SCGC2_TPM2(base) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_TPM2_SHIFT))

/*! @brief Set the TPM2 field to a new value. */
#define SIM_WR_SCGC2_TPM2(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_TPM2_MASK, SIM_SCGC2_TPM2(value)))
#define SIM_BWR_SCGC2_TPM2(base, value) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_TPM2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field DAC0[12] (RW)
 *
 * This bit controls the clock gate to the DAC0 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_DAC0 field. */
#define SIM_RD_SCGC2_DAC0(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_DAC0_MASK) >> SIM_SCGC2_DAC0_SHIFT)
#define SIM_BRD_SCGC2_DAC0(base) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_DAC0_SHIFT))

/*! @brief Set the DAC0 field to a new value. */
#define SIM_WR_SCGC2_DAC0(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_DAC0_MASK, SIM_SCGC2_DAC0(value)))
#define SIM_BWR_SCGC2_DAC0(base, value) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_DAC0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field DAC1[13] (RW)
 *
 * This bit controls the clock gate to the DAC1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_DAC1 field. */
#define SIM_RD_SCGC2_DAC1(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_DAC1_MASK) >> SIM_SCGC2_DAC1_SHIFT)
#define SIM_BRD_SCGC2_DAC1(base) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_DAC1_SHIFT))

/*! @brief Set the DAC1 field to a new value. */
#define SIM_WR_SCGC2_DAC1(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_DAC1_MASK, SIM_SCGC2_DAC1(value)))
#define SIM_BWR_SCGC2_DAC1(base, value) (BITBAND_ACCESS32(&SIM_SCGC2_REG(base), SIM_SCGC2_DAC1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SCGC3 - System Clock Gating Control Register 3
 ******************************************************************************/

/*!
 * @brief SIM_SCGC3 - System Clock Gating Control Register 3 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC3 register
 */
/*@{*/
#define SIM_RD_SCGC3(base)       (SIM_SCGC3_REG(base))
#define SIM_WR_SCGC3(base, value) (SIM_SCGC3_REG(base) = (value))
#define SIM_RMW_SCGC3(base, mask, value) (SIM_WR_SCGC3(base, (SIM_RD_SCGC3(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) |  (value)))
#define SIM_CLR_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) & ~(value)))
#define SIM_TOG_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC3 bitfields
 */

/*!
 * @name Register SIM_SCGC3, field RNGA[0] (RW)
 *
 * This bit controls the clock gate to the RNGA module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_RNGA field. */
#define SIM_RD_SCGC3_RNGA(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_RNGA_MASK) >> SIM_SCGC3_RNGA_SHIFT)
#define SIM_BRD_SCGC3_RNGA(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_RNGA_SHIFT))

/*! @brief Set the RNGA field to a new value. */
#define SIM_WR_SCGC3_RNGA(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_RNGA_MASK, SIM_SCGC3_RNGA(value)))
#define SIM_BWR_SCGC3_RNGA(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_RNGA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field USBHS[1] (RW)
 *
 * This bit controls the clock gate to the USBHS module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_USBHS field. */
#define SIM_RD_SCGC3_USBHS(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_USBHS_MASK) >> SIM_SCGC3_USBHS_SHIFT)
#define SIM_BRD_SCGC3_USBHS(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHS_SHIFT))

/*! @brief Set the USBHS field to a new value. */
#define SIM_WR_SCGC3_USBHS(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_USBHS_MASK, SIM_SCGC3_USBHS(value)))
#define SIM_BWR_SCGC3_USBHS(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field USBHSPHY[2] (RW)
 *
 * This bit controls the clock gate to the USBHS PHY module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_USBHSPHY field. */
#define SIM_RD_SCGC3_USBHSPHY(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_USBHSPHY_MASK) >> SIM_SCGC3_USBHSPHY_SHIFT)
#define SIM_BRD_SCGC3_USBHSPHY(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHSPHY_SHIFT))

/*! @brief Set the USBHSPHY field to a new value. */
#define SIM_WR_SCGC3_USBHSPHY(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_USBHSPHY_MASK, SIM_SCGC3_USBHSPHY(value)))
#define SIM_BWR_SCGC3_USBHSPHY(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHSPHY_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field USBHSDCD[3] (RW)
 *
 * This bit controls the clock gate to the USBHS DCD module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_USBHSDCD field. */
#define SIM_RD_SCGC3_USBHSDCD(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_USBHSDCD_MASK) >> SIM_SCGC3_USBHSDCD_SHIFT)
#define SIM_BRD_SCGC3_USBHSDCD(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHSDCD_SHIFT))

/*! @brief Set the USBHSDCD field to a new value. */
#define SIM_WR_SCGC3_USBHSDCD(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_USBHSDCD_MASK, SIM_SCGC3_USBHSDCD(value)))
#define SIM_BWR_SCGC3_USBHSDCD(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_USBHSDCD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field FLEXCAN1[4] (RW)
 *
 * This bit controls the clock gate to the FlexCAN1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_FLEXCAN1 field. */
#define SIM_RD_SCGC3_FLEXCAN1(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_FLEXCAN1_MASK) >> SIM_SCGC3_FLEXCAN1_SHIFT)
#define SIM_BRD_SCGC3_FLEXCAN1(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FLEXCAN1_SHIFT))

/*! @brief Set the FLEXCAN1 field to a new value. */
#define SIM_WR_SCGC3_FLEXCAN1(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_FLEXCAN1_MASK, SIM_SCGC3_FLEXCAN1(value)))
#define SIM_BWR_SCGC3_FLEXCAN1(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FLEXCAN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field SPI2[12] (RW)
 *
 * This bit controls the clock gate to the SPI2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_SPI2 field. */
#define SIM_RD_SCGC3_SPI2(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_SPI2_MASK) >> SIM_SCGC3_SPI2_SHIFT)
#define SIM_BRD_SCGC3_SPI2(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_SPI2_SHIFT))

