RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBDCD_SIGNAL_OVERRIDE - Signal Override Register
 ******************************************************************************/

/*!
 * @brief USBDCD_SIGNAL_OVERRIDE - Signal Override Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Signal Override register provides a way for the customer to enable
 * signaling required by the USB BC v1.2 specification after the battery charger
 * detection sequences have completed.
 */
/*!
 * @name Constants and macros for entire USBDCD_SIGNAL_OVERRIDE register
 */
/*@{*/
#define USBDCD_RD_SIGNAL_OVERRIDE(base) (USBDCD_SIGNAL_OVERRIDE_REG(base))
#define USBDCD_WR_SIGNAL_OVERRIDE(base, value) (USBDCD_SIGNAL_OVERRIDE_REG(base) = (value))
#define USBDCD_RMW_SIGNAL_OVERRIDE(base, mask, value) (USBDCD_WR_SIGNAL_OVERRIDE(base, (USBDCD_RD_SIGNAL_OVERRIDE(base) & ~(mask)) | (value)))
#define USBDCD_SET_SIGNAL_OVERRIDE(base, value) (USBDCD_WR_SIGNAL_OVERRIDE(base, USBDCD_RD_SIGNAL_OVERRIDE(base) |  (value)))
#define USBDCD_CLR_SIGNAL_OVERRIDE(base, value) (USBDCD_WR_SIGNAL_OVERRIDE(base, USBDCD_RD_SIGNAL_OVERRIDE(base) & ~(value)))
#define USBDCD_TOG_SIGNAL_OVERRIDE(base, value) (USBDCD_WR_SIGNAL_OVERRIDE(base, USBDCD_RD_SIGNAL_OVERRIDE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_SIGNAL_OVERRIDE bitfields
 */

/*!
 * @name Register USBDCD_SIGNAL_OVERRIDE, field PS[1:0] (RW)
 *
 * Used to enable specified voltage and current source circuits on the USB_DP
 * and USB_DM pins. Customers may set this bit field to 2'b10 for required
 * signaling if attached to a Dedicated Charging Port, or during operation under the Dead
 * Battery Provision.
 *
 * Values:
 * - 0b00 - No overrides. Bit field must remain at this value during normal USB
 *     data communication to prevent unexpected conditions on USB_DP and USB_DM
 *     pins. (Default)
 * - 0b01 - Reserved, not for customer use.
 * - 0b10 - Enables VDP_SRC voltage source for the USB_DP pin and IDM_SINK
 *     current source for the USB_DM pin.
 * - 0b11 - Reserved, not for customer use.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_SIGNAL_OVERRIDE_PS field. */
#define USBDCD_RD_SIGNAL_OVERRIDE_PS(base) ((USBDCD_SIGNAL_OVERRIDE_REG(base) & USBDCD_SIGNAL_OVERRIDE_PS_MASK) >> USBDCD_SIGNAL_OVERRIDE_PS_SHIFT)
#define USBDCD_BRD_SIGNAL_OVERRIDE_PS(base) (USBDCD_RD_SIGNAL_OVERRIDE_PS(base))

/*! @brief Set the PS field to a new value. */
#define USBDCD_WR_SIGNAL_OVERRIDE_PS(base, value) (USBDCD_RMW_SIGNAL_OVERRIDE(base, USBDCD_SIGNAL_OVERRIDE_PS_MASK, USBDCD_SIGNAL_OVERRIDE_PS(value)))
#define USBDCD_BWR_SIGNAL_OVERRIDE_PS(base, value) (USBDCD_WR_SIGNAL_OVERRIDE_PS(base, value))
/*@}*/

/*******************************************************************************
 * USBDCD_TIMER0 - TIMER0 register
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER0 - TIMER0 register (RW)
 *
 * Reset value: 0x00100000U
 *
 * TIMER0 has an TSEQ_INIT field that represents the system latency in ms.
 * Latency is measured from the time when VBUS goes active until the time system
 * software initiates charger detection sequence in USBDCD module. When software sets
 * the CONTROL[START] bit, the Unit Connection Timer (TUNITCON) is initialized
 * with the value of TSEQ_INIT. Valid values are 0-1023, however the USB Battery
 * Charging Specification requires the entire sequence, including TSEQ_INIT, to be
 * completed in 1s or less.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER0 register
 */
/*@{*/
#define USBDCD_RD_TIMER0(base)   (USBDCD_TIMER0_REG(base))
#define USBDCD_WR_TIMER0(base, value) (USBDCD_TIMER0_REG(base) = (value))
#define USBDCD_RMW_TIMER0(base, mask, value) (USBDCD_WR_TIMER0(base, (USBDCD_RD_TIMER0(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER0(base, value) (USBDCD_WR_TIMER0(base, USBDCD_RD_TIMER0(base) |  (value)))
#define USBDCD_CLR_TIMER0(base, value) (USBDCD_WR_TIMER0(base, USBDCD_RD_TIMER0(base) & ~(value)))
#define USBDCD_TOG_TIMER0(base, value) (USBDCD_WR_TIMER0(base, USBDCD_RD_TIMER0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER0 bitfields
 */

/*!
 * @name Register USBDCD_TIMER0, field TUNITCON[11:0] (RO)
 *
 * Displays the amount of elapsed time since the event of setting the START bit
 * plus the value of TSEQ_INIT. The timer is automatically initialized with the
 * value of TSEQ_INIT before starting to count. This timer enables compliance with
 * the maximum time allowed to connect T UNIT_CON under the USB Battery Charging
 * Specification. If the timer reaches the one second limit, the module triggers
 * an interrupt and sets the error flag STATUS[ERR]. The timer continues
 * counting throughout the charger detection sequence, even when control has been passed
 * to software. As long as the module is active, the timer continues to count
 * until it reaches the maximum value of 0xFFF (4095 ms). The timer does not
 * rollover to zero. A software reset clears the timer.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER0_TUNITCON field. */
#define USBDCD_RD_TIMER0_TUNITCON(base) ((USBDCD_TIMER0_REG(base) & USBDCD_TIMER0_TUNITCON_MASK) >> USBDCD_TIMER0_TUNITCON_SHIFT)
#define USBDCD_BRD_TIMER0_TUNITCON(base) (USBDCD_RD_TIMER0_TUNITCON(base))
/*@}*/

/*!
 * @name Register USBDCD_TIMER0, field TSEQ_INIT[25:16] (RW)
 *
 * TSEQ_INIT represents the system latency (in ms) measured from the time VBUS
 * goes active to the time system software initiates the charger detection
 * sequence in the USBDCD module. When software sets the CONTROL[START] bit, the Unit
 * Connection Timer (TUNITCON) is initialized with the value of TSEQ_INIT. Valid
 * values are 0-1023, but the USB Battery Charging Specification requires the
 * entire sequence, including TSEQ_INIT, to be completed in 1s or less.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER0_TSEQ_INIT field. */
#define USBDCD_RD_TIMER0_TSEQ_INIT(base) ((USBDCD_TIMER0_REG(base) & USBDCD_TIMER0_TSEQ_INIT_MASK) >> USBDCD_TIMER0_TSEQ_INIT_SHIFT)
#define USBDCD_BRD_TIMER0_TSEQ_INIT(base) (USBDCD_RD_TIMER0_TSEQ_INIT(base))

/*! @brief Set the TSEQ_INIT field to a new value. */
#define USBDCD_WR_TIMER0_TSEQ_INIT(base, value) (USBDCD_RMW_TIMER0(base, USBDCD_TIMER0_TSEQ_INIT_MASK, USBDCD_TIMER0_TSEQ_INIT(value)))
#define USBDCD_BWR_TIMER0_TSEQ_INIT(base, value) (USBDCD_WR_TIMER0_TSEQ_INIT(base, value))
/*@}*/

