RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*
 * Constants & macros for individual USBHS_USB_SBUSCFG bitfields
 */

/*!
 * @name Register USBHS_USB_SBUSCFG, field BURSTMODE[2:0] (RW)
 *
 * Selects the options for the burst signal of the Master Interface. In all
 * cases where the unspecified length burst is allowed, single accesses may also
 * occur; this is mostly true when the transaction is not 32-bit aligned. Two
 * consecutive single accesses should not happen. When an INCRx burst size is selected
 * and the transfer is not multiple of the INCRx burst, the burst is decomposed in
 * the different ways. With BURSTMODE[2] = 1, the smaller bursts is unspecified
 * length. with BURSTMODE[2] = 0, the smaller bursts are smaller INCRx or
 * singles. For example, if it were required at a given time to transfer 22 words of
 * information, for the following values of BURSTMODE the master sequences are: 101
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + INCR unspec. length. 110 INCR8 + INCR8
 * + INCR4 + INCR unspec. length. 111 INCR16 + INCR4 + INCR unspec. length. 001
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + SINGLE + SINGLE. 010 INCR8 + INCR8 +
 * INCR4 + SINGLE + SINGLE. 011 INCR16 + INCR4 + SINGLE + SINGLE. When this field
 * is different from zero, the values in the TXBURST/RXBURST bitfields in the
 * USB_BURSTSIZE register are ignored by the controller. Internally the BURSTMODE is
 * set to the value of the INCRx burst. Since this has a direct relation with
 * the burst sizes you must be careful with AHB burst selected. Although the
 * TXBURST/RXBURST are bypassed, this register can be written/read with no effect while
 * the BURSTMODE field is non-zero. Setting the BURSTMODE value to 000 might
 * cause bus allocation during BULK or ISO transfers. Changing this BURSTMODE field
 * while a transaction is in progress yields undefined results. One possible way
 * to prevent undefined results is to clear the Run/Stop (RS) bit in the
 * USB_USBCMD register, after the HCHALTED is detected in USB_USBSTS.
 *
 * Values:
 * - 0b000 - INCR burst of unspecified length
 * - 0b001 - INCR4, non-multiple transfers of INCR4 is decomposed into singles.
 * - 0b010 - INCR8, non-multiple transfers of INCR8, is decomposed into INCR4 or
 *     singles.
 * - 0b011 - INCR16, non-multiple transfers of INCR16, is decomposed into INCR8,
 *     INCR4 or singles.
 * - 0b100 - Reserved, do not use.
 * - 0b101 - INCR4, non-multiple transfers of INCR4 is decomposed into smaller
 *     unspecified length bursts.
 * - 0b110 - INCR8, non-multiple transfers of INCR8 is decomposed into smaller
 *     unspecified length bursts.
 * - 0b111 - INCR16, non-multiple transfers of INCR16 is decomposed into smaller
 *     unspecified length bursts.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USB_SBUSCFG_BURSTMODE field. */
#define USBHS_RD_USB_SBUSCFG_BURSTMODE(base) ((USBHS_USB_SBUSCFG_REG(base) & USBHS_USB_SBUSCFG_BURSTMODE_MASK) >> USBHS_USB_SBUSCFG_BURSTMODE_SHIFT)
#define USBHS_BRD_USB_SBUSCFG_BURSTMODE(base) (USBHS_RD_USB_SBUSCFG_BURSTMODE(base))

/*! @brief Set the BURSTMODE field to a new value. */
#define USBHS_WR_USB_SBUSCFG_BURSTMODE(base, value) (USBHS_RMW_USB_SBUSCFG(base, USBHS_USB_SBUSCFG_BURSTMODE_MASK, USBHS_USB_SBUSCFG_BURSTMODE(value)))
#define USBHS_BWR_USB_SBUSCFG_BURSTMODE(base, value) (USBHS_WR_USB_SBUSCFG_BURSTMODE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
 ******************************************************************************/

/*!
 * @brief USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register (RO)
 *
 * Reset value: 0x01000040U
 *
 * Contains the CAPLENGTH field used as an offset to add to the register base
 * address to find the beginning of the operational register space, the location of
 * the USBCMD register. Also contains a BCD encoding of the EHCI revision number
 * supported by this OTG controller. The most-significant byte of the HCIVERSION
 * field represents a major revision; the least-significant byte is the minor
 * revision.
 */
/*!
 * @name Constants and macros for entire USBHS_HCIVERSION register
 */
/*@{*/
#define USBHS_RD_HCIVERSION(base) (USBHS_HCIVERSION_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HCIVERSION bitfields
 */

/*!
 * @name Register USBHS_HCIVERSION, field CAPLENGTH[7:0] (RO)
 *
 * Always reads as 0x40.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCIVERSION_CAPLENGTH field. */
#define USBHS_RD_HCIVERSION_CAPLENGTH(base) ((USBHS_HCIVERSION_REG(base) & USBHS_HCIVERSION_CAPLENGTH_MASK) >> USBHS_HCIVERSION_CAPLENGTH_SHIFT)
#define USBHS_BRD_HCIVERSION_CAPLENGTH(base) (USBHS_RD_HCIVERSION_CAPLENGTH(base))
/*@}*/

/*!
 * @name Register USBHS_HCIVERSION, field HCIVERSION[31:16] (RO)
 *
 * Value is reads as 0x0100, indicating version 1.0.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCIVERSION_HCIVERSION field. */
#define USBHS_RD_HCIVERSION_HCIVERSION(base) ((USBHS_HCIVERSION_REG(base) & USBHS_HCIVERSION_HCIVERSION_MASK) >> USBHS_HCIVERSION_HCIVERSION_SHIFT)
#define USBHS_BRD_HCIVERSION_HCIVERSION(base) (USBHS_RD_HCIVERSION_HCIVERSION(base))
/*@}*/

/*******************************************************************************
 * USBHS_HCSPARAMS - Host Controller Structural Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HCSPARAMS - Host Controller Structural Parameters Register (RO)
 *
 * Reset value: 0x00010011U
 *
 * This register contains structural parameters such as the number of downstream
 * ports.
 */
/*!
 * @name Constants and macros for entire USBHS_HCSPARAMS register
 */
/*@{*/
#define USBHS_RD_HCSPARAMS(base) (USBHS_HCSPARAMS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HCSPARAMS bitfields
 */

/*!
 * @name Register USBHS_HCSPARAMS, field N_PORTS[3:0] (RO)
 *
 * Indicates number of physical downstream ports implemented for host
 * applications. Field value determines how many addressable port registers in the
 * operational register. Always reads as 0x1.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PORTS field. */
#define USBHS_RD_HCSPARAMS_N_PORTS(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PORTS_MASK) >> USBHS_HCSPARAMS_N_PORTS_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PORTS(base) (USBHS_RD_HCSPARAMS_N_PORTS(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field PPC[4] (RO)
 *
 * Indicates whether host controller supports port power control. Always reads
 * as 0b1.
 *
 * Values:
 * - 0b1 - Ports have power port switches
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_PPC field. */
#define USBHS_RD_HCSPARAMS_PPC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_PPC_MASK) >> USBHS_HCSPARAMS_PPC_SHIFT)
#define USBHS_BRD_HCSPARAMS_PPC(base) (BITBAND_ACCESS32(&USBHS_HCSPARAMS_REG(base), USBHS_HCSPARAMS_PPC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_PCC[11:8] (RO)
 *
 * Indicates number of ports supported per internal companion controller. This
 * field reads as 0x0 because no companion controllers are present.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PCC field. */
#define USBHS_RD_HCSPARAMS_N_PCC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PCC_MASK) >> USBHS_HCSPARAMS_N_PCC_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PCC(base) (USBHS_RD_HCSPARAMS_N_PCC(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_CC[15:12] (RO)
 *
 * Indicates number of companion controllers associated with USBHS controller.
 * Always cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_CC field. */
#define USBHS_RD_HCSPARAMS_N_CC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_CC_MASK) >> USBHS_HCSPARAMS_N_CC_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_CC(base) (USBHS_RD_HCSPARAMS_N_CC(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field PI[16] (RO)
 *
 * Indicates whether the ports support port indicator control. Always set.
 *
 * Values:
 * - 0b0 - No port indicator fields
 * - 0b1 - The port status and control registers include a R/W field for
 *     controlling the state of the port indicator
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_PI field. */
#define USBHS_RD_HCSPARAMS_PI(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_PI_MASK) >> USBHS_HCSPARAMS_PI_SHIFT)
#define USBHS_BRD_HCSPARAMS_PI(base) (BITBAND_ACCESS32(&USBHS_HCSPARAMS_REG(base), USBHS_HCSPARAMS_PI_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_PTT[23:20] (RO)
 *
 * Non-EHCI field. Indicates number of ports assigned to each transaction
 * translator within host controller.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PTT field. */
#define USBHS_RD_HCSPARAMS_N_PTT(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PTT_MASK) >> USBHS_HCSPARAMS_N_PTT_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PTT(base) (USBHS_RD_HCSPARAMS_N_PTT(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_TT[27:24] (RO)
 *
 * Non-EHCI field. Indicates number of embedded transaction translators
 * associated with host controller. This field always reads as 0x0. See section "Embedded
 * Transaction Translator Function," for more information on embedded
 * transaction translators.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_TT field. */
#define USBHS_RD_HCSPARAMS_N_TT(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_TT_MASK) >> USBHS_HCSPARAMS_N_TT_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_TT(base) (USBHS_RD_HCSPARAMS_N_TT(base))
/*@}*/

