RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the TI0 field to a new value. */
#define USBHS_WR_USBSTS_TI0(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_TI0(value)))
#define USBHS_BWR_USBSTS_TI0(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_TI0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field TI1[25] (W1C)
 *
 * Set when the counter in the GPTIMER1CTRL register transitions to zero.
 * Writing a one to this bit clears it.
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_TI1 field. */
#define USBHS_RD_USBSTS_TI1(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_TI1_MASK) >> USBHS_USBSTS_TI1_SHIFT)
#define USBHS_BRD_USBSTS_TI1(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_TI1_SHIFT))

/*! @brief Set the TI1 field to a new value. */
#define USBHS_WR_USBSTS_TI1(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_TI1_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK), USBHS_USBSTS_TI1(value)))
#define USBHS_BWR_USBSTS_TI1(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_TI1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_USBINTR - USB Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBINTR - USB Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The interrupts to software are enabled with this register. An interrupt
 * generates when a bit is set and the corresponding interrupt is active. The USB
 * status register (USBSTS) continues to show interrupt sources (even if the USBINTR
 * register disables them), allowing polling of interrupt events by the software.
 */
/*!
 * @name Constants and macros for entire USBHS_USBINTR register
 */
/*@{*/
#define USBHS_RD_USBINTR(base)   (USBHS_USBINTR_REG(base))
#define USBHS_WR_USBINTR(base, value) (USBHS_USBINTR_REG(base) = (value))
#define USBHS_RMW_USBINTR(base, mask, value) (USBHS_WR_USBINTR(base, (USBHS_RD_USBINTR(base) & ~(mask)) | (value)))
#define USBHS_SET_USBINTR(base, value) (USBHS_WR_USBINTR(base, USBHS_RD_USBINTR(base) |  (value)))
#define USBHS_CLR_USBINTR(base, value) (USBHS_WR_USBINTR(base, USBHS_RD_USBINTR(base) & ~(value)))
#define USBHS_TOG_USBINTR(base, value) (USBHS_WR_USBINTR(base, USBHS_RD_USBINTR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBINTR bitfields
 */

/*!
 * @name Register USBHS_USBINTR, field UE[0] (RW)
 *
 * When this bit is 1 and the USBSTS[UI] bit is set, the USBHS controller issues
 * an interrupt at the next interrupt threshold. Software clearing the
 * USBSTS[UI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_UE field. */
#define USBHS_RD_USBINTR_UE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_UE_MASK) >> USBHS_USBINTR_UE_SHIFT)
#define USBHS_BRD_USBINTR_UE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UE_SHIFT))

/*! @brief Set the UE field to a new value. */
#define USBHS_WR_USBINTR_UE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_UE_MASK, USBHS_USBINTR_UE(value)))
#define USBHS_BWR_USBINTR_UE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field UEE[1] (RW)
 *
 * When this bit and the USBSTS[UEI ] bit are set, controller issues an
 * interrupt at the next interrupt threshold. Software clearing the USBSTS[UEI ] bit
 * acknowledges the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_UEE field. */
#define USBHS_RD_USBINTR_UEE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_UEE_MASK) >> USBHS_USBINTR_UEE_SHIFT)
#define USBHS_BRD_USBINTR_UEE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UEE_SHIFT))

/*! @brief Set the UEE field to a new value. */
#define USBHS_WR_USBINTR_UEE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_UEE_MASK, USBHS_USBINTR_UEE(value)))
#define USBHS_BWR_USBINTR_UEE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_UEE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field PCE[2] (RW)
 *
 * When this bit and the USBSTS[PCI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[PCI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_PCE field. */
#define USBHS_RD_USBINTR_PCE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_PCE_MASK) >> USBHS_USBINTR_PCE_SHIFT)
#define USBHS_BRD_USBINTR_PCE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_PCE_SHIFT))

/*! @brief Set the PCE field to a new value. */
#define USBHS_WR_USBINTR_PCE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_PCE_MASK, USBHS_USBINTR_PCE(value)))
#define USBHS_BWR_USBINTR_PCE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_PCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field FRE[3] (RW)
 *
 * When this bit and the USBSTS[FRI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[FRI] bit acknowledges the interrupt. Used only
 * in host mode.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_FRE field. */
#define USBHS_RD_USBINTR_FRE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_FRE_MASK) >> USBHS_USBINTR_FRE_SHIFT)
#define USBHS_BRD_USBINTR_FRE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_FRE_SHIFT))

/*! @brief Set the FRE field to a new value. */
#define USBHS_WR_USBINTR_FRE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_FRE_MASK, USBHS_USBINTR_FRE(value)))
#define USBHS_BWR_USBINTR_FRE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_FRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field SEE[4] (RW)
 *
 * When this bit and the USBSTS[SEI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[SEI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_SEE field. */
#define USBHS_RD_USBINTR_SEE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_SEE_MASK) >> USBHS_USBINTR_SEE_SHIFT)
#define USBHS_BRD_USBINTR_SEE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SEE_SHIFT))

/*! @brief Set the SEE field to a new value. */
#define USBHS_WR_USBINTR_SEE(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_SEE_MASK, USBHS_USBINTR_SEE(value)))
#define USBHS_BWR_USBINTR_SEE(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_SEE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field AAE[5] (RW)
 *
 * When this bit and the USBSTS[AAI] bit are set, controller issues an interrupt
 * at the next interrupt threshold. Software clearing the USBSTS[AAI] bit
 * acknowledges the interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_AAE field. */
#define USBHS_RD_USBINTR_AAE(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_AAE_MASK) >> USBHS_USBINTR_AAE_SHIFT)
#define USBHS_BRD_USBINTR_AAE(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_AAE_SHIFT))

