RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the TIE0 field to a new value. */
#define USBHS_WR_USBINTR_TIE0(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_TIE0_MASK, USBHS_USBINTR_TIE0(value)))
#define USBHS_BWR_USBINTR_TIE0(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_TIE0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBINTR, field TIE1[25] (RW)
 *
 * When this bit and USBSTS[GPTINT1] are set, the USB controller issues an
 * interrupt to the processor. The interrupt is acknowledged by clearing GPTINT1.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBINTR_TIE1 field. */
#define USBHS_RD_USBINTR_TIE1(base) ((USBHS_USBINTR_REG(base) & USBHS_USBINTR_TIE1_MASK) >> USBHS_USBINTR_TIE1_SHIFT)
#define USBHS_BRD_USBINTR_TIE1(base) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_TIE1_SHIFT))

/*! @brief Set the TIE1 field to a new value. */
#define USBHS_WR_USBINTR_TIE1(base, value) (USBHS_RMW_USBINTR(base, USBHS_USBINTR_TIE1_MASK, USBHS_USBINTR_TIE1(value)))
#define USBHS_BWR_USBINTR_TIE1(base, value) (BITBAND_ACCESS32(&USBHS_USBINTR_REG(base), USBHS_USBINTR_TIE1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_FRINDEX - Frame Index Register
 ******************************************************************************/

/*!
 * @brief USBHS_FRINDEX - Frame Index Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * In host mode, the controller uses this register to index the periodic frame
 * list. The register updates every 125 microseconds (once each microframe). Bits
 * [N-3] select a particular entry in the periodic frame list during periodic
 * schedule execution. The number of bits used for the index depends on the size of
 * the frame list as set by system software in the USBCMD[FS] field. Only perform
 * 32-bit accesses to this register. Byte writes produce undefined results. This
 * register cannot be written unless the USBHS controller is in halted state as
 * the USBSTS[HCH] bit indicates. A write to this register while the USBSTS[RS]
 * bit is set produces undefined results. Writes to this register also affect the
 * SOF value. In device mode, this register is read-only, and the USBHS
 * controller updates the FRINDEX[13-3] bits from the frame number the SOF marker
 * indicates. When the USB bus receives a SOF, FRINDEX[13-3] checks against the SOF
 * marker. If FRINDEX[13-3] is different from the SOF marker, FRINDEX[13-3] is set to
 * the SOF value and FRINDEX[2-0] is cleared (SOF for 1 ms frame). If
 * FRINDEX[13-3] equals the SOF value, FRINDEX[2-0] is incremented (SOF for 125 microsec
 * microframe.)
 */
/*!
 * @name Constants and macros for entire USBHS_FRINDEX register
 */
/*@{*/
#define USBHS_RD_FRINDEX(base)   (USBHS_FRINDEX_REG(base))
#define USBHS_WR_FRINDEX(base, value) (USBHS_FRINDEX_REG(base) = (value))
#define USBHS_RMW_FRINDEX(base, mask, value) (USBHS_WR_FRINDEX(base, (USBHS_RD_FRINDEX(base) & ~(mask)) | (value)))
#define USBHS_SET_FRINDEX(base, value) (USBHS_WR_FRINDEX(base, USBHS_RD_FRINDEX(base) |  (value)))
#define USBHS_CLR_FRINDEX(base, value) (USBHS_WR_FRINDEX(base, USBHS_RD_FRINDEX(base) & ~(value)))
#define USBHS_TOG_FRINDEX(base, value) (USBHS_WR_FRINDEX(base, USBHS_RD_FRINDEX(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_FRINDEX bitfields
 */

/*!
 * @name Register USBHS_FRINDEX, field FRINDEX[13:0] (RW)
 *
 * The value in this register increments at the end of each time frame
 * (microframe). Bits [N- 3] are for the frame list current index. This means each
 * location of the frame list is accessed 8 times per frame (once each microframe)
 * before moving to the next index. In device mode, the value is the current frame
 * number of the last frame transmitted and not used as an index. In either mode,
 * bits 2-0 indicate current microframe. The table illustrates values of N based on
 * the value of the USBCMD[FS] field when used in host mode. FRINDEX N Values
 * USBCMD[FS] Frame List Size FRINDEX N value 000 1024 elements (4096 bytes) 12 001
 * 512 elements (2048 bytes) 11 010 256 elements (1024 bytes) 10 011 128
 * elements (512 bytes) 9 100 64 elements (256 bytes) 8 101 32 elements (128 bytes) 7
 * 110 16 elements (64 bytes) 6 111 8 elements (32 bytes) 5
 */
/*@{*/
/*! @brief Read current value of the USBHS_FRINDEX_FRINDEX field. */
#define USBHS_RD_FRINDEX_FRINDEX(base) ((USBHS_FRINDEX_REG(base) & USBHS_FRINDEX_FRINDEX_MASK) >> USBHS_FRINDEX_FRINDEX_SHIFT)
#define USBHS_BRD_FRINDEX_FRINDEX(base) (USBHS_RD_FRINDEX_FRINDEX(base))

/*! @brief Set the FRINDEX field to a new value. */
#define USBHS_WR_FRINDEX_FRINDEX(base, value) (USBHS_RMW_FRINDEX(base, USBHS_FRINDEX_FRINDEX_MASK, USBHS_FRINDEX_FRINDEX(value)))
#define USBHS_BWR_FRINDEX_FRINDEX(base, value) (USBHS_WR_FRINDEX_FRINDEX(base, value))
/*@}*/

/*!
 * @name Register USBHS_FRINDEX, field Reerved[31:14] (ROZ)
 *
 * Must be cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_FRINDEX_Reerved field. */
#define USBHS_RD_FRINDEX_Reerved(base) ((USBHS_FRINDEX_REG(base) & USBHS_FRINDEX_Reerved_MASK) >> USBHS_FRINDEX_Reerved_SHIFT)
#define USBHS_BRD_FRINDEX_Reerved(base) (USBHS_RD_FRINDEX_Reerved(base))
/*@}*/

/*******************************************************************************
 * USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
 ******************************************************************************/

/*!
 * @brief USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the beginning address of the periodic frame list in
 * the system memory. The host controller driver loads this register prior to
 * starting the schedule execution by the controller. The memory structure referenced
 * by this physical memory pointer assumes to be 4-Kbyte aligned. The contents
 * combine with the FRINDEX register to enable the controller to step through the
 * periodic frame list in sequence. The host and device mode functions share this
 * register. In host mode, it is the PERIODICLISTBASE register; in device mode,
 * it is the DEVICEADDR register. See section "Device Address Register
 * (DEVICEADDR)," for more information.
 */
/*!
 * @name Constants and macros for entire USBHS_PERIODICLISTBASE register
 */
/*@{*/
#define USBHS_RD_PERIODICLISTBASE(base) (USBHS_PERIODICLISTBASE_REG(base))
#define USBHS_WR_PERIODICLISTBASE(base, value) (USBHS_PERIODICLISTBASE_REG(base) = (value))
#define USBHS_RMW_PERIODICLISTBASE(base, mask, value) (USBHS_WR_PERIODICLISTBASE(base, (USBHS_RD_PERIODICLISTBASE(base) & ~(mask)) | (value)))
#define USBHS_SET_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) |  (value)))
#define USBHS_CLR_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) & ~(value)))
#define USBHS_TOG_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) ^  (value)))
/*@}*/

