RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the PO field to a new value. */
#define USBHS_WR_PORTSC1_PO(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PO_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PO(value)))
#define USBHS_BWR_PORTSC1_PO(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PO_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PIC[15:14] (RW)
 *
 * Not supported on this module.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PIC field. */
#define USBHS_RD_PORTSC1_PIC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PIC_MASK) >> USBHS_PORTSC1_PIC_SHIFT)
#define USBHS_BRD_PORTSC1_PIC(base) (USBHS_RD_PORTSC1_PIC(base))

/*! @brief Set the PIC field to a new value. */
#define USBHS_WR_PORTSC1_PIC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PIC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PIC(value)))
#define USBHS_BWR_PORTSC1_PIC(base, value) (USBHS_WR_PORTSC1_PIC(base, value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PTC[19:16] (RW)
 *
 * Any value other than 0 indicates the port operates in test mode. Refer to
 * Chapter 7 of the USB Specification Revision 2.0 for details on each test mode.
 * The FORCE_ENABLE_FS and FORCE ENABLE_LS settings are extensions to the test mode
 * support in the EHCI specification. Writing the PTC field to any of the
 * FORCE_ENABLE values forces the port into the connected and enabled state at the
 * selected speed. Then clearing the PTC field allows the port state machines to
 * progress normally from that point.
 *
 * Values:
 * - 0b0000 - Not enabled
 * - 0b0001 - J_STATE
 * - 0b0010 - K_STATE
 * - 0b0011 - SE0_NAK
 * - 0b0100 - Packet
 * - 0b0101 - FORCE_ENABLE_HS
 * - 0b0110 - FORCE_ENABLE_FS
 * - 0b0111 - FORCE_ENABLE_LS
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PTC field. */
#define USBHS_RD_PORTSC1_PTC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PTC_MASK) >> USBHS_PORTSC1_PTC_SHIFT)
#define USBHS_BRD_PORTSC1_PTC(base) (USBHS_RD_PORTSC1_PTC(base))

/*! @brief Set the PTC field to a new value. */
#define USBHS_WR_PORTSC1_PTC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PTC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PTC(value)))
#define USBHS_BWR_PORTSC1_PTC(base, value) (USBHS_WR_PORTSC1_PTC(base, value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field WKCN[20] (RW)
 *
 * Enables the port to be sensitive to device connects as wake-up events. This
 * field is 0 if the PP bit is cleared or the module is in device mode. In host
 * mode, this can work with an external power control circuit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_WKCN field. */
#define USBHS_RD_PORTSC1_WKCN(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_WKCN_MASK) >> USBHS_PORTSC1_WKCN_SHIFT)
#define USBHS_BRD_PORTSC1_WKCN(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKCN_SHIFT))

/*! @brief Set the WKCN field to a new value. */
#define USBHS_WR_PORTSC1_WKCN(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_WKCN_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_WKCN(value)))
#define USBHS_BWR_PORTSC1_WKCN(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKCN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field WKDS[21] (RW)
 *
 * Enables the port to be sensitive to device disconnects as wake-up events.
 * This field is 0 if the PP bit is cleared or the module is in device mode. In host
 * mode, this bit can work with an external power control circuit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_WKDS field. */
#define USBHS_RD_PORTSC1_WKDS(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_WKDS_MASK) >> USBHS_PORTSC1_WKDS_SHIFT)
#define USBHS_BRD_PORTSC1_WKDS(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKDS_SHIFT))

/*! @brief Set the WKDS field to a new value. */
#define USBHS_WR_PORTSC1_WKDS(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_WKDS_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_WKDS(value)))
#define USBHS_BWR_PORTSC1_WKDS(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKDS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field WKOC[22] (RW)
 *
 * Enables the port to be sensitive to over-current conditions as wake-up
 * events. This field is 0 if the PP bit is cleared. In host mode, this bit can work
 * with an external power control circuit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_WKOC field. */
#define USBHS_RD_PORTSC1_WKOC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_WKOC_MASK) >> USBHS_PORTSC1_WKOC_SHIFT)
#define USBHS_BRD_PORTSC1_WKOC(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKOC_SHIFT))

/*! @brief Set the WKOC field to a new value. */
#define USBHS_WR_PORTSC1_WKOC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_WKOC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_WKOC(value)))
#define USBHS_BWR_PORTSC1_WKOC(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_WKOC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PHCD[23] (RW)
 *
 * This bit is not defined in the EHCI specification. Host mode: The PHY can be
 * placed into low-power suspend when downstream device is put into suspend mode
 * or when no downstream device connects. Software completely controls low-power
 * suspend. Device mode: For the USBHS module in device mode, the PHY can be put
 * into low power suspend when the device is not running (USBCMD[RS] = 0) or
 * suspend signaling is detected on the USB. The PHCD bit is cleared automatically
 * when the resume signaling is detected or when forcing port resumes. Reading this
 * bit indicates the status of the PHY.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PHCD field. */
#define USBHS_RD_PORTSC1_PHCD(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PHCD_MASK) >> USBHS_PORTSC1_PHCD_SHIFT)
#define USBHS_BRD_PORTSC1_PHCD(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PHCD_SHIFT))

/*! @brief Set the PHCD field to a new value. */
#define USBHS_WR_PORTSC1_PHCD(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PHCD_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PHCD(value)))
#define USBHS_BWR_PORTSC1_PHCD(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PHCD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PFSC[24] (RW)
 *
 * Disables the chirp sequence that allows the port to identify itself as a HS
 * port. useful for testing FS configurations with a HS host, hub, or device. Not
 * defined in the EHCI specification. This bit is for debugging purposes.
 *
 * Values:
 * - 0b0 - Allow the port to identify itself as high speed
 * - 0b1 - Force the port to only connect at full speed
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PFSC field. */
#define USBHS_RD_PORTSC1_PFSC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PFSC_MASK) >> USBHS_PORTSC1_PFSC_SHIFT)
#define USBHS_BRD_PORTSC1_PFSC(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PFSC_SHIFT))

/*! @brief Set the PFSC field to a new value. */
#define USBHS_WR_PORTSC1_PFSC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PFSC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PFSC(value)))
#define USBHS_BWR_PORTSC1_PFSC(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PFSC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PTS2[25] (RO)
 *
 * See description at bits 31-30.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PTS2 field. */
#define USBHS_RD_PORTSC1_PTS2(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PTS2_MASK) >> USBHS_PORTSC1_PTS2_SHIFT)
#define USBHS_BRD_PORTSC1_PTS2(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PTS2_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PSPD[27:26] (RO)
 *
 * This read-only register field indicates the speed the port operates. This bit
 * is not defined in the EHCI specification.
 *
 * Values:
 * - 0b00 - Full speed
 * - 0b01 - Low speed
 * - 0b10 - High speed
 * - 0b11 - Undefined
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PSPD field. */
#define USBHS_RD_PORTSC1_PSPD(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PSPD_MASK) >> USBHS_PORTSC1_PSPD_SHIFT)
#define USBHS_BRD_PORTSC1_PSPD(base) (USBHS_RD_PORTSC1_PSPD(base))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PTS[31:30] (RO)
 *
 * Bit field comprised of {bit 25, bit31, bit30} Controls which parallel
 * transceiver interface is selected for controller configured by the manufacturer to
 * support multiple Phy interfaces. Otherwise this is a read-only field reflecting
 * the configuration when the controller is configured by the manufacturer to
 * support a single Phy interface type. This field is not defined in the EHCI
 * specification.
 *
 * Values:
 * - 0b00 - Use UTMI transceiver interface.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PTS field. */
#define USBHS_RD_PORTSC1_PTS(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PTS_MASK) >> USBHS_PORTSC1_PTS_SHIFT)
#define USBHS_BRD_PORTSC1_PTS(base) (USBHS_RD_PORTSC1_PTS(base))
/*@}*/

