RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBHS_EPSETUPSR - Endpoint Setup Status Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPSETUPSR - Endpoint Setup Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register
 * contains the endpoint setup status and is used only in device mode.
 */
/*!
 * @name Constants and macros for entire USBHS_EPSETUPSR register
 */
/*@{*/
#define USBHS_RD_EPSETUPSR(base) (USBHS_EPSETUPSR_REG(base))
#define USBHS_WR_EPSETUPSR(base, value) (USBHS_EPSETUPSR_REG(base) = (value))
#define USBHS_RMW_EPSETUPSR(base, mask, value) (USBHS_WR_EPSETUPSR(base, (USBHS_RD_EPSETUPSR(base) & ~(mask)) | (value)))
#define USBHS_SET_EPSETUPSR(base, value) (USBHS_WR_EPSETUPSR(base, USBHS_RD_EPSETUPSR(base) |  (value)))
#define USBHS_CLR_EPSETUPSR(base, value) (USBHS_WR_EPSETUPSR(base, USBHS_RD_EPSETUPSR(base) & ~(value)))
#define USBHS_TOG_EPSETUPSR(base, value) (USBHS_WR_EPSETUPSR(base, USBHS_RD_EPSETUPSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPSETUPSR bitfields
 */

/*!
 * @name Register USBHS_EPSETUPSR, field EPSETUPSTAT[3:0] (W1C)
 *
 * For every setup transaction received, a corresponding bit in this field is
 * set. This register is used only in device mode. Software must clear or
 * acknowledge the setup transfer by writing a 1 to a respective bit after it has read the
 * setup data from the queue head. The response to a setup packet, as in the
 * order of operations and total response time, is crucial to limit bus time outs
 * while the setup lockout mechanism engages.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPSETUPSR_EPSETUPSTAT field. */
#define USBHS_RD_EPSETUPSR_EPSETUPSTAT(base) ((USBHS_EPSETUPSR_REG(base) & USBHS_EPSETUPSR_EPSETUPSTAT_MASK) >> USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT)
#define USBHS_BRD_EPSETUPSR_EPSETUPSTAT(base) (USBHS_RD_EPSETUPSR_EPSETUPSTAT(base))

/*! @brief Set the EPSETUPSTAT field to a new value. */
#define USBHS_WR_EPSETUPSR_EPSETUPSTAT(base, value) (USBHS_RMW_EPSETUPSR(base, USBHS_EPSETUPSR_EPSETUPSTAT_MASK, USBHS_EPSETUPSR_EPSETUPSTAT(value)))
#define USBHS_BWR_EPSETUPSR_EPSETUPSTAT(base, value) (USBHS_WR_EPSETUPSR_EPSETUPSTAT(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_EPPRIME - Endpoint Initialization Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPPRIME - Endpoint Initialization Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is used
 * to initialize endpoints and is used only in device mode.
 */
/*!
 * @name Constants and macros for entire USBHS_EPPRIME register
 */
/*@{*/
#define USBHS_RD_EPPRIME(base)   (USBHS_EPPRIME_REG(base))
#define USBHS_WR_EPPRIME(base, value) (USBHS_EPPRIME_REG(base) = (value))
#define USBHS_RMW_EPPRIME(base, mask, value) (USBHS_WR_EPPRIME(base, (USBHS_RD_EPPRIME(base) & ~(mask)) | (value)))
#define USBHS_SET_EPPRIME(base, value) (USBHS_WR_EPPRIME(base, USBHS_RD_EPPRIME(base) |  (value)))
#define USBHS_CLR_EPPRIME(base, value) (USBHS_WR_EPPRIME(base, USBHS_RD_EPPRIME(base) & ~(value)))
#define USBHS_TOG_EPPRIME(base, value) (USBHS_WR_EPPRIME(base, USBHS_RD_EPPRIME(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPPRIME bitfields
 */

/*!
 * @name Register USBHS_EPPRIME, field PERB[3:0] (RW)
 *
 * For each endpoint, a corresponding bit requests that a buffer be prepared for
 * a receive operation to respond to a USB OUT transaction. Software must write
 * a 1 to the corresponding bit when posting a new transfer descriptor to an
 * endpoint. Hardware automatically uses this bit to begin parsing for a new transfer
 * descriptor from the queue head and prepare a receive buffer. Hardware clears
 * this bit when associated endpoint(s) is (are) successfully primed. These bits
 * are momentarily set by hardware during hardware re-priming operations when a
 * dTD retires, and the dQH updates.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPPRIME_PERB field. */
#define USBHS_RD_EPPRIME_PERB(base) ((USBHS_EPPRIME_REG(base) & USBHS_EPPRIME_PERB_MASK) >> USBHS_EPPRIME_PERB_SHIFT)
#define USBHS_BRD_EPPRIME_PERB(base) (USBHS_RD_EPPRIME_PERB(base))

/*! @brief Set the PERB field to a new value. */
#define USBHS_WR_EPPRIME_PERB(base, value) (USBHS_RMW_EPPRIME(base, USBHS_EPPRIME_PERB_MASK, USBHS_EPPRIME_PERB(value)))
#define USBHS_BWR_EPPRIME_PERB(base, value) (USBHS_WR_EPPRIME_PERB(base, value))
/*@}*/

/*!
 * @name Register USBHS_EPPRIME, field PETB[19:16] (RW)
 *
 * For each endpoint, a corresponding bit requests that a buffer be prepared for
 * a transmit operation to respond to a USB IN/INTERRUPT transaction. Software
 * must write a 1 to the corresponding bit when posting a new transfer descriptor
 * to an endpoint. Hardware automatically uses this bit to begin parsing for a
 * new transfer descriptor from the queue head and prepare a transmit buffer.
 * Hardware clears this bit when associated endpoint(s) is (are) successfully primed.
 * These bits are momentarily set by hardware during hardware re-priming
 * operations when a dTD retires, and the dQH updates.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPPRIME_PETB field. */
#define USBHS_RD_EPPRIME_PETB(base) ((USBHS_EPPRIME_REG(base) & USBHS_EPPRIME_PETB_MASK) >> USBHS_EPPRIME_PETB_SHIFT)
#define USBHS_BRD_EPPRIME_PETB(base) (USBHS_RD_EPPRIME_PETB(base))

/*! @brief Set the PETB field to a new value. */
#define USBHS_WR_EPPRIME_PETB(base, value) (USBHS_RMW_EPPRIME(base, USBHS_EPPRIME_PETB_MASK, USBHS_EPPRIME_PETB(value)))
#define USBHS_BWR_EPPRIME_PETB(base, value) (USBHS_WR_EPPRIME_PETB(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_EPFLUSH - Endpoint Flush Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPFLUSH - Endpoint Flush Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register used
 * only in device mode.
 */
/*!
 * @name Constants and macros for entire USBHS_EPFLUSH register
 */
/*@{*/
#define USBHS_RD_EPFLUSH(base)   (USBHS_EPFLUSH_REG(base))
#define USBHS_WR_EPFLUSH(base, value) (USBHS_EPFLUSH_REG(base) = (value))
#define USBHS_RMW_EPFLUSH(base, mask, value) (USBHS_WR_EPFLUSH(base, (USBHS_RD_EPFLUSH(base) & ~(mask)) | (value)))
#define USBHS_SET_EPFLUSH(base, value) (USBHS_WR_EPFLUSH(base, USBHS_RD_EPFLUSH(base) |  (value)))
#define USBHS_CLR_EPFLUSH(base, value) (USBHS_WR_EPFLUSH(base, USBHS_RD_EPFLUSH(base) & ~(value)))
#define USBHS_TOG_EPFLUSH(base, value) (USBHS_WR_EPFLUSH(base, USBHS_RD_EPFLUSH(base) ^  (value)))
/*@}*/

