RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the TXT field to a new value. */
#define USBHS_WR_EPCR_TXT(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXT_MASK, USBHS_EPCR_TXT(value)))
#define USBHS_BWR_EPCR_TXT(base, index, value) (USBHS_WR_EPCR_TXT(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXI[21] (RW)
 *
 * This bit is used only for test and should always be written as 0. Writing a 1
 * to this bit causes this endpoint to ignore the data toggle sequence and
 * always transmit DATA0 for a data packet.
 *
 * Values:
 * - 0b0 - PID sequencing enabled
 * - 0b1 - PID sequencing disabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXI field. */
#define USBHS_RD_EPCR_TXI(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXI_MASK) >> USBHS_EPCR_TXI_SHIFT)
#define USBHS_BRD_EPCR_TXI(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXI_SHIFT))

/*! @brief Set the TXI field to a new value. */
#define USBHS_WR_EPCR_TXI(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXI_MASK, USBHS_EPCR_TXI(value)))
#define USBHS_BWR_EPCR_TXI(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXR[22] (WO)
 *
 * When a configuration event is received for this Endpoint, software must write
 * a 1 to this bit to synchronize the data PID's between the host and device.
 * This bit is self-clearing.
 */
/*@{*/
/*! @brief Set the TXR field to a new value. */
#define USBHS_WR_EPCR_TXR(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXR_MASK, USBHS_EPCR_TXR(value)))
#define USBHS_BWR_EPCR_TXR(base, index, value) (USBHS_WR_EPCR_TXR(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXE[23] (RW)
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXE field. */
#define USBHS_RD_EPCR_TXE(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXE_MASK) >> USBHS_EPCR_TXE_SHIFT)
#define USBHS_BRD_EPCR_TXE(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXE_SHIFT))

/*! @brief Set the TXE field to a new value. */
#define USBHS_WR_EPCR_TXE(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXE_MASK, USBHS_EPCR_TXE(value)))
#define USBHS_BWR_EPCR_TXE(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_USBGENCTRL - USB General Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBGENCTRL - USB General Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification.
 */
/*!
 * @name Constants and macros for entire USBHS_USBGENCTRL register
 */
/*@{*/
#define USBHS_RD_USBGENCTRL(base) (USBHS_USBGENCTRL_REG(base))
#define USBHS_WR_USBGENCTRL(base, value) (USBHS_USBGENCTRL_REG(base) = (value))
#define USBHS_RMW_USBGENCTRL(base, mask, value) (USBHS_WR_USBGENCTRL(base, (USBHS_RD_USBGENCTRL(base) & ~(mask)) | (value)))
#define USBHS_SET_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) |  (value)))
#define USBHS_CLR_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) & ~(value)))
#define USBHS_TOG_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBGENCTRL bitfields
 */

/*!
 * @name Register USBHS_USBGENCTRL, field WU_IE[0] (RW)
 *
 * This bit is used to enable the low power wakeup interrupt.
 *
 * Values:
 * - 0b0 - Disabled
 * - 0b1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBGENCTRL_WU_IE field. */
#define USBHS_RD_USBGENCTRL_WU_IE(base) ((USBHS_USBGENCTRL_REG(base) & USBHS_USBGENCTRL_WU_IE_MASK) >> USBHS_USBGENCTRL_WU_IE_SHIFT)
#define USBHS_BRD_USBGENCTRL_WU_IE(base) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_IE_SHIFT))

/*! @brief Set the WU_IE field to a new value. */
#define USBHS_WR_USBGENCTRL_WU_IE(base, value) (USBHS_RMW_USBGENCTRL(base, USBHS_USBGENCTRL_WU_IE_MASK, USBHS_USBGENCTRL_WU_IE(value)))
#define USBHS_BWR_USBGENCTRL_WU_IE(base, value) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBGENCTRL, field WU_INT_CLR[5] (RW)
 *
 * Values:
 * - 0b0 - Default, no action.
 * - 0b1 - Clear the wake-up interrupt.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBGENCTRL_WU_INT_CLR field. */
#define USBHS_RD_USBGENCTRL_WU_INT_CLR(base) ((USBHS_USBGENCTRL_REG(base) & USBHS_USBGENCTRL_WU_INT_CLR_MASK) >> USBHS_USBGENCTRL_WU_INT_CLR_SHIFT)
#define USBHS_BRD_USBGENCTRL_WU_INT_CLR(base) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_INT_CLR_SHIFT))

/*! @brief Set the WU_INT_CLR field to a new value. */
#define USBHS_WR_USBGENCTRL_WU_INT_CLR(base, value) (USBHS_RMW_USBGENCTRL(base, USBHS_USBGENCTRL_WU_INT_CLR_MASK, USBHS_USBGENCTRL_WU_INT_CLR(value)))
#define USBHS_BWR_USBGENCTRL_WU_INT_CLR(base, value) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_INT_CLR_SHIFT) = (value))
/*@}*/

/*
 * MK66F18 USBHSDCD
 *
 * USB Device Charger Detection module
 *
 * Registers defined in this header file:
 * - USBHSDCD_CONTROL - Control register
 * - USBHSDCD_CLOCK - Clock register
 * - USBHSDCD_STATUS - Status register
 * - USBHSDCD_SIGNAL_OVERRIDE - Signal Override Register
 * - USBHSDCD_TIMER0 - TIMER0 register
 * - USBHSDCD_TIMER1 - TIMER1 register
 * - USBHSDCD_TIMER2_BC11 - TIMER2_BC11 register
 * - USBHSDCD_TIMER2_BC12 - TIMER2_BC12 register
 */

#define USBHSDCD_INSTANCE_COUNT (1U) /*!< Number of instances of the USBHSDCD module. */
#define USBHSDCD_IDX (0U) /*!< Instance number for USBHSDCD. */

/*******************************************************************************
 * USBHSDCD_CONTROL - Control register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_CONTROL - Control register (RW)
 *
 * Reset value: 0x00010000U
 *
 * Contains the control and interrupt bit fields.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_CONTROL register
 */
/*@{*/
#define USBHSDCD_RD_CONTROL(base) (USBHSDCD_CONTROL_REG(base))
#define USBHSDCD_WR_CONTROL(base, value) (USBHSDCD_CONTROL_REG(base) = (value))
#define USBHSDCD_RMW_CONTROL(base, mask, value) (USBHSDCD_WR_CONTROL(base, (USBHSDCD_RD_CONTROL(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_CONTROL(base, value) (USBHSDCD_WR_CONTROL(base, USBHSDCD_RD_CONTROL(base) |  (value)))
#define USBHSDCD_CLR_CONTROL(base, value) (USBHSDCD_WR_CONTROL(base, USBHSDCD_RD_CONTROL(base) & ~(value)))
#define USBHSDCD_TOG_CONTROL(base, value) (USBHSDCD_WR_CONTROL(base, USBHSDCD_RD_CONTROL(base) ^  (value)))
/*@}*/

