RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBHSDCD_TIMER2_BC11 - TIMER2_BC11 register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_TIMER2_BC11 - TIMER2_BC11 register (RW)
 *
 * Reset value: 0x00280001U
 *
 * TIMER2_BC11 contains timing parameters for USB Battery Charging
 * Specification, v1.1. Register values can be written that are not compliant with the USB
 * Battery Charging Specification, so care should be taken when overwriting the
 * default values.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_TIMER2_BC11 register
 */
/*@{*/
#define USBHSDCD_RD_TIMER2_BC11(base) (USBHSDCD_TIMER2_BC11_REG(base))
#define USBHSDCD_WR_TIMER2_BC11(base, value) (USBHSDCD_TIMER2_BC11_REG(base) = (value))
#define USBHSDCD_RMW_TIMER2_BC11(base, mask, value) (USBHSDCD_WR_TIMER2_BC11(base, (USBHSDCD_RD_TIMER2_BC11(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_TIMER2_BC11(base, value) (USBHSDCD_WR_TIMER2_BC11(base, USBHSDCD_RD_TIMER2_BC11(base) |  (value)))
#define USBHSDCD_CLR_TIMER2_BC11(base, value) (USBHSDCD_WR_TIMER2_BC11(base, USBHSDCD_RD_TIMER2_BC11(base) & ~(value)))
#define USBHSDCD_TOG_TIMER2_BC11(base, value) (USBHSDCD_WR_TIMER2_BC11(base, USBHSDCD_RD_TIMER2_BC11(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_TIMER2_BC11 bitfields
 */

/*!
 * @name Register USBHSDCD_TIMER2_BC11, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus until checking the state of the D- line to determine the
 * type of charging port. See "Charger Type Detection." Valid values are 1-15ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER2_BC11_CHECK_DM field. */
#define USBHSDCD_RD_TIMER2_BC11_CHECK_DM(base) ((USBHSDCD_TIMER2_BC11_REG(base) & USBHSDCD_TIMER2_BC11_CHECK_DM_MASK) >> USBHSDCD_TIMER2_BC11_CHECK_DM_SHIFT)
#define USBHSDCD_BRD_TIMER2_BC11_CHECK_DM(base) (USBHSDCD_RD_TIMER2_BC11_CHECK_DM(base))

/*! @brief Set the CHECK_DM field to a new value. */
#define USBHSDCD_WR_TIMER2_BC11_CHECK_DM(base, value) (USBHSDCD_RMW_TIMER2_BC11(base, USBHSDCD_TIMER2_BC11_CHECK_DM_MASK, USBHSDCD_TIMER2_BC11_CHECK_DM(value)))
#define USBHSDCD_BWR_TIMER2_BC11_CHECK_DM(base, value) (USBHSDCD_WR_TIMER2_BC11_CHECK_DM(base, value))
/*@}*/

/*!
 * @name Register USBHSDCD_TIMER2_BC11, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the time period (ms) that the module waits after charging port detection
 * before system software must enable the D+ pullup to connect to the USB host.
 * Valid values are 1-1023, but the USB Battery Charging Specification requires a
 * minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER2_BC11_TVDPSRC_CON field. */
#define USBHSDCD_RD_TIMER2_BC11_TVDPSRC_CON(base) ((USBHSDCD_TIMER2_BC11_REG(base) & USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK) >> USBHSDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT)
#define USBHSDCD_BRD_TIMER2_BC11_TVDPSRC_CON(base) (USBHSDCD_RD_TIMER2_BC11_TVDPSRC_CON(base))

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define USBHSDCD_WR_TIMER2_BC11_TVDPSRC_CON(base, value) (USBHSDCD_RMW_TIMER2_BC11(base, USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK, USBHSDCD_TIMER2_BC11_TVDPSRC_CON(value)))
#define USBHSDCD_BWR_TIMER2_BC11_TVDPSRC_CON(base, value) (USBHSDCD_WR_TIMER2_BC11_TVDPSRC_CON(base, value))
/*@}*/

/*******************************************************************************
 * USBHSDCD_TIMER2_BC12 - TIMER2_BC12 register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_TIMER2_BC12 - TIMER2_BC12 register (RW)
 *
 * Reset value: 0x00010028U
 *
 * TIMER2_BC12 contains timing parameters for USB Battery Charging
 * Specification, v1.2. Register values can be written that are not compliant with the USB
 * Battery Charging Specification, so care should be taken when overwriting the
 * default values.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_TIMER2_BC12 register
 */
/*@{*/
#define USBHSDCD_RD_TIMER2_BC12(base) (USBHSDCD_TIMER2_BC12_REG(base))
#define USBHSDCD_WR_TIMER2_BC12(base, value) (USBHSDCD_TIMER2_BC12_REG(base) = (value))
#define USBHSDCD_RMW_TIMER2_BC12(base, mask, value) (USBHSDCD_WR_TIMER2_BC12(base, (USBHSDCD_RD_TIMER2_BC12(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_TIMER2_BC12(base, value) (USBHSDCD_WR_TIMER2_BC12(base, USBHSDCD_RD_TIMER2_BC12(base) |  (value)))
#define USBHSDCD_CLR_TIMER2_BC12(base, value) (USBHSDCD_WR_TIMER2_BC12(base, USBHSDCD_RD_TIMER2_BC12(base) & ~(value)))
#define USBHSDCD_TOG_TIMER2_BC12(base, value) (USBHSDCD_WR_TIMER2_BC12(base, USBHSDCD_RD_TIMER2_BC12(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_TIMER2_BC12 bitfields
 */

/*!
 * @name Register USBHSDCD_TIMER2_BC12, field TVDMSRC_ON[9:0] (RW)
 *
 * Sets the amount of time (in ms) that the module enables the VDM_SRC. Valid
 * values are 0-40ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER2_BC12_TVDMSRC_ON field. */
#define USBHSDCD_RD_TIMER2_BC12_TVDMSRC_ON(base) ((USBHSDCD_TIMER2_BC12_REG(base) & USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK) >> USBHSDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT)
#define USBHSDCD_BRD_TIMER2_BC12_TVDMSRC_ON(base) (USBHSDCD_RD_TIMER2_BC12_TVDMSRC_ON(base))

/*! @brief Set the TVDMSRC_ON field to a new value. */
#define USBHSDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBHSDCD_RMW_TIMER2_BC12(base, USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK, USBHSDCD_TIMER2_BC12_TVDMSRC_ON(value)))
#define USBHSDCD_BWR_TIMER2_BC12_TVDMSRC_ON(base, value) (USBHSDCD_WR_TIMER2_BC12_TVDMSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBHSDCD_TIMER2_BC12, field TWAIT_AFTER_PRD[25:16] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after primary detection
 * before start to secondary detection. Valid values are 1-1023ms. Default is
 * 1ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD field. */
#define USBHSDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base) ((USBHSDCD_TIMER2_BC12_REG(base) & USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK) >> USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT)
#define USBHSDCD_BRD_TIMER2_BC12_TWAIT_AFTER_PRD(base) (USBHSDCD_RD_TIMER2_BC12_TWAIT_AFTER_PRD(base))

/*! @brief Set the TWAIT_AFTER_PRD field to a new value. */
#define USBHSDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBHSDCD_RMW_TIMER2_BC12(base, USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK, USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD(value)))
#define USBHSDCD_BWR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value) (USBHSDCD_WR_TIMER2_BC12_TWAIT_AFTER_PRD(base, value))
/*@}*/

