RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*! @brief Set the RXPWDDIFF field to a new value. */
#define USBPHY_WR_PWD_RXPWDDIFF(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_RXPWDDIFF_MASK, USBPHY_PWD_RXPWDDIFF(value)))
#define USBPHY_BWR_PWD_RXPWDDIFF(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDDIFF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field RXPWDRX[20] (RW)
 *
 * This bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Power-down the entire USB PHY receiver block except for the
 *     full-speed differential receiver
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_RXPWDRX field. */
#define USBPHY_RD_PWD_RXPWDRX(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_RXPWDRX_MASK) >> USBPHY_PWD_RXPWDRX_SHIFT)
#define USBPHY_BRD_PWD_RXPWDRX(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDRX_SHIFT))

/*! @brief Set the RXPWDRX field to a new value. */
#define USBPHY_WR_PWD_RXPWDRX(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_RXPWDRX_MASK, USBPHY_PWD_RXPWDRX(value)))
#define USBPHY_BWR_PWD_RXPWDRX(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDRX_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBPHY_TX - USB PHY Transmitter Control Register
 ******************************************************************************/

/*!
 * @brief USBPHY_TX - USB PHY Transmitter Control Register (RW)
 *
 * Reset value: 0x10060607U
 *
 * The USB PHY Transmitter Control Register handles the transmit controls.
 */
/*!
 * @name Constants and macros for entire USBPHY_TX register
 */
/*@{*/
#define USBPHY_RD_TX(base)       (USBPHY_TX_REG(base))
#define USBPHY_WR_TX(base, value) (USBPHY_TX_REG(base) = (value))
#define USBPHY_RMW_TX(base, mask, value) (USBPHY_WR_TX(base, (USBPHY_RD_TX(base) & ~(mask)) | (value)))
#define USBPHY_SET_TX(base, value) (USBPHY_TX_SET_REG(base) = (value))
#define USBPHY_CLR_TX(base, value) (USBPHY_TX_CLR_REG(base) = (value))
#define USBPHY_TOG_TX(base, value) (USBPHY_TX_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_TX bitfields
 */

/*!
 * @name Register USBPHY_TX, field D_CAL[3:0] (RW)
 *
 * Decode to trim the nominal 17.78mA current source for the High Speed TX
 * drivers on USB_DP and USB_DM. This current is directly proportional to the
 * amplitude of the High Speed TX eye diagram.
 *
 * Values:
 * - 0b0000 - Maximum current, approximately 19% above nominal.
 * - 0b0111 - Nominal
 * - 0b1111 - Minimum current, approximately 19% below nominal.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TX_D_CAL field. */
#define USBPHY_RD_TX_D_CAL(base) ((USBPHY_TX_REG(base) & USBPHY_TX_D_CAL_MASK) >> USBPHY_TX_D_CAL_SHIFT)
#define USBPHY_BRD_TX_D_CAL(base) (USBPHY_RD_TX_D_CAL(base))

/*! @brief Set the D_CAL field to a new value. */
#define USBPHY_WR_TX_D_CAL(base, value) (USBPHY_RMW_TX(base, USBPHY_TX_D_CAL_MASK, USBPHY_TX_D_CAL(value)))
#define USBPHY_BWR_TX_D_CAL(base, value) (USBPHY_WR_TX_D_CAL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_TX, field TXCAL45DM[11:8] (RW)
 *
 * Decode to trim the nominal 45ohm series termination resistance to the USB_DM
 * output pin. Maximum resistance = 0000. Resistance is centered by design at
 * 0110. Trimming this resistance will impact both the overshoot/undershoot of the
 * Full Speed TX output and the amplitude of the High Speed TX output.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TX_TXCAL45DM field. */
#define USBPHY_RD_TX_TXCAL45DM(base) ((USBPHY_TX_REG(base) & USBPHY_TX_TXCAL45DM_MASK) >> USBPHY_TX_TXCAL45DM_SHIFT)
#define USBPHY_BRD_TX_TXCAL45DM(base) (USBPHY_RD_TX_TXCAL45DM(base))

/*! @brief Set the TXCAL45DM field to a new value. */
#define USBPHY_WR_TX_TXCAL45DM(base, value) (USBPHY_RMW_TX(base, USBPHY_TX_TXCAL45DM_MASK, USBPHY_TX_TXCAL45DM(value)))
#define USBPHY_BWR_TX_TXCAL45DM(base, value) (USBPHY_WR_TX_TXCAL45DM(base, value))
/*@}*/

/*!
 * @name Register USBPHY_TX, field TXCAL45DP[19:16] (RW)
 *
 * Decode to trim the nominal 45ohm series termination resistance to the USB_DP
 * output pin. Maximum resistance = 0000. Resistance is centered by design at
 * 0110. Trimming this resistance will impact both the overshoot/undershoot of the
 * Full Speed TX output and the amplitude of the High Speed TX output.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TX_TXCAL45DP field. */
#define USBPHY_RD_TX_TXCAL45DP(base) ((USBPHY_TX_REG(base) & USBPHY_TX_TXCAL45DP_MASK) >> USBPHY_TX_TXCAL45DP_SHIFT)
#define USBPHY_BRD_TX_TXCAL45DP(base) (USBPHY_RD_TX_TXCAL45DP(base))

/*! @brief Set the TXCAL45DP field to a new value. */
#define USBPHY_WR_TX_TXCAL45DP(base, value) (USBPHY_RMW_TX(base, USBPHY_TX_TXCAL45DP_MASK, USBPHY_TX_TXCAL45DP(value)))
#define USBPHY_BWR_TX_TXCAL45DP(base, value) (USBPHY_WR_TX_TXCAL45DP(base, value))
/*@}*/

/*!
 * @name Register USBPHY_TX, field USBPHY_TX_EDGECTRL[28:26] (RW)
 *
 * Controls the edge-rate of the current sensing transistors used in HS
 * transmit. NOT FOR CUSTOMER USE.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TX_USBPHY_TX_EDGECTRL field. */
#define USBPHY_RD_TX_USBPHY_TX_EDGECTRL(base) ((USBPHY_TX_REG(base) & USBPHY_TX_USBPHY_TX_EDGECTRL_MASK) >> USBPHY_TX_USBPHY_TX_EDGECTRL_SHIFT)
#define USBPHY_BRD_TX_USBPHY_TX_EDGECTRL(base) (USBPHY_RD_TX_USBPHY_TX_EDGECTRL(base))

/*! @brief Set the USBPHY_TX_EDGECTRL field to a new value. */
#define USBPHY_WR_TX_USBPHY_TX_EDGECTRL(base, value) (USBPHY_RMW_TX(base, USBPHY_TX_USBPHY_TX_EDGECTRL_MASK, USBPHY_TX_USBPHY_TX_EDGECTRL(value)))
#define USBPHY_BWR_TX_USBPHY_TX_EDGECTRL(base, value) (USBPHY_WR_TX_USBPHY_TX_EDGECTRL(base, value))
/*@}*/

/*******************************************************************************
 * USBPHY_RX - USB PHY Receiver Control Register
 ******************************************************************************/

/*!
 * @brief USBPHY_RX - USB PHY Receiver Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The USB PHY Receiver Control Register handles receive path controls.
 */
/*!
 * @name Constants and macros for entire USBPHY_RX register
 */
/*@{*/
#define USBPHY_RD_RX(base)       (USBPHY_RX_REG(base))
#define USBPHY_WR_RX(base, value) (USBPHY_RX_REG(base) = (value))
#define USBPHY_RMW_RX(base, mask, value) (USBPHY_WR_RX(base, (USBPHY_RD_RX(base) & ~(mask)) | (value)))
#define USBPHY_SET_RX(base, value) (USBPHY_RX_SET_REG(base) = (value))
#define USBPHY_CLR_RX(base, value) (USBPHY_RX_CLR_REG(base) = (value))
#define USBPHY_TOG_RX(base, value) (USBPHY_RX_TOG_REG(base) = (value))
/*@}*/

