RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*
 * Constants & macros for individual USBPHY_RX bitfields
 */

/*!
 * @name Register USBPHY_RX, field ENVADJ[2:0] (RW)
 *
 * The ENVADJ field adjusts the trip point for the envelope detector. Values
 * shown below are nominal DC settings to indicate effect of changing these bits. AC
 * values measured during compliance testing will be somewhat higher.
 *
 * Values:
 * - 0b000 - Trip-Level Voltage is 0.1000 V
 * - 0b001 - Trip-Level Voltage is 0.1125 V
 * - 0b010 - Trip-Level Voltage is 0.1250 V
 * - 0b011 - Trip-Level Voltage is 0.0875 V
 */
/*@{*/
/*! @brief Read current value of the USBPHY_RX_ENVADJ field. */
#define USBPHY_RD_RX_ENVADJ(base) ((USBPHY_RX_REG(base) & USBPHY_RX_ENVADJ_MASK) >> USBPHY_RX_ENVADJ_SHIFT)
#define USBPHY_BRD_RX_ENVADJ(base) (USBPHY_RD_RX_ENVADJ(base))

/*! @brief Set the ENVADJ field to a new value. */
#define USBPHY_WR_RX_ENVADJ(base, value) (USBPHY_RMW_RX(base, USBPHY_RX_ENVADJ_MASK, USBPHY_RX_ENVADJ(value)))
#define USBPHY_BWR_RX_ENVADJ(base, value) (USBPHY_WR_RX_ENVADJ(base, value))
/*@}*/

/*!
 * @name Register USBPHY_RX, field DISCONADJ[6:4] (RW)
 *
 * The DISCONADJ field adjusts the trip point for the disconnect detector.
 *
 * Values:
 * - 0b000 - Trip-Level Voltage is 0.56875 V
 * - 0b001 - Trip-Level Voltage is 0.55000 V
 * - 0b010 - Trip-Level Voltage is 0.58125 V
 * - 0b011 - Trip-Level Voltage is 0.60000 V
 */
/*@{*/
/*! @brief Read current value of the USBPHY_RX_DISCONADJ field. */
#define USBPHY_RD_RX_DISCONADJ(base) ((USBPHY_RX_REG(base) & USBPHY_RX_DISCONADJ_MASK) >> USBPHY_RX_DISCONADJ_SHIFT)
#define USBPHY_BRD_RX_DISCONADJ(base) (USBPHY_RD_RX_DISCONADJ(base))

/*! @brief Set the DISCONADJ field to a new value. */
#define USBPHY_WR_RX_DISCONADJ(base, value) (USBPHY_RMW_RX(base, USBPHY_RX_DISCONADJ_MASK, USBPHY_RX_DISCONADJ(value)))
#define USBPHY_BWR_RX_DISCONADJ(base, value) (USBPHY_WR_RX_DISCONADJ(base, value))
/*@}*/

/*!
 * @name Register USBPHY_RX, field RXDBYPASS[22] (RW)
 *
 * This test mode is intended for lab use only, replace FS differential receiver
 * with DP single ended receiver.
 *
 * Values:
 * - 0b0 - Normal operation.
 * - 0b1 - Use the output of the USB_DP single-ended receiver in place of the
 *     full-speed differential receiver
 */
/*@{*/
/*! @brief Read current value of the USBPHY_RX_RXDBYPASS field. */
#define USBPHY_RD_RX_RXDBYPASS(base) ((USBPHY_RX_REG(base) & USBPHY_RX_RXDBYPASS_MASK) >> USBPHY_RX_RXDBYPASS_SHIFT)
#define USBPHY_BRD_RX_RXDBYPASS(base) (BITBAND_ACCESS32(&USBPHY_RX_REG(base), USBPHY_RX_RXDBYPASS_SHIFT))

/*! @brief Set the RXDBYPASS field to a new value. */
#define USBPHY_WR_RX_RXDBYPASS(base, value) (USBPHY_RMW_RX(base, USBPHY_RX_RXDBYPASS_MASK, USBPHY_RX_RXDBYPASS(value)))
#define USBPHY_BWR_RX_RXDBYPASS(base, value) (BITBAND_ACCESS32(&USBPHY_RX_REG(base), USBPHY_RX_RXDBYPASS_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBPHY_CTRL - USB PHY General Control Register
 ******************************************************************************/

/*!
 * @brief USBPHY_CTRL - USB PHY General Control Register (RW)
 *
 * Reset value: 0xC0000000U
 *
 * The USB PHY General Control Register handles OTG and Host controls. This
 * register also includes interrupt enables and connectivity detect enables and
 * results.
 */
/*!
 * @name Constants and macros for entire USBPHY_CTRL register
 */
/*@{*/
#define USBPHY_RD_CTRL(base)     (USBPHY_CTRL_REG(base))
#define USBPHY_WR_CTRL(base, value) (USBPHY_CTRL_REG(base) = (value))
#define USBPHY_RMW_CTRL(base, mask, value) (USBPHY_WR_CTRL(base, (USBPHY_RD_CTRL(base) & ~(mask)) | (value)))
#define USBPHY_SET_CTRL(base, value) (USBPHY_CTRL_SET_REG(base) = (value))
#define USBPHY_CLR_CTRL(base, value) (USBPHY_CTRL_CLR_REG(base) = (value))
#define USBPHY_TOG_CTRL(base, value) (USBPHY_CTRL_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_CTRL bitfields
 */

/*!
 * @name Register USBPHY_CTRL, field ENHOSTDISCONDETECT[1] (RW)
 *
 * For host mode, enables high-speed disconnect detector. This signal allows the
 * override of enabling the detection that is normally done in the UTMI
 * controller. The UTMI controller enables this circuit whenever the host sends a
 * start-of-frame packet. It shall be set after HS device is connected.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENHOSTDISCONDETECT field. */
#define USBPHY_RD_CTRL_ENHOSTDISCONDETECT(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENHOSTDISCONDETECT_MASK) >> USBPHY_CTRL_ENHOSTDISCONDETECT_SHIFT)
#define USBPHY_BRD_CTRL_ENHOSTDISCONDETECT(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENHOSTDISCONDETECT_SHIFT))

/*! @brief Set the ENHOSTDISCONDETECT field to a new value. */
#define USBPHY_WR_CTRL_ENHOSTDISCONDETECT(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENHOSTDISCONDETECT_MASK, USBPHY_CTRL_ENHOSTDISCONDETECT(value)))
#define USBPHY_BWR_CTRL_ENHOSTDISCONDETECT(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENHOSTDISCONDETECT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field HOSTDISCONDETECT_IRQ[3] (RW)
 *
 * Indicates that the device has disconnected in High-Speed mode. Reset this bit
 * by writing a 1 to the SCT clear address space and not by a general write.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_HOSTDISCONDETECT_IRQ field. */
#define USBPHY_RD_CTRL_HOSTDISCONDETECT_IRQ(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_HOSTDISCONDETECT_IRQ_MASK) >> USBPHY_CTRL_HOSTDISCONDETECT_IRQ_SHIFT)
#define USBPHY_BRD_CTRL_HOSTDISCONDETECT_IRQ(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_HOSTDISCONDETECT_IRQ_SHIFT))

/*! @brief Set the HOSTDISCONDETECT_IRQ field to a new value. */
#define USBPHY_WR_CTRL_HOSTDISCONDETECT_IRQ(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_HOSTDISCONDETECT_IRQ_MASK, USBPHY_CTRL_HOSTDISCONDETECT_IRQ(value)))
#define USBPHY_BWR_CTRL_HOSTDISCONDETECT_IRQ(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_HOSTDISCONDETECT_IRQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field ENDEVPLUGINDET[4] (RW)
 *
 * This bit field controls connection of nominal 200kohm resistors to both the
 * USB_DP and USB_DM pins as one method of detecting when a USB cable is attached
 * in device mode. This bit field must remain at a value of 1'b0 for normal USB
 * data communication, or when using the USBHSDCD module for battery charger
 * detection per the USB Battery Charger Specification Revision 1.2 or any other
 * detection mechanism for USB cable plugin. The results of this detection method are
 * reported in USBPHY_STATUS[6].
 *
 * Values:
 * - 0b0 - Disables 200kohm pullup resistors on USB_DP and USB_DM pins (Default)
 * - 0b1 - Enables 200kohm pullup resistors on USB_DP and USB_DM pins
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENDEVPLUGINDET field. */
#define USBPHY_RD_CTRL_ENDEVPLUGINDET(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENDEVPLUGINDET_MASK) >> USBPHY_CTRL_ENDEVPLUGINDET_SHIFT)
#define USBPHY_BRD_CTRL_ENDEVPLUGINDET(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENDEVPLUGINDET_SHIFT))

/*! @brief Set the ENDEVPLUGINDET field to a new value. */
#define USBPHY_WR_CTRL_ENDEVPLUGINDET(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENDEVPLUGINDET_MASK, USBPHY_CTRL_ENDEVPLUGINDET(value)))
#define USBPHY_BWR_CTRL_ENDEVPLUGINDET(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENDEVPLUGINDET_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field DEVPLUGIN_IRQ[12] (RW)
 *
 * Indicates that the device is connected. Reset this bit by writing a 1 to the
 * SCT clear address space and not by a general write.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_DEVPLUGIN_IRQ field. */
#define USBPHY_RD_CTRL_DEVPLUGIN_IRQ(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_DEVPLUGIN_IRQ_MASK) >> USBPHY_CTRL_DEVPLUGIN_IRQ_SHIFT)
#define USBPHY_BRD_CTRL_DEVPLUGIN_IRQ(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_DEVPLUGIN_IRQ_SHIFT))

/*! @brief Set the DEVPLUGIN_IRQ field to a new value. */
#define USBPHY_WR_CTRL_DEVPLUGIN_IRQ(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_DEVPLUGIN_IRQ_MASK, USBPHY_CTRL_DEVPLUGIN_IRQ(value)))
#define USBPHY_BWR_CTRL_DEVPLUGIN_IRQ(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_DEVPLUGIN_IRQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field ENUTMILEVEL2[14] (RW)
 *
 * Enables UTMI+ Level 2 operation for the USB HS PHY. This should be enabled if
 * an Embedded Host use case needs to support a LS device.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENUTMILEVEL2 field. */
#define USBPHY_RD_CTRL_ENUTMILEVEL2(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENUTMILEVEL2_MASK) >> USBPHY_CTRL_ENUTMILEVEL2_SHIFT)
#define USBPHY_BRD_CTRL_ENUTMILEVEL2(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENUTMILEVEL2_SHIFT))

/*! @brief Set the ENUTMILEVEL2 field to a new value. */
#define USBPHY_WR_CTRL_ENUTMILEVEL2(base, value) (USBPHY_RMW_CTRL(base, USBPHY_CTRL_ENUTMILEVEL2_MASK, USBPHY_CTRL_ENUTMILEVEL2(value)))
#define USBPHY_BWR_CTRL_ENUTMILEVEL2(base, value) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENUTMILEVEL2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_CTRL, field ENUTMILEVEL3[15] (RW)
 *
 * Enables UTMI+ Level 3 operation for the USB HS PHY. This should be enabled if
 * an Embedded Host use case needs to support an external FS Hub with a LS
 * device connected.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_CTRL_ENUTMILEVEL3 field. */
#define USBPHY_RD_CTRL_ENUTMILEVEL3(base) ((USBPHY_CTRL_REG(base) & USBPHY_CTRL_ENUTMILEVEL3_MASK) >> USBPHY_CTRL_ENUTMILEVEL3_SHIFT)
#define USBPHY_BRD_CTRL_ENUTMILEVEL3(base) (BITBAND_ACCESS32(&USBPHY_CTRL_REG(base), USBPHY_CTRL_ENUTMILEVEL3_SHIFT))

