RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBPHY_VERSION - UTMI RTL Version
 ******************************************************************************/

/*!
 * @brief USBPHY_VERSION - UTMI RTL Version (RO)
 *
 * Reset value: 0x04030000U
 *
 * Fields for RTL Version.
 */
/*!
 * @name Constants and macros for entire USBPHY_VERSION register
 */
/*@{*/
#define USBPHY_RD_VERSION(base)  (USBPHY_VERSION_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBPHY_VERSION bitfields
 */

/*!
 * @name Register USBPHY_VERSION, field STEP[15:0] (RO)
 *
 * Fixed read-only value reflecting the stepping of the RTL version.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_VERSION_STEP field. */
#define USBPHY_RD_VERSION_STEP(base) ((USBPHY_VERSION_REG(base) & USBPHY_VERSION_STEP_MASK) >> USBPHY_VERSION_STEP_SHIFT)
#define USBPHY_BRD_VERSION_STEP(base) (USBPHY_RD_VERSION_STEP(base))
/*@}*/

/*!
 * @name Register USBPHY_VERSION, field MINOR[23:16] (RO)
 *
 * Fixed read-only value reflecting the MINOR field of the RTL version.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_VERSION_MINOR field. */
#define USBPHY_RD_VERSION_MINOR(base) ((USBPHY_VERSION_REG(base) & USBPHY_VERSION_MINOR_MASK) >> USBPHY_VERSION_MINOR_SHIFT)
#define USBPHY_BRD_VERSION_MINOR(base) (USBPHY_RD_VERSION_MINOR(base))
/*@}*/

/*!
 * @name Register USBPHY_VERSION, field MAJOR[31:24] (RO)
 *
 * Fixed read-only value reflecting the MAJOR field of the RTL version.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_VERSION_MAJOR field. */
#define USBPHY_RD_VERSION_MAJOR(base) ((USBPHY_VERSION_REG(base) & USBPHY_VERSION_MAJOR_MASK) >> USBPHY_VERSION_MAJOR_SHIFT)
#define USBPHY_BRD_VERSION_MAJOR(base) (USBPHY_RD_VERSION_MAJOR(base))
/*@}*/

/*******************************************************************************
 * USBPHY_PLL_SIC - USB PHY PLL Control/Status Register
 ******************************************************************************/

/*!
 * @brief USBPHY_PLL_SIC - USB PHY PLL Control/Status Register (RW)
 *
 * Reset value: 0x00012000U
 *
 * This register configures the 480MHz USB PHY PLL.
 */
/*!
 * @name Constants and macros for entire USBPHY_PLL_SIC register
 */
/*@{*/
#define USBPHY_RD_PLL_SIC(base)  (USBPHY_PLL_SIC_REG(base))
#define USBPHY_WR_PLL_SIC(base, value) (USBPHY_PLL_SIC_REG(base) = (value))
#define USBPHY_RMW_PLL_SIC(base, mask, value) (USBPHY_WR_PLL_SIC(base, (USBPHY_RD_PLL_SIC(base) & ~(mask)) | (value)))
#define USBPHY_SET_PLL_SIC(base, value) (USBPHY_PLL_SIC_SET_REG(base) = (value))
#define USBPHY_CLR_PLL_SIC(base, value) (USBPHY_PLL_SIC_CLR_REG(base) = (value))
#define USBPHY_TOG_PLL_SIC(base, value) (USBPHY_PLL_SIC_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_PLL_SIC bitfields
 */

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_DIV_SEL[1:0] (RW)
 *
 * This field controls the USB PLL feedback loop divider. The USB PLL is
 * designed to produce a 480MHz output clock. This bit field allows use of different
 * frequency signals for the PLL reference clock input connected to the OSCCLK
 * signal from the system oscillator. When override is enabled through
 * USBPHY_TRIM_OVERRIDE_EN[0], the USB PLL will use this register value.
 *
 * Values:
 * - 0b00 - PLL reference frequency = 24MHz
 * - 0b01 - PLL reference frequency = 16MHz
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_DIV_SEL field. */
#define USBPHY_RD_PLL_SIC_PLL_DIV_SEL(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_DIV_SEL_MASK) >> USBPHY_PLL_SIC_PLL_DIV_SEL_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_DIV_SEL(base) (USBPHY_RD_PLL_SIC_PLL_DIV_SEL(base))

/*! @brief Set the PLL_DIV_SEL field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_DIV_SEL(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_DIV_SEL_MASK, USBPHY_PLL_SIC_PLL_DIV_SEL(value)))
#define USBPHY_BWR_PLL_SIC_PLL_DIV_SEL(base, value) (USBPHY_WR_PLL_SIC_PLL_DIV_SEL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_EN_USB_CLKS[6] (RW)
 *
 * Enable the USB clock output from the USB PHY PLL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_EN_USB_CLKS field. */
#define USBPHY_RD_PLL_SIC_PLL_EN_USB_CLKS(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK) >> USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_EN_USB_CLKS(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT))

/*! @brief Set the PLL_EN_USB_CLKS field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_EN_USB_CLKS(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK, USBPHY_PLL_SIC_PLL_EN_USB_CLKS(value)))
#define USBPHY_BWR_PLL_SIC_PLL_EN_USB_CLKS(base, value) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_HOLD_RING_OFF[11] (RW)
 *
 * Analog debug bit. Not for customer use. This bit field must remain at value
 * 1'b0 for normal operation.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_HOLD_RING_OFF field. */
#define USBPHY_RD_PLL_SIC_PLL_HOLD_RING_OFF(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_MASK) >> USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_HOLD_RING_OFF(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT))

/*! @brief Set the PLL_HOLD_RING_OFF field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_HOLD_RING_OFF(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_MASK, USBPHY_PLL_SIC_PLL_HOLD_RING_OFF(value)))
#define USBPHY_BWR_PLL_SIC_PLL_HOLD_RING_OFF(base, value) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_POWER[12] (RW)
 *
 * Power up the USB PLL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_POWER field. */
#define USBPHY_RD_PLL_SIC_PLL_POWER(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_POWER_MASK) >> USBPHY_PLL_SIC_PLL_POWER_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_POWER(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_POWER_SHIFT))

/*! @brief Set the PLL_POWER field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_POWER(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_POWER_MASK, USBPHY_PLL_SIC_PLL_POWER(value)))
#define USBPHY_BWR_PLL_SIC_PLL_POWER(base, value) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_POWER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_ENABLE[13] (RW)
 *
 * Enable the clock output from the USB PLL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_ENABLE field. */
#define USBPHY_RD_PLL_SIC_PLL_ENABLE(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_ENABLE_MASK) >> USBPHY_PLL_SIC_PLL_ENABLE_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_ENABLE(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_ENABLE_SHIFT))

/*! @brief Set the PLL_ENABLE field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_ENABLE(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_ENABLE_MASK, USBPHY_PLL_SIC_PLL_ENABLE(value)))
#define USBPHY_BWR_PLL_SIC_PLL_ENABLE(base, value) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_ENABLE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_BYPASS[16] (RW)
 *
 * Bypass the USB PLL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_BYPASS field. */
#define USBPHY_RD_PLL_SIC_PLL_BYPASS(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_BYPASS_MASK) >> USBPHY_PLL_SIC_PLL_BYPASS_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_BYPASS(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_BYPASS_SHIFT))

/*! @brief Set the PLL_BYPASS field to a new value. */
#define USBPHY_WR_PLL_SIC_PLL_BYPASS(base, value) (USBPHY_RMW_PLL_SIC(base, USBPHY_PLL_SIC_PLL_BYPASS_MASK, USBPHY_PLL_SIC_PLL_BYPASS(value)))
#define USBPHY_BWR_PLL_SIC_PLL_BYPASS(base, value) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_BYPASS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PLL_SIC, field PLL_LOCK[31] (RO)
 *
 * USB PLL lock status indicator
 *
 * Values:
 * - 0b0 - PLL is not currently locked
 * - 0b1 - PLL is currently locked
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PLL_SIC_PLL_LOCK field. */
#define USBPHY_RD_PLL_SIC_PLL_LOCK(base) ((USBPHY_PLL_SIC_REG(base) & USBPHY_PLL_SIC_PLL_LOCK_MASK) >> USBPHY_PLL_SIC_PLL_LOCK_SHIFT)
#define USBPHY_BRD_PLL_SIC_PLL_LOCK(base) (BITBAND_ACCESS32(&USBPHY_PLL_SIC_REG(base), USBPHY_PLL_SIC_PLL_LOCK_SHIFT))
/*@}*/

