RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBPHY_USB1_VBUS_DET_STAT - USB PHY VBUS Detector Status Register
 ******************************************************************************/

/*!
 * @brief USBPHY_USB1_VBUS_DET_STAT - USB PHY VBUS Detector Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register allows observation of status for USB VBUS detect functions. The
 * values reported in this register are synchronized by the apb_clk.
 */
/*!
 * @name Constants and macros for entire USBPHY_USB1_VBUS_DET_STAT register
 */
/*@{*/
#define USBPHY_RD_USB1_VBUS_DET_STAT(base) (USBPHY_USB1_VBUS_DET_STAT_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBPHY_USB1_VBUS_DET_STAT bitfields
 */

/*!
 * @name Register USBPHY_USB1_VBUS_DET_STAT, field SESSEND[0] (RO)
 *
 * Session End status, value inverted from Session Valid comparator. The default
 * value of this bit is determined by the voltage on the USB1_VBUS pin. This bit
 * can be overwritten by SW using the USBPHY_VBUS_DETECT[4, 3] bit fields.
 *
 * Values:
 * - 0b0 - The VBUS voltage is above the Session Valid threshold
 * - 0b1 - The VBUS voltage is below the Session Valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DET_STAT_SESSEND field. */
#define USBPHY_RD_USB1_VBUS_DET_STAT_SESSEND(base) ((USBPHY_USB1_VBUS_DET_STAT_REG(base) & USBPHY_USB1_VBUS_DET_STAT_SESSEND_MASK) >> USBPHY_USB1_VBUS_DET_STAT_SESSEND_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DET_STAT_SESSEND(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DET_STAT_REG(base), USBPHY_USB1_VBUS_DET_STAT_SESSEND_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DET_STAT, field BVALID[1] (RO)
 *
 * B-Device Session Valid status, determined by the Session Valid comparator.
 * The default value of this bit is determined by the voltage on the USB1_VBUS pin.
 * This bit can be overwritten by SW using the USBPHY_VBUS_DETECT[5, 3] bit
 * fields.
 *
 * Values:
 * - 0b0 - The VBUS voltage is below the Session Valid threshold
 * - 0b1 - The VBUS voltage is above the Session Valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DET_STAT_BVALID field. */
#define USBPHY_RD_USB1_VBUS_DET_STAT_BVALID(base) ((USBPHY_USB1_VBUS_DET_STAT_REG(base) & USBPHY_USB1_VBUS_DET_STAT_BVALID_MASK) >> USBPHY_USB1_VBUS_DET_STAT_BVALID_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DET_STAT_BVALID(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DET_STAT_REG(base), USBPHY_USB1_VBUS_DET_STAT_BVALID_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DET_STAT, field AVALID[2] (RO)
 *
 * A-Device Session Valid status, determined by the Session Valid comparator.
 * The default value of this bit is determined by the voltage on the USB1_VBUS pin.
 * This bit can be overwritten by SW using the USBPHY_VBUS_DETECT[6, 3] bit
 * fields.
 *
 * Values:
 * - 0b0 - The VBUS voltage is below the Session Valid threshold
 * - 0b1 - The VBUS voltage is above the Session Valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DET_STAT_AVALID field. */
#define USBPHY_RD_USB1_VBUS_DET_STAT_AVALID(base) ((USBPHY_USB1_VBUS_DET_STAT_REG(base) & USBPHY_USB1_VBUS_DET_STAT_AVALID_MASK) >> USBPHY_USB1_VBUS_DET_STAT_AVALID_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DET_STAT_AVALID(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DET_STAT_REG(base), USBPHY_USB1_VBUS_DET_STAT_AVALID_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DET_STAT, field VBUS_VALID[3] (RO)
 *
 * This bit field shows the result of VBUS_VALID detection for the USB1_VBUS
 * pin. The VBUS_VALID comparator used is selected by USBPHY_USB1_VBUS_DETECT[18].
 * The VBUS_VALID source is not affected by the values of
 * USBPHY_USB1_VBUS_DETECT[7, 3] and cannot be overwritten by SW.
 *
 * Values:
 * - 0b0 - VBUS is below the comparator threshold
 * - 0b1 - VBUS is above the comparator threshold
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID field. */
#define USBPHY_RD_USB1_VBUS_DET_STAT_VBUS_VALID(base) ((USBPHY_USB1_VBUS_DET_STAT_REG(base) & USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_MASK) >> USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DET_STAT_VBUS_VALID(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DET_STAT_REG(base), USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_VBUS_DET_STAT, field VBUS_VALID_3V[4] (RO)
 *
 * The VBUS_VALID_3V detector has a lower threshold for the voltage on the
 * USB1_VBUS pin than either the Session Valid or VBUS_VALID comparators. This signal
 * may be useful for applications using a non-standard VBUS voltage.
 *
 * Values:
 * - 0b0 - VBUS voltage is below VBUS_VALID_3V threshold
 * - 0b1 - VBUS voltage is above VBUS_VALID_3V threshold
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V field. */
#define USBPHY_RD_USB1_VBUS_DET_STAT_VBUS_VALID_3V(base) ((USBPHY_USB1_VBUS_DET_STAT_REG(base) & USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_MASK) >> USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_SHIFT)
#define USBPHY_BRD_USB1_VBUS_DET_STAT_VBUS_VALID_3V(base) (BITBAND_ACCESS32(&USBPHY_USB1_VBUS_DET_STAT_REG(base), USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_SHIFT))
/*@}*/

/*******************************************************************************
 * USBPHY_USB1_CHRG_DET_STAT - USB PHY Charger Detect Status Register
 ******************************************************************************/

/*!
 * @brief USBPHY_USB1_CHRG_DET_STAT - USB PHY Charger Detect Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The control of the USB Battery Charging detection functions has been moved to
 * the USBHSDCD instantiation of the USBDCD module for this product. For
 * standards-based charger detection purposes, the USBHSDCD registers should be used
 * rather than this register. However, the status values in this register may be
 * useful for debugging or in case other detection methods are used.
 */
/*!
 * @name Constants and macros for entire USBPHY_USB1_CHRG_DET_STAT register
 */
/*@{*/
#define USBPHY_RD_USB1_CHRG_DET_STAT(base) (USBPHY_USB1_CHRG_DET_STAT_REG(base))
/*@}*/

