RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBPHY_USB1_LOOPBACK - USB PHY Loopback Control/Status Register
 ******************************************************************************/

/*!
 * @brief USBPHY_USB1_LOOPBACK - USB PHY Loopback Control/Status Register (RW)
 *
 * Reset value: 0x00550000U
 *
 * This register controls loopback testing of the USB PHY. Loopback mode is for
 * test purposes only; it cannot be used during normal USB data communication.
 */
/*!
 * @name Constants and macros for entire USBPHY_USB1_LOOPBACK register
 */
/*@{*/
#define USBPHY_RD_USB1_LOOPBACK(base) (USBPHY_USB1_LOOPBACK_REG(base))
#define USBPHY_WR_USB1_LOOPBACK(base, value) (USBPHY_USB1_LOOPBACK_REG(base) = (value))
#define USBPHY_RMW_USB1_LOOPBACK(base, mask, value) (USBPHY_WR_USB1_LOOPBACK(base, (USBPHY_RD_USB1_LOOPBACK(base) & ~(mask)) | (value)))
#define USBPHY_SET_USB1_LOOPBACK(base, value) (USBPHY_USB1_LOOPBACK_SET_REG(base) = (value))
#define USBPHY_CLR_USB1_LOOPBACK(base, value) (USBPHY_USB1_LOOPBACK_CLR_REG(base) = (value))
#define USBPHY_TOG_USB1_LOOPBACK(base, value) (USBPHY_USB1_LOOPBACK_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_USB1_LOOPBACK bitfields
 */

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field UTMI_TESTSTART[0] (RW)
 *
 * This bit enables the USB loopback test.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_UTMI_TESTSTART field. */
#define USBPHY_RD_USB1_LOOPBACK_UTMI_TESTSTART(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_MASK) >> USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_UTMI_TESTSTART(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT))

/*! @brief Set the UTMI_TESTSTART field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_UTMI_TESTSTART(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_MASK, USBPHY_USB1_LOOPBACK_UTMI_TESTSTART(value)))
#define USBPHY_BWR_USB1_LOOPBACK_UTMI_TESTSTART(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field UTMI_DIG_TST0[1] (RW)
 *
 * Mode control for USB loopback test. Setting this bit to a value of 1'b1 while
 * UTMI_DIG_TST1 remains at a value of 1'b0 selects Pulse mode for the loopback
 * test.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0 field. */
#define USBPHY_RD_USB1_LOOPBACK_UTMI_DIG_TST0(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_MASK) >> USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_UTMI_DIG_TST0(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT))

/*! @brief Set the UTMI_DIG_TST0 field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_UTMI_DIG_TST0(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_MASK, USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0(value)))
#define USBPHY_BWR_USB1_LOOPBACK_UTMI_DIG_TST0(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field UTMI_DIG_TST1[2] (RW)
 *
 * Mode control for USB loopback test. Setting this bit to a value of 1'b1 while
 * UTMI_DIG_TST0 remains at a value of 1'b0 selects Psuedorandom modes for the
 * loopback test.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1 field. */
#define USBPHY_RD_USB1_LOOPBACK_UTMI_DIG_TST1(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_MASK) >> USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_UTMI_DIG_TST1(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT))

/*! @brief Set the UTMI_DIG_TST1 field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_UTMI_DIG_TST1(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_MASK, USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1(value)))
#define USBPHY_BWR_USB1_LOOPBACK_UTMI_DIG_TST1(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTI_TX_HS_MODE[3] (RW)
 *
 * Select HS or FS mode for USB loopback testing. Set to value 1'b1 to choose HS
 * for USB loopback testing, set to value 1'b0 to choose FS mode.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTI_TX_HS_MODE(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_MASK) >> USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTI_TX_HS_MODE(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT))

/*! @brief Set the TSTI_TX_HS_MODE field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTI_TX_HS_MODE(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_MASK, USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTI_TX_HS_MODE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTI_TX_LS_MODE[4] (RW)
 *
 * Set to value 1'b1 to choose LS for USB loopback testing, set to value 1'b0 to
 * choose HS or FS mode which is defined by TSTI1_TX_HS.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTI_TX_LS_MODE(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_MASK) >> USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTI_TX_LS_MODE(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT))

/*! @brief Set the TSTI_TX_LS_MODE field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTI_TX_LS_MODE(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_MASK, USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTI_TX_LS_MODE(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTI_TX_EN[5] (RW)
 *
 * Enable TX for USB loopback test.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTI_TX_EN field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTI_TX_EN(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTI_TX_EN_MASK) >> USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTI_TX_EN(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT))

/*! @brief Set the TSTI_TX_EN field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTI_TX_EN(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTI_TX_EN_MASK, USBPHY_USB1_LOOPBACK_TSTI_TX_EN(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTI_TX_EN(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTI_TX_HIZ[6] (RW)
 *
 * Sets TX Hi-Z for USB loopback test.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTI_TX_HIZ(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_MASK) >> USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTI_TX_HIZ(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT))

/*! @brief Set the TSTI_TX_HIZ field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTI_TX_HIZ(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_MASK, USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTI_TX_HIZ(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field UTMO_DIG_TST0[7] (RO)
 *
 * This read-only bit is a status bit for USB loopback test results. Value =
 * 1'b0 indicates a passing result. Test results are only valid while UTMI_TESTSTART
 * is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0 field. */
#define USBPHY_RD_USB1_LOOPBACK_UTMO_DIG_TST0(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_MASK) >> USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_UTMO_DIG_TST0(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field UTMO_DIG_TST1[8] (RO)
 *
 * This read-only bit is a status bit for USB loopback test. Value = 1'b1
 * indicates a passing result. Test results are only valid while UTMI_TESTSTART is set
 * to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1 field. */
#define USBPHY_RD_USB1_LOOPBACK_UTMO_DIG_TST1(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_MASK) >> USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_UTMO_DIG_TST1(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTI_HSFS_MODE_EN[15] (RW)
 *
 * Setting this bit field to value 1'b1 will enable the loopback test to
 * dynamically change the packet speed. It will send a number of High Speed packets
 * determined by USBPHY_USB1_LOOPBACK_HSFSCNT[TSTI_HS_NUMBER], followed by a number
 * of Full Speed packets determined by
 * USBPHY_USB1_LOOPBACK_HSFSCNT[TSTI_FS_NUMBER].
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_MASK) >> USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(base) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT))

/*! @brief Set the TSTI_HSFS_MODE_EN field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_MASK, USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(base, value) (BITBAND_ACCESS32(&USBPHY_USB1_LOOPBACK_REG(base), USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK, field TSTPKT[23:16] (RW)
 *
 * Selects the packet data byte used for USB loopback testing in Pulse mode.
 * Pulse mode is selected by setting USBPHY_USB1_LOOPBACK[2:1] to a value of 2'b01.
 * Default value produces a data inversion at each unit interval.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_TSTPKT field. */
#define USBPHY_RD_USB1_LOOPBACK_TSTPKT(base) ((USBPHY_USB1_LOOPBACK_REG(base) & USBPHY_USB1_LOOPBACK_TSTPKT_MASK) >> USBPHY_USB1_LOOPBACK_TSTPKT_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_TSTPKT(base) (USBPHY_RD_USB1_LOOPBACK_TSTPKT(base))

/*! @brief Set the TSTPKT field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_TSTPKT(base, value) (USBPHY_RMW_USB1_LOOPBACK(base, USBPHY_USB1_LOOPBACK_TSTPKT_MASK, USBPHY_USB1_LOOPBACK_TSTPKT(value)))
#define USBPHY_BWR_USB1_LOOPBACK_TSTPKT(base, value) (USBPHY_WR_USB1_LOOPBACK_TSTPKT(base, value))
/*@}*/

