RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18_extension.h
/*******************************************************************************
 * USBPHY_USB1_LOOPBACK_HSFSCNT - USB PHY Loopback Packet Number Select Register
 ******************************************************************************/

/*!
 * @brief USBPHY_USB1_LOOPBACK_HSFSCNT - USB PHY Loopback Packet Number Select Register (RW)
 *
 * Reset value: 0x00040010U
 */
/*!
 * @name Constants and macros for entire USBPHY_USB1_LOOPBACK_HSFSCNT register
 */
/*@{*/
#define USBPHY_RD_USB1_LOOPBACK_HSFSCNT(base) (USBPHY_USB1_LOOPBACK_HSFSCNT_REG(base))
#define USBPHY_WR_USB1_LOOPBACK_HSFSCNT(base, value) (USBPHY_USB1_LOOPBACK_HSFSCNT_REG(base) = (value))
#define USBPHY_RMW_USB1_LOOPBACK_HSFSCNT(base, mask, value) (USBPHY_WR_USB1_LOOPBACK_HSFSCNT(base, (USBPHY_RD_USB1_LOOPBACK_HSFSCNT(base) & ~(mask)) | (value)))
#define USBPHY_SET_USB1_LOOPBACK_HSFSCNT(base, value) (USBPHY_USB1_LOOPBACK_HSFSCNT_SET_REG(base) = (value))
#define USBPHY_CLR_USB1_LOOPBACK_HSFSCNT(base, value) (USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_REG(base) = (value))
#define USBPHY_TOG_USB1_LOOPBACK_HSFSCNT(base, value) (USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_USB1_LOOPBACK_HSFSCNT bitfields
 */

/*!
 * @name Register USBPHY_USB1_LOOPBACK_HSFSCNT, field TSTI_HS_NUMBER[15:0] (RW)
 *
 * High speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN]
 * is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER field. */
#define USBPHY_RD_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base) ((USBPHY_USB1_LOOPBACK_HSFSCNT_REG(base) & USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK) >> USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base) (USBPHY_RD_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base))

/*! @brief Set the TSTI_HS_NUMBER field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base, value) (USBPHY_RMW_USB1_LOOPBACK_HSFSCNT(base, USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK, USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(value)))
#define USBPHY_BWR_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base, value) (USBPHY_WR_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(base, value))
/*@}*/

/*!
 * @name Register USBPHY_USB1_LOOPBACK_HSFSCNT, field TSTI_FS_NUMBER[31:16] (RW)
 *
 * Full speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN]
 * is set to value 1'b1.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER field. */
#define USBPHY_RD_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base) ((USBPHY_USB1_LOOPBACK_HSFSCNT_REG(base) & USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK) >> USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_SHIFT)
#define USBPHY_BRD_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base) (USBPHY_RD_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base))

/*! @brief Set the TSTI_FS_NUMBER field to a new value. */
#define USBPHY_WR_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base, value) (USBPHY_RMW_USB1_LOOPBACK_HSFSCNT(base, USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK, USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(value)))
#define USBPHY_BWR_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base, value) (USBPHY_WR_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(base, value))
/*@}*/

/*******************************************************************************
 * USBPHY_TRIM_OVERRIDE_EN - USB PHY Trim Override Enable Register
 ******************************************************************************/

/*!
 * @brief USBPHY_TRIM_OVERRIDE_EN - USB PHY Trim Override Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The bit fields in this register allow observation of the default IFR settings
 * of Phy parameters for TX_CAL45DM, TX_CAL45DP, TX_D_CAL, ENV_TAIL_ADJ, and
 * PLL_DIV_SEL. Additional bit fields also determine whether those values can be
 * overridden by settings in the USBPHY_TX, USBPHY_DEBUG1, and USBPHY_PLL_SIC
 * registers.
 */
/*!
 * @name Constants and macros for entire USBPHY_TRIM_OVERRIDE_EN register
 */
/*@{*/
#define USBPHY_RD_TRIM_OVERRIDE_EN(base) (USBPHY_TRIM_OVERRIDE_EN_REG(base))
#define USBPHY_WR_TRIM_OVERRIDE_EN(base, value) (USBPHY_TRIM_OVERRIDE_EN_REG(base) = (value))
#define USBPHY_RMW_TRIM_OVERRIDE_EN(base, mask, value) (USBPHY_WR_TRIM_OVERRIDE_EN(base, (USBPHY_RD_TRIM_OVERRIDE_EN(base) & ~(mask)) | (value)))
#define USBPHY_SET_TRIM_OVERRIDE_EN(base, value) (USBPHY_TRIM_OVERRIDE_EN_SET_REG(base) = (value))
#define USBPHY_CLR_TRIM_OVERRIDE_EN(base, value) (USBPHY_TRIM_OVERRIDE_EN_CLR_REG(base) = (value))
#define USBPHY_TOG_TRIM_OVERRIDE_EN(base, value) (USBPHY_TRIM_OVERRIDE_EN_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_TRIM_OVERRIDE_EN bitfields
 */

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_DIV_SEL_OVERRIDE[0] (RW)
 *
 * Override enable for PLL_DIV_SEL, when set, the register value in
 * USBPHY_PLL_SIC[1:0] will be used.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT))

/*! @brief Set the TRIM_DIV_SEL_OVERRIDE field to a new value. */
#define USBPHY_WR_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(base, value) (USBPHY_RMW_TRIM_OVERRIDE_EN(base, USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_MASK, USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(value)))
#define USBPHY_BWR_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_ENV_TAIL_ADJ_VD_OVERRIDE[1] (RW)
 *
 * Override enable for ENV_TAIL_ADJ, when set, the register value in
 * USBPHY_DEBUG1[14:13] will be used.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT))

